emacs.d/personal/custom/config.org
#+STARTUP: overview
#+TITLE: Johan Widéns Emacs
#+CREATOR: Johan Widén
#+LANGUAGE: en
#+OPTIONS: num:nil
#+ATTR_HTML: :style margin-left: auto; margin-right: auto;
* straight
  :PROPERTIES:
  :ID:       c9ed715c-1ce6-4eff-90fa-72ab858c04de
  :END:
#+BEGIN_SRC emacs-lisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
    (straight-use-package 'use-package)
    (setq straight-use-package-by-default t)
#+END_SRC
* Emacs lisp preferences
  :PROPERTIES:
  :ID:       b4e0f009-f406-463d-a6cb-e88ac9aa3cb0
  :END:
#+BEGIN_SRC emacs-lisp
  (setq load-prefer-newer t)
  ;; (require 'use-package)
  (use-package auto-compile
   :config
    (auto-compile-on-load-mode 1)
    (auto-compile-on-save-mode 1))
  (add-to-list 'load-path "~/.emacs.d/personal/custom")
  ;; Get rid of pesky warnings about bytecomp interactive-p
  ;; (setq warning-minimum-level :error)
  (setq gc-cons-threshold 100000000)
#+END_SRC
* My account settings
  :PROPERTIES:
  :ID:       5ba5753b-5a97-4598-8f4f-2939225f7050
  :END:
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Johan Widén")
(setq user-mail-address "j.e.widen@gmail.com")
#+END_SRC
** Load =.secret.el=
   :PROPERTIES:
   :ID:       4c960438-607d-46c0-bfe7-c193bb3fc8ca
   :END:
I load =~/.emacs.d/.secret.el= to keep sensible things out of version control.
For instance, you could set your identity by customizing both =user-full-name=
and =user-mail-address=. This is also where you want your API tokens to live.

#+BEGIN_SRC emacs-lisp :results silent
(defvar jw/paradox-github-token nil)

(let ((secret.el (expand-file-name ".secret.el" "/home/jw")))
  (when (file-exists-p secret.el)
    (load secret.el)))
#+END_SRC
* Prelude tweaks
  :PROPERTIES:
  :ID:       712c68e2-f72c-4bec-b0e0-2a710904fadd
  :END:
Disable guru-mode (I like using arrow keys :p)
#+BEGIN_SRC emacs-lisp
(setq prelude-guru nil)
(setq prelude-whitespace nil)
(set-fringe-style 8)
(defalias 'yes-or-no-p 'y-or-n-p)

;; Always, always, prefer UTF-8, anything else is insanity
(set-charset-priority 'unicode)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(set-language-environment "UTF-8")
(prefer-coding-system 'utf-8)
(setq default-process-coding-system '(utf-8-unix . utf-8-unix))
;; Treat clipboard input as UTF-8 string first; compound text next, etc.
(setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))
#+END_SRC
* Theme
  :PROPERTIES:
  :ID:       81a815d6-cfca-4851-a440-4d79887be6cb
  :END:
Load the theme
#+BEGIN_SRC emacs-lisp
  (use-package modus-vivendi-theme
   :ensure t)
  (setq prelude-theme 'modus-vivendi)
  (defadvice load-theme (before theme-dont-propagate activate)
    (mapcar #'disable-theme custom-enabled-themes))
  (load-theme 'modus-vivendi t) ;; Dark theme
#+END_SRC
* Archives
   :PROPERTIES:
   :ID:       05d614bc-c8d5-4723-b48f-26277a99637c
   :END:
#+BEGIN_SRC emacs-lisp
  (add-to-list 'package-archives
   '("org" . "https://orgmode.org/elpa/")
   t)
#+END_SRC
* Paradox
   :PROPERTIES:
   :ID:       b5fe3df9-e65f-4663-b656-c6f1fdfd3986
   :END:
#+BEGIN_SRC emacs-lisp
(setq paradox-github-token jw/paradox-github-token)
(setq gnutls-algorithm-priority "NORMAL:-VERS-TLS1.3")
#+END_SRC

* Default frame size, menubar, toolbar, startup message
  :PROPERTIES:
  :ID:       0a157e7d-7482-4529-8f13-58870dff0650
  :END:
#+BEGIN_SRC emacs-lisp
  ;; (setq default-frame-alist
  ;;  (quote ((width . 80)
  ;;          (height . 56))))
  (server-start)
  ;; (run-at-time nil (* 30 60) 'recentf-save-list)
  (run-with-idle-timer 600 t (lambda ()
                              (let ((save-silently t))
                               (recentf-save-list))))
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (setq inhibit-startup-message t)
  (setq image-dired-thumb-size 300)
  (setq x-gtk-use-system-tooltips nil) ;; gtk tooltips do not work for me in i3
  (setq confirm-kill-processes nil)
#+END_SRC
** Better defaults
   :PROPERTIES:
   :ID:       9ad5afea-80cd-4b6f-a2fc-b5ba8fa60fe4
   :END:
#+BEGIN_SRC emacs-lisp
(setq-default
 help-window-select t             ; Focus new help windows when opened
 debug-on-error t
 jit-lock-defer-time 0
 fast-but-imprecise-scrolling t
 sentence-end-double-space nil    ; End a sentence after a dot and a space
 window-combination-resize t      ; Resize windows proportionally
 x-stretch-cursor t               ; Stretch cursor to the glyph width
 history-delete-duplicates t
 )
#+END_SRC

Garbage-collect on focus-out, Emacs /should/ feel snappier.

#+BEGIN_SRC emacs-lisp
(add-hook 'focus-out-hook #'garbage-collect)
#+END_SRC
* Editing
  :PROPERTIES:
  :ID:       eac51d72-b0b5-4554-bb00-97387b57f4c6
  :END:
** Basic editing settings
   :PROPERTIES:
   :ID:       bc646fa3-ddc6-4524-995a-8b460d5f76c1
   :END:
#+BEGIN_SRC emacs-lisp
  (setq global-mark-ring-max 5000         ; increase mark ring to contains 5000 entries
        mark-ring-max 5000                ; increase kill ring to contains 5000 entries
        mode-require-final-newline t      ; add a newline to end of file
        )

  (setq kill-ring-max 5000 ; increase kill-ring capacity
        kill-whole-line t  ; if NIL, kill whole line and move the next line up
        )

  ;; When Delete Selection mode is enabled, typed text replaces the selection
  ;; if the selection is active.  Otherwise, typed text is just inserted at
  ;; point regardless of any selection.  Also, commands that normally delete
  ;; just one character will delete the entire selection instead.
  (delete-selection-mode)
  (bind-key "RET" 'newline-and-indent)
  (global-set-key (kbd "<dead-circumflex>") "^")
  (global-set-key (kbd "<dead-tilde>") "~")
  (global-set-key (kbd "M-+") 'xref-find-references) ; M-? is taken by smartparens
#+END_SRC
** anzu
   :PROPERTIES:
   :ID:       81db8bd9-ca51-4f03-9e05-2dfcd99a2631
   :END:
Provides a minor mode which displays 'current match/total matches'
in the mode-line in various search modes.  This makes it easy to understand
how many matches there are in the current buffer for your search query.
#+BEGIN_SRC emacs-lisp
  ;; (use-package anzu
  ;;   :init
  ;;   (global-anzu-mode)
  ;;   (bind-key "M-%" 'anzu-query-replace)
  ;;   (bind-key "C-M-%" 'anzu-query-replace-regexp))
#+END_SRC

** clean-aindent-mode
   :PROPERTIES:
   :ID:       1a29d3ca-1726-423b-a66a-16e68c57dbd1
   :END:
1. Extension of 'newline-and-indent' that keeps track of the last
auto-indent operation and, if it is abandoned, would take care to
trim down the unused white space characters.

2. Simple indent, if activated, where cursor is aligned with
indent of the lines above.

3. Backspace Unindent. Extension of M-backspace.
When cursor is in the indentation space of a line, or at the first
character and you press M-backspace it will move the entire line to
be aligned to the line above or any other that is with indentation
smaller than the current.
#+BEGIN_SRC emacs-lisp
 (use-package clean-aindent-mode
   :init
  (add-hook 'prog-mode-hook 'clean-aindent-mode))
#+END_SRC
** comments
   :PROPERTIES:
   :ID:       3a771374-2658-4875-9704-1f19fc9e8c54
   :END:
Call a comment command according to the context.

If the region is active, call ‘comment-or-uncomment-region’ to toggle comments.
Else, the function applies to the current line and calls a
different function at each successive call.  The behavior is:
-  First  call : Toggle line commenting
-  Second call :
  -- Kill inline comment if one is present (1)
  -- Insert inline comment otherwise
Given an argument ARG, it reindents the inline comment instead (2).
#+BEGIN_SRC emacs-lisp
  (use-package comment-dwim-2
   :init
   (global-set-key (kbd "M-;") 'comment-dwim-2)
   :config
   ;; (setq cd2/region-command 'cd2/comment-or-uncomment-lines)
   (setq cd2/region-command 'cd2/comment-or-uncomment-region)
  )
#+END_SRC
** customized functions
   :PROPERTIES:
   :ID:       d5a251c6-9a79-4db4-bd59-62b11a424dc1
   :END:
