prelude/personal/custom/config.el
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
  (straight-use-package 'use-package)
  (setq straight-use-package-by-default t)

(setq load-prefer-newer t)
;; (require 'use-package)
(use-package auto-compile
 :config
  (auto-compile-on-load-mode 1)
  (auto-compile-on-save-mode 1))
(add-to-list 'load-path "~/.emacs.d/personal/custom")
;; Get rid of pesky warnings about bytecomp interactive-p
;; (setq warning-minimum-level :error)
(setq gc-cons-threshold 100000000)

(setq user-full-name "Johan Widén")
(setq user-mail-address "j.e.widen@gmail.com")

(defvar jw/paradox-github-token nil)

(let ((secret.el (expand-file-name ".secret.el" "/home/jw")))
  (when (file-exists-p secret.el)
    (load secret.el)))

(setq prelude-guru nil)
(setq prelude-whitespace nil)
(set-fringe-style 8)
(defalias 'yes-or-no-p 'y-or-n-p)

;; Always, always, prefer UTF-8, anything else is insanity
(set-charset-priority 'unicode)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(set-language-environment "UTF-8")
(prefer-coding-system 'utf-8)
(setq default-process-coding-system '(utf-8-unix . utf-8-unix))
;; Treat clipboard input as UTF-8 string first; compound text next, etc.
(setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))

(use-package modus-vivendi-theme
 :ensure t)
(setq prelude-theme 'modus-vivendi)
(defadvice load-theme (before theme-dont-propagate activate)
  (mapcar #'disable-theme custom-enabled-themes))
(load-theme 'modus-vivendi t) ;; Dark theme

(add-to-list 'package-archives
 '("org" . "https://orgmode.org/elpa/")
 t)

(setq paradox-github-token jw/paradox-github-token)
(setq gnutls-algorithm-priority "NORMAL:-VERS-TLS1.3")

;; (setq default-frame-alist
;;  (quote ((width . 80)
;;          (height . 56))))
(server-start)
;; (run-at-time nil (* 30 60) 'recentf-save-list)
(run-with-idle-timer 600 t (lambda ()
                            (let ((save-silently t))
                             (recentf-save-list))))
(menu-bar-mode -1)
(tool-bar-mode -1)
(setq inhibit-startup-message t)
(setq image-dired-thumb-size 300)
(setq x-gtk-use-system-tooltips nil) ;; gtk tooltips do not work for me in i3
(setq confirm-kill-processes nil)

(setq-default
 help-window-select t             ; Focus new help windows when opened
 debug-on-error t
 jit-lock-defer-time 0
 fast-but-imprecise-scrolling t
 sentence-end-double-space nil    ; End a sentence after a dot and a space
 window-combination-resize t      ; Resize windows proportionally
 x-stretch-cursor t               ; Stretch cursor to the glyph width
 history-delete-duplicates t
 )

(add-hook 'focus-out-hook #'garbage-collect)

(setq global-mark-ring-max 5000         ; increase mark ring to contains 5000 entries
      mark-ring-max 5000                ; increase kill ring to contains 5000 entries
      mode-require-final-newline t      ; add a newline to end of file
      )

(setq kill-ring-max 5000 ; increase kill-ring capacity
      kill-whole-line t  ; if NIL, kill whole line and move the next line up
      )

;; When Delete Selection mode is enabled, typed text replaces the selection
;; if the selection is active.  Otherwise, typed text is just inserted at
;; point regardless of any selection.  Also, commands that normally delete
;; just one character will delete the entire selection instead.
(delete-selection-mode)
(bind-key "RET" 'newline-and-indent)
(global-set-key (kbd "<dead-circumflex>") "^")
(global-set-key (kbd "<dead-tilde>") "~")
(global-set-key (kbd "M-+") 'xref-find-references) ; M-? is taken by smartparens

;; (use-package anzu
;;   :init
;;   (global-anzu-mode)
;;   (bind-key "M-%" 'anzu-query-replace)
;;   (bind-key "C-M-%" 'anzu-query-replace-regexp))

(use-package clean-aindent-mode
  :init
 (add-hook 'prog-mode-hook 'clean-aindent-mode))

(use-package comment-dwim-2
 :init
 (global-set-key (kbd "M-;") 'comment-dwim-2)
 :config
 ;; (setq cd2/region-command 'cd2/comment-or-uncomment-lines)
 (setq cd2/region-command 'cd2/comment-or-uncomment-region)
)
