emacs.d/personal/custom/config.org
*** indentation
    :PROPERTIES:
    :ID:       78bf72d6-291f-4f4a-bd68-45cc67e68bf7
    :END:
#+BEGIN_SRC emacs-lisp
;; taken from prelude-editor.el
;; automatically indenting yanked text if in programming-modes
(defvar yank-indent-modes
  '(LaTeX-mode TeX-mode)
  "Modes in which to indent regions that are yanked (or yank-popped).
Only modes that don't derive from `prog-mode' should be listed here.")

(defvar yank-indent-blacklisted-modes
  '(python-mode)
  "Modes for which auto-indenting is suppressed.")

(defvar yank-advised-indent-threshold 1000
  "Threshold (# chars) over which indentation does not automatically occur.")

(defun yank-advised-indent-function (beg end)
  "Do indentation, as long as the region isn't too large."
  (if (<= (- end beg) yank-advised-indent-threshold)
      (indent-region beg end nil)))

(defadvice yank (after yank-indent activate)
  "If current mode is one of 'yank-indent-modes,
indent yanked text (with prefix arg don't indent)."
  (if (and (not (ad-get-arg 0))
           (not (member major-mode yank-indent-blacklisted-modes))
           (or (derived-mode-p 'prog-mode)
               (member major-mode yank-indent-modes)))
      (let ((transient-mark-mode nil))
        (yank-advised-indent-function (region-beginning) (region-end)))))

(defadvice yank-pop (after yank-pop-indent activate)
  "If current mode is one of `yank-indent-modes',
indent yanked text (with prefix arg don't indent)."
  (when (and (not (ad-get-arg 0))
             (not (member major-mode yank-indent-blacklisted-modes))
             (or (derived-mode-p 'prog-mode)
                 (member major-mode yank-indent-modes)))
    (let ((transient-mark-mode nil))
      (yank-advised-indent-function (region-beginning) (region-end)))))

;; prelude-core.el
(defun indent-buffer ()
  "Indent the currently visited buffer."
  (interactive)
  (indent-region (point-min) (point-max)))

;; prelude-editing.el
(defcustom prelude-indent-sensitive-modes
  '(python-mode yaml-mode)
  "Modes for which auto-indenting is suppressed."
  :type 'list)

(defun indent-region-or-buffer ()
  "Indent a region if selected, otherwise the whole buffer."
  (interactive)
  (unless (member major-mode prelude-indent-sensitive-modes)
    (save-excursion
      (if (region-active-p)
          (progn
            (indent-region (region-beginning) (region-end))
            (message "Indented selected region."))
        (progn
          (indent-buffer)
          (message "Indented buffer.")))
      (whitespace-cleanup))))

(global-set-key (kbd "C-c i") 'indent-region-or-buffer)
#+END_SRC

** iedit
   :PROPERTIES:
   :ID:       f3f94b25-ce36-43d9-8fe1-c946ce6c5f56
   :END:
This package includes Emacs minor modes (iedit-mode and
iedit-rectangle-mode) based on a API library (iedit-lib) and allows you to edit
one occurrence of some text in a buffer (possibly narrowed) or region, and
simultaneously have other occurrences edited in the same way, with visual
feedback as you type.
#+BEGIN_SRC emacs-lisp
  ;; (use-package iedit
  ;;   :bind (("C-;" . iedit-mode))
  ;;   :init
  ;;   (setq iedit-toggle-key-default nil))
#+END_SRC
** undo-tree
   :PROPERTIES:
   :ID:       5f5b07ec-849c-4835-89a6-3fff13fb92ac
   :END:
#+BEGIN_SRC emacs-lisp
(use-package undo-tree
  :init
  (global-undo-tree-mode 1))
#+END_SRC

** volatile-highlights
   :PROPERTIES:
   :ID:       a3f1a374-c617-45e7-bcba-7e2fd3fd610e
   :END:
This library provides minor mode `volatile-highlights-mode', which
brings visual feedback to some operations by highlighting portions
relating to the operations.

All of highlights made by this library will be removed when any new operation is executed.
#+BEGIN_SRC emacs-lisp
 (use-package volatile-highlights
   :init
   (volatile-highlights-mode t))
#+END_SRC
** whole-line-or-region
   :PROPERTIES:
   :ID:       fcd13b5e-a7a3-4e86-a0ff-faa7ec6cc2b9
   :END:
#+BEGIN_SRC emacs-lisp
(use-package whole-line-or-region
  :config
  (whole-line-or-region-global-mode 1)
  )
#+END_SRC
** easy-kill easy-mark
   :PROPERTIES:
   :ID:       5c22a4db-7f65-44ae-9d52-6ed953630df8
   :END:
#+BEGIN_SRC emacs-lisp
;; (global-set-key [remap kill-ring-save] 'easy-kill)
;; (global-set-key [remap mark-sexp] 'easy-mark)
#+END_SRC
** mark-thing-at
   :PROPERTIES:
   :ID:       f3ee366b-3475-424e-9db0-3503308cad99
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package mark-thing-at
   :ensure t
   :config
   (mark-thing-at-mode))
#+END_SRC
* Flycheck
  :PROPERTIES:
  :ID:       ad51d4b4-8407-4ff9-bb92-61fa59903065
  :END:
#+BEGIN_SRC emacs-lisp
(add-hook 'c++-mode-hook (lambda () (setq flycheck-gcc-language-standard "c++14")))
(add-hook 'c++-mode-hook (lambda () (setq flycheck-clang-language-standard "c++14")))
#+END_SRC
** flycheck-pos-tip
   :PROPERTIES:
   :ID:       f5b467e6-2f8e-4613-a727-c60465e28b1a
   :END:
#+BEGIN_SRC emacs-lisp
(use-package flycheck-pos-tip
  :config
  (custom-set-variables
   '(flycheck-display-errors-function #'flycheck-pos-tip-error-messages))
  )
#+END_SRC
* Key binding support
  :PROPERTIES:
  :ID:       42ad5a63-3273-4ea4-bf10-bb6543fdc59a
  :END:
** bind-key
   :PROPERTIES:
   :ID:       35ad6491-d69c-4e1b-bc24-6dffc65f20bc
   :END:
#+BEGIN_SRC emacs-lisp
(use-package bind-key)
#+END_SRC
** quail pc105-se
   :PROPERTIES:
   :ID:       06a5f213-767b-4a4c-ab41-287111dd2c35
   :END:
BEGIN_SRC emacs-lisp
  (eval-after-load 'quail
    '(progn
       (add-to-list 'quail-keyboard-layout-alist
                    '("pc105-se" . "\
                                \
  \247\2751!2\"3#4\2445%6&7/8(9)0=+?\047\140    \
    qQwWeErRtTyYuUiIoOpP\345\305\042^    \
    aAsSdDfFgGhHjJkKlL\366\326\344\304'*    \
  <>zZxXcCvVbBnNmM,;.:-_        \
                                "))
       (quail-set-keyboard-layout "pc105-se")))
  (setq default-input-method "swedish-keyboard")
END_SRC
* lolsmacs
  :PROPERTIES:
  :ID:       3bc6216e-1900-4d16-be19-73575aeedc1a
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package lolsmacs
    :straight (:host github
               :repo "grettke/lolsmacs"
               :files ("*.el"))
  )
  (require 'lolsmacs)
  (lolsmacs-init)
#+END_SRC
* Scroll in place
  :PROPERTIES:
  :ID:       fb9672dd-af99-474a-a7f3-c34852077218
  :END:
#+BEGIN_SRC emacs-lisp
(global-set-key [(hyper up)]
                (lambda ()
                  (interactive)
                  (let ((scroll-preserve-screen-position nil))
                    (scroll-down 1))) )
(global-set-key [(hyper down)]
                (lambda ()
                  (interactive)
                  (let ((scroll-preserve-screen-position nil))
                    (scroll-up 1))) )
#+END_SRC
* Copy paste
  :PROPERTIES:
  :ID:       d151b2a1-1824-4841-833b-2b6f29df3bf2
  :END:
#+BEGIN_SRC emacs-lisp
(setq save-interprogram-paste-before-kill t)
#+END_SRC
* Regular expressions
  :PROPERTIES:
  :ID:       6e87653b-b981-4bf2-8d16-48f64f0afb4f
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package pcre2el
    :straight t
    :diminish (pcre-mode . "")
    :config
    (pcre-mode t))
#+END_SRC

This package highlights matches and previews replacements in query replace.
#+BEGIN_SRC emacs-lisp
  (use-package visual-regexp
    :straight t
    :bind (;; Replace the regular query replace with the regexp query
           ;; replace provided by this package.
           ("M-%" . vr/query-replace)))
#+END_SRC

This package allows the use of other regexp engines for visual-regexp.
#+BEGIN_SRC emacs-lisp
  (use-package visual-regexp-steroids
    :straight t
    :after visual-regexp
    :config
    ;; Use Perl-style regular expressions by default.
    (setq vr/engine 'pcre2el))
#+END_SRC
* Avy
  :PROPERTIES:
  :ID:       d5035bbf-cfa2-4908-b58d-3a2fff4d5060
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package avy
    :straight t
    :bind (("C-'" . avy-goto-char-2)
           ("M-g f" . avy-goto-line)
           ("M-g w" . avy-goto-word-1)
           ("M-g e" . avy-goto-word-0))
    :config
    (avy-setup-default)
  )
#+END_SRC
* Ivy
  :PROPERTIES:
  :ID:       f13d136b-74a0-4813-a537-40efdb664b30
  :END:
Note that when searching with swiper, the following work:
C-s C-s redo last search
M-n ivy-next-history-element
M-j ivy-yank-word
#+BEGIN_SRC emacs-lisp
  (use-package ivy
    :straight t
    :init
    (progn
      (ivy-mode 1)
      (setq ivy-use-virtual-buffers t)
      (global-set-key (kbd "C-s") 'swiper)
      (define-key minibuffer-local-map (kbd "C-r") 'counsel-minibuffer-history)
      (define-key shell-mode-map (kbd "C-r") 'counsel-shell-history)))
  (use-package ivy-hydra
    :straight t
  )
#+END_SRC
* Counsel
  :PROPERTIES:
  :ID:       d16f4637-c47f-44ff-8c9f-b9762944e5a0
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package counsel
    :straight t
    :bind
    (;;("M-x" . counsel-M-x)
     ("C-t" . counsel-M-x)
     ;;("M-y" . counsel-yank-pop)
     ;;("C-c r" . counsel-recentf)
     ;;("C-x C-f" . counsel-find-file)
     ;; ("<f1> f" . counsel-describe-function)
     ;; ("<f1> v" . counsel-describe-variable)
     ("<f1> l" . counsel-load-library)
     ;;("C-h f" . counsel-describe-function)
     ;;("C-h v" . counsel-describe-variable)
     ;;("C-h l" . counsel-load-library)
  ))

  (use-package projectile
    :straight t
    :init
    (projectile-global-mode)
    (setq projectile-enable-caching t))

  ;; (use-package counsel-projectile
  ;;   :ensure t
  ;; )
#+END_SRC
* Company
  :PROPERTIES:
  :ID:       6f2ae83f-ff45-4b59-b7e4-482e4f7635c5
  :END:
