prelude/personal/custom/config.el

;; taken from prelude-editor.el
;; automatically indenting yanked text if in programming-modes
(defvar yank-indent-modes
  '(LaTeX-mode TeX-mode)
  "Modes in which to indent regions that are yanked (or yank-popped).
Only modes that don't derive from `prog-mode' should be listed here.")

(defvar yank-indent-blacklisted-modes
  '(python-mode)
  "Modes for which auto-indenting is suppressed.")

(defvar yank-advised-indent-threshold 1000
  "Threshold (# chars) over which indentation does not automatically occur.")

(defun yank-advised-indent-function (beg end)
  "Do indentation, as long as the region isn't too large."
  (if (<= (- end beg) yank-advised-indent-threshold)
      (indent-region beg end nil)))

(defadvice yank (after yank-indent activate)
  "If current mode is one of 'yank-indent-modes,
indent yanked text (with prefix arg don't indent)."
  (if (and (not (ad-get-arg 0))
           (not (member major-mode yank-indent-blacklisted-modes))
           (or (derived-mode-p 'prog-mode)
               (member major-mode yank-indent-modes)))
      (let ((transient-mark-mode nil))
        (yank-advised-indent-function (region-beginning) (region-end)))))

(defadvice yank-pop (after yank-pop-indent activate)
  "If current mode is one of `yank-indent-modes',
indent yanked text (with prefix arg don't indent)."
  (when (and (not (ad-get-arg 0))
             (not (member major-mode yank-indent-blacklisted-modes))
             (or (derived-mode-p 'prog-mode)
                 (member major-mode yank-indent-modes)))
    (let ((transient-mark-mode nil))
      (yank-advised-indent-function (region-beginning) (region-end)))))

;; prelude-core.el
(defun indent-buffer ()
  "Indent the currently visited buffer."
  (interactive)
  (indent-region (point-min) (point-max)))

;; prelude-editing.el
(defcustom prelude-indent-sensitive-modes
  '(python-mode yaml-mode)
  "Modes for which auto-indenting is suppressed."
  :type 'list)

(defun indent-region-or-buffer ()
  "Indent a region if selected, otherwise the whole buffer."
  (interactive)
  (unless (member major-mode prelude-indent-sensitive-modes)
    (save-excursion
      (if (region-active-p)
          (progn
            (indent-region (region-beginning) (region-end))
            (message "Indented selected region."))
        (progn
          (indent-buffer)
          (message "Indented buffer.")))
      (whitespace-cleanup))))

(global-set-key (kbd "C-c i") 'indent-region-or-buffer)

;; (use-package iedit
;;   :bind (("C-;" . iedit-mode))
;;   :init
;;   (setq iedit-toggle-key-default nil))

(use-package undo-tree
  :init
  (global-undo-tree-mode 1))

(use-package volatile-highlights
  :init
  (volatile-highlights-mode t))

(use-package whole-line-or-region
  :config
  (whole-line-or-region-global-mode 1)
  )

;; (global-set-key [remap kill-ring-save] 'easy-kill)
;; (global-set-key [remap mark-sexp] 'easy-mark)

(use-package mark-thing-at
 :ensure t
 :config
 (mark-thing-at-mode))

(add-hook 'c++-mode-hook (lambda () (setq flycheck-gcc-language-standard "c++14")))
(add-hook 'c++-mode-hook (lambda () (setq flycheck-clang-language-standard "c++14")))

(use-package flycheck-pos-tip
  :config
  (custom-set-variables
   '(flycheck-display-errors-function #'flycheck-pos-tip-error-messages))
  )

(use-package bind-key)

(global-set-key [(hyper up)]
                (lambda ()
                  (interactive)
                  (let ((scroll-preserve-screen-position nil))
                    (scroll-down 1))) )
(global-set-key [(hyper down)]
                (lambda ()
                  (interactive)
                  (let ((scroll-preserve-screen-position nil))
                    (scroll-up 1))) )

(setq save-interprogram-paste-before-kill t)

(use-package pcre2el
  :straight t
  :diminish (pcre-mode . "")
  :config
  (pcre-mode t))

(use-package visual-regexp
  :straight t
  :bind (;; Replace the regular query replace with the regexp query
         ;; replace provided by this package.
         ("M-%" . vr/query-replace)))

(use-package visual-regexp-steroids
  :straight t
  :after visual-regexp
  :config
  ;; Use Perl-style regular expressions by default.
  (setq vr/engine 'pcre2el))

(use-package avy
  :straight t
  :bind (("C-'" . avy-goto-char-2)
         ("M-g f" . avy-goto-line)
         ("M-g w" . avy-goto-word-1)
         ("M-g e" . avy-goto-word-0))
  :config
  (avy-setup-default)
)

(use-package ivy
  :straight t
  :init
  (progn
    (ivy-mode 1)
    (setq ivy-use-virtual-buffers t)
    (global-set-key (kbd "C-s") 'swiper)
    (define-key minibuffer-local-map (kbd "C-r") 'counsel-minibuffer-history)
    (define-key shell-mode-map (kbd "C-r") 'counsel-shell-history)))
(use-package ivy-hydra
  :straight t
)

(use-package counsel
  :straight t
  :bind
  (;;("M-x" . counsel-M-x)
   ("C-t" . counsel-M-x)
   ;;("M-y" . counsel-yank-pop)
   ;;("C-c r" . counsel-recentf)
   ;;("C-x C-f" . counsel-find-file)
   ;; ("<f1> f" . counsel-describe-function)
   ;; ("<f1> v" . counsel-describe-variable)
   ("<f1> l" . counsel-load-library)
   ;;("C-h f" . counsel-describe-function)
   ;;("C-h v" . counsel-describe-variable)
   ;;("C-h l" . counsel-load-library)
))

(use-package projectile
  :straight t
  :init
  (projectile-global-mode)
  (setq projectile-enable-caching t))

;; (use-package counsel-projectile
;;   :ensure t
;; )

;; (use-package company
;;   :init
