emacs.d/personal/custom/config.org
** Company
   :PROPERTIES:
   :ID:       862fb445-a3c7-443d-8123-514ef552832e
   :END:
#+BEGIN_SRC emacs-lisp
  ;; (use-package company
  ;;   :init
  ;;   (use-package company-c-headers)
  ;;   :config
  ;;   (add-hook 'after-init-hook 'global-company-mode)

  ;;   ;; (add-hook 'haskell-mode-hook 'company-mode)
  ;;   ;; (add-to-list 'company-backends 'company-ghc)
  ;;   (add-to-list 'company-backends 'company-c-headers)
  ;;   (add-to-list 'company-c-headers-path-system "/usr/include/c++/6/")
  ;;   ;; (custom-set-variables '(company-ghc-show-info t))
  ;;   (custom-set-variables '(company-show-numbers t))
  ;;   (setq company-backends (delete 'company-semantic company-backends))
  ;;   (define-key c-mode-map  [(control tab)] 'company-complete)
  ;;   (define-key c++-mode-map  [(control tab)] 'company-complete)
  ;;   )
  ;; ;; (define-key c-mode-map  [(tab)] 'company-complete)
  ;; ;; (define-key c++-mode-map  [(tab)] 'company-complete)
#+END_SRC
** company-auctex
   :PROPERTIES:
   :ID:       802b186c-9a87-40bf-89f5-d87733147af7
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package company-auctex
    :straight t
    :config
    (company-auctex-init))
#+END_SRC
** company-quickhelp
   :PROPERTIES:
   :ID:       802b186c-9a87-40bf-89f5-d87733147af7
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package company-quickhelp
    :straight t
    :config
    (company-quickhelp-mode 1)
  )
#+END_SRC
* Color
  :PROPERTIES:
  :ID:       e1b2e0fc-0640-4e10-ab8c-95de60e3ce15
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-blocks
    :straight t
  )
#+END_SRC
Turned off because I now use Info+
#+BEGIN_SRC emacs-lisp
  ;; (use-package info-colors
  ;;  :init
  ;;  (add-hook 'Info-selection-hook 'info-colors-fontify-node)
  ;; )
#+END_SRC
* Cursor
  CLOSED: [2020-04-05 sön 12:13]
  :PROPERTIES:
  :ID:       269c94ea-c87a-4ca4-872a-5ee0d644e76e
  :END:
Use a bar cursor when mark is active and a region exists.
#+BEGIN_SRC emacs-lisp
(defun th-activate-mark-init ()
  (setq cursor-type 'bar))
(add-hook 'activate-mark-hook 'th-activate-mark-init)

(defun th-deactivate-mark-init ()
  (setq cursor-type 'box))

(add-hook 'deactivate-mark-hook 'th-deactivate-mark-init)
#+END_SRC

With zenburn the cursor-color will be black for all but the initial frame unless we do some workaround.
#+BEGIN_SRC emacs-lisp
(set-cursor-color "firebrick")
(setq hcz-set-cursor-color-color "")
(setq hcz-set-cursor-color-buffer "")

(defun my-set-cursor-color ()
  "Change cursor color according to themes/init.el"
  ;; set-cursor-color is somewhat costly, so we only call it when needed:
  (let ((color "firebrick"))
    (unless (and
             (string= color hcz-set-cursor-color-color)
             (string= (buffer-name) hcz-set-cursor-color-buffer))
      (set-cursor-color (setq hcz-set-cursor-color-color color))
      (setq hcz-set-cursor-color-buffer (buffer-name)))))

(add-hook 'post-command-hook 'my-set-cursor-color)
#+END_SRC

Don't let the cursor go into minibuffer prompt
#+BEGIN_SRC emacs-lisp
(setq minibuffer-prompt-properties
      (quote (read-only t point-entered minibuffer-avoid-prompt
                        face minibuffer-prompt)))
#+END_SRC
* Mouse
  :PROPERTIES:
  :ID:       7c85fdbb-a1cf-4443-8d51-ae5e19ae86f8
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package mouse-copy
    :straight t
    :config
    (bind-key [C-down-mouse-1] 'mouse-drag-secondary-pasting)
    (bind-key [C-S-down-mouse-1] 'mouse-drag-secondary-moving)
  )

(global-set-key [remap mouse-drag-secondary] 'mouse-drag-region)
(global-set-key [remap mouse-set-secondary] 'mouse-set-region)
(global-set-key [remap mouse-start-secondary] 'mouse-set-point)
(global-set-key [remap mouse-yank-secondary] 'mouse-yank-primary)
(global-set-key [remap mouse-secondary-save-then-kill] 'mouse-save-then-kill)
#+END_SRC
* Handling of whitespace
  :PROPERTIES:
  :ID:       1791cab1-6d04-467d-b823-d75cdb03cd92
  :END:
#+BEGIN_SRC emacs-lisp
  ;; show unncessary whitespace that can mess up your diff
  (add-hook 'diff-mode-hook
            (lambda ()
              (setq-local whitespace-style
                          '(face
                            tabs
                            tab-mark
                            spaces
                            space-mark
                            trailing
                            indentation::space
                            indentation::tab
                            newline
                            newline-mark))
              (whitespace-mode 1)))

  (add-hook 'org-mode-hook
            (lambda ()
              (setq-local whitespace-style
                          '(tab-mark
                            trailing))
              (whitespace-mode 1)))

  (add-hook 'prog-mode-hook
            (lambda () (interactive)
              (setq show-trailing-whitespace 1)))

  (add-hook 'sh-mode-hook
            (lambda ()
              (setq tab-width 4)))

  ;; use space to indent by default
  (setq-default indent-tabs-mode nil)

  ;; set appearance of a tab that is represented by 4 spaces
  (setq-default tab-width 4)

  ;; Toggle whitespace-mode to view all whitespace characters
  (bind-key "C-c w" 'whitespace-mode)
#+END_SRC
** hungry-delete
   :PROPERTIES:
   :ID:       7784be72-f56d-4f2f-b83d-041da0c2e110
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package hungry-delete
    :straight t
    :config
    (global-hungry-delete-mode))
#+END_SRC
** ws-butler
   :PROPERTIES:
   :ID:       52cf9afd-66de-414d-8d90-25542e467efd
   :END:
Unobtrusively remove trailing whitespace.
#+BEGIN_SRC emacs-lisp
  (use-package ws-butler
    :straight t
    :init
    (add-hook 'prog-mode-hook 'ws-butler-mode)
    (add-hook 'text-mode 'ws-butler-mode)
    (add-hook 'fundamental-mode 'ws-butler-mode))
#+END_SRC
* Fonts
  :PROPERTIES:
  :ID:       d252e120-32ac-406d-bfe1-7394928dcf14
  :END:
** Some font suggestions
   :PROPERTIES:
   :ID:       0c27b82b-0fb9-48cd-b9d2-76d7ce34822b
   :END:
Also look at [[../fonts.el]]
#+BEGIN_SRC emacs-lisp
  ;(set-face-attribute 'default nil :font
  ; "-unknown-Liberation Mono-normal-normal-normal-*-13-*-*-*-m-0-iso10646-1")
  ;; (set-face-attribute 'default nil :font
  ;; "-*-anonymous pro-medium-r-normal-*-16-*-*-*-m-*-iso10646-1")
  ;(set-face-attribute 'default nil :font
  ; "-*-cousine-medium-r-normal-*-13-*-*-*-m-*-iso10646-1")
  ;; (set-face-attribute 'default nil :font
  ;; "-*-dejavu sans mono-medium-r-normal-*-13-*-*-*-m-*-iso10646-1")
  ;; (set-face-attribute 'default nil :font
  ;; "-*-droid sans mono-medium-r-normal-*-13-*-*-*-m-*-iso10646-1")
  ;(set-face-attribute 'default nil :font
  ; "-*-fira mono-regular-r-normal-*-13-*-*-*-m-*-iso10646-1")
  ;(set-face-attribute 'default nil :font
  ; "-*-hermit-medium-r-normal-*-13-*-*-*-m-*-iso10646-1")
  ;; (set-face-attribute 'default nil :font
  ;; "-*-inconsolata-medium-r-normal-*-16-*-*-*-m-*-iso10646-1")
  ;(set-face-attribute 'default nil :font
  ; "-*-oxygen mono-medium-r-normal-*-13-*-*-*-m-*-iso10646-1")
  ;(set-face-attribute 'default nil :font
  ; "-*-pt mono-regular-r-normal-*-13-*-*-*-m-*-iso10646-1")
  ;; (set-face-attribute 'default nil :font
  ;;  "-*-source code pro-regular-r-normal-*-13-*-*-*-m-*-iso10646-1")
#+END_SRC
** mixed-pitch
   :PROPERTIES:
   :ID:       a22efcf9-78ea-48e9-8641-635819628aa8
   :END:
#+BEGIN_SRC emacs-lisp
  ;; (use-package mixed-pitch
  ;;   :ensure t
  ;;   :config
  ;;   ;; If you want it in all text modes:
  ;;   ;; (add-hook 'text-mode-hook #'mixed-pitch-mode)
  ;;   ;; (add-hook 'org-mode-hook #'mixed-pitch-mode)
  ;;   ;; Depending on your specific setup, you may want to adjust the height of
  ;;   ;; variable pitch fonts:
  ;;   (set-face-attribute 'variable-pitch nil :height 100)
  ;;   )
#+END_SRC
** org-variable-pitch
   :PROPERTIES:
   :ID:       bf75bff9-94a2-45b9-9040-93c7e004f6bb
   :END:
#+BEGIN_SRC emacs-lisp
  ;; (defcustom org-variable-pitch-fixed-font "Hack"
  ;;   "Monospace font to use with ‘org-variable-pitch-minor-mode’."
  ;;   :group 'org-variable-pitch
  ;;   :type 'string
  ;;   :risky t)
  ;; (setq org-variable-pitch-fixed-faces
  ;;   '(org-block
  ;;     org-block-begin-line
  ;;     org-block-end-line
  ;;     org-code
  ;;     org-date
  ;;     org-document-info-keyword
  ;;     org-done
  ;;     org-formula
  ;;     org-link
  ;;     org-meta-line
  ;;     org-property-value
  ;;     org-special-keyword
  ;;     org-table
  ;;     org-tag
  ;;     org-todo
  ;;     org-verbatim))
  ;; (require 'org-variable-pitch)
  ;; (add-hook 'org-mode-hook 'org-variable-pitch-minor-mode)
#+END_SRC
