emacs.d/personal/custom/config.org
*** Primary and complementary font settings
    :PROPERTIES:
    :CUSTOM_ID: h:e03b6415-a18f-4058-b9b0-5721d38c6c50
    :ID:       b1cb283d-3cfd-418c-9923-6e55c3901ca1
    :END:

Moving on to my configurations, =prot/font-set-fonts= is a command that
lets me switch font sizes through a completion interface (more on that
in [[#h:98d3abcc-f34e-4029-aabc-740f0b6421f8][Completion framework and extras]]).  When the function is executed
non-interactively, it can be given an arbitrary font size as well as
family names for the {mono,proportionately}-spaced typefaces.

While there are many ways to define a baseline or fallback font family
in Emacs, I find that the most consistent one in terms of overall
configuration is to do it at the "face" level.  For the main typeface,
we configure the =default= face.  Then we have =variable-pitch= for
proportionately-spaced fonts and =fixed-pitch= for monospaced ones.

In Emacs parlance, "face" signifies a construct that groups together
several display attributes, such as a foreground and a background
colour, as well as all typography-related values (Emacs themes are, in
essence, programs that configure those faces).

To understand the syntax used here, do =C-h f set-face-attribute=.  In
essence, by changing the =default= face we are specifying the family that
should be used /in case no other applies/ for the given construct.  This
is actually a good idea because there are many scenaria where you want a
face to retain its own attributes (e.g. let =org-mode= inline code be
presented in its monospaced font while using a sans-serif for the main
text---see [[#h:414b33cd-66f7-4daf-814f-373e08dff7f8][Mode for proportional fonts]]).

The two main ways to set a font using =set-face-attribute= are as follows:

+ Set individual attributes :: Define the values of keywords like
  =:family=, =:height=, =:weight= on a per-attribute basis.
+ Set font parameters :: Pass a single string that is consistent with
  how =fontconfig= (GNU/Linux) reads fonts.  This allows us to apply
  parameters that are specified in the [[https://www.freedesktop.org/software/fontconfig/fontconfig-user.html][fontconfig user spec]], such as
  whether to implement an antialiasing effect or tweak the hinting
  style.  Note that /all fontconfig parameters are optional/ and will
  default to the rules that apply across the operating system.

I choose the latter because it is more flexible.  For completeness, this
is the syntax, replacing all capitalised words with the appropriate
values (read the docs with =C-h f set-face-attribute=):

+ =(set-face-attribute 'FACE nil :family "NAME" :height "HEIGHT")=
+ =(set-face-attribute 'FACE nil :font "FAMILY-SIZE:PARAM1=PARAMVALUE1")=

Also bear in mind that on a GNU/Linux system there normally is no need
to test for the presence of a font before setting it.  This is handled
by =fontconfig= with rules that can be defined at the user or system level
(things work out-of-the-box on every distro I ever tried).

#+begin_src emacs-lisp
(use-package emacs
  :commands (prot/font-set-face-attribute
             prot/font-set-fonts
             prot/font-set-font-size-family
             prot/font-line-spacing
             prot/font-fonts-per-monitor)
  :config
  (setq x-underline-at-descent-line t)
  (setq underline-minimum-offset 1)

  (defconst prot/font-fontconfig-params
    "embeddedbitmap=false:autohint=false:hintstyle=hintslight"
    "Additional parameters for the given font family.
These are specific to the fontconfig backend for GNU/Linux systems.")

  (defvar prot/font-switch-fonts-hook nil
    "Hook that is called from `prot/font-set-fonts-completion'.")

  ;; The idea with this association list is to use font combinations
  ;; that are suitable to the given point size.  I find that at smaller
  ;; sizes the open and wide proportions of Hack+FiraGO work well, while
  ;; the more compact Iosevka+Source Sans Pro are better at larger point
  ;; sizes.  The "desktop" combo is ideal for use on a larger monitor at
  ;; a regular point size.
  ;;
  ;; Note that the "Hack" mentioned here is my patched version of it,
  ;; which uses some alternative glyphs, is built on top of the latest
  ;; dev branch, and is meant to improve both the Roman and Italic
  ;; variants (alt glyphs are part of the Hack project):
  ;; https://gitlab.com/protesilaos/hackfontmod
  (defconst prot/font-sizes-families-alist
    '(("laptop" . (10.5 "Hack" "FiraGO"))
	  ("desktop" . (12 "Ubuntu Mono" "FiraGO"))
	  ("presentation" . (19 "Iosevka SS08" "Source Sans Pro")))
    "Alist of desired point sizes and their typefaces.
Each association consists of a display type mapped to a point
size, followed by monospaced and proportionately-spaced font
names.

The monospaced typeface is meant to be applied to the `default'
and `fixed-pitch' faces.  The proportionately-space font is
intended for the `variable-pitch' face.")

  (defun prot/font-set-face-attribute (face family size &optional params)
    "Set FACE font to FAMILY at SIZE with optional PARAMS."
    (let ((params (if params
			          params
		            prot/font-fontconfig-params)))
	  (set-face-attribute
	   `,face nil :font
	   (format "%s-%s:%s" family (number-to-string size) params))))

  (defun prot/font-set-fonts (&optional points font-mono font-var)
    "Set default font size using presets.

POINTS is the font's point size, represented as either '10' or
'10.5'.  FONT-MONO should be a monospaced typeface, due to the
alignment requirements of the `fixed-pitch' face.  FONT-VAR could
be a proportionately-spaced typeface or even a monospaced one,
since the `variable-pitch' it applies to is not supposed to be
spacing-sensitive.  Both families must be represented as a string
holding the family's name."
    (interactive)
    (let* ((data prot/font-sizes-families-alist)
	       (displays (mapcar #'car data))
	       (choice (if points
                       points
		             (completing-read "Pick display size: " displays nil t)))
	       (size (if points
		             points
		           (nth 1 (assoc `,choice data))))
	       (mono (if font-mono
		             font-mono
		           (if (member choice displays)
                       (nth 2 (assoc `,choice data))
                     nil)))
	       (var (if font-var
		            font-var
                  (if (member choice displays)
                      (nth 3 (assoc `,choice data))
                    nil))))
	  (when window-system
        (dolist (face '(default fixed-pitch))
	      (prot/font-set-face-attribute `,face mono size))
	    ;; Increasing the size on this to account for the innate
	    ;; difference between the families I use.  Maybe there is some
	    ;; more flexible way to create visual harmony between typefaces
	    ;; with distinct inherent heights, without trying to query for
	    ;; the current family in use.
        ;;
        ;; TODO normalise font heights automatically?
	    (prot/font-set-face-attribute 'variable-pitch var (+ size 1))))
	(run-hooks 'prot/font-switch-fonts-hook))

  (defvar prot/font-monospaced-fonts-list
    '("Hack" "Iosevka SS08" "Iosevka Slab" "Source Code Pro"
      "Ubuntu Mono" "Fantasque Sans Mono" "DejaVu Sans Mono"
      "Fira Code" "Victor Mono" "Roboto Mono")
    "List of typefaces for coding.
See `prot/font-set-font-size-family' for how this is used.")

  (defun prot/font-set-font-size-family ()
    "Set point size and main typeface."
    (interactive)
    (let* ((fonts prot/font-monospaced-fonts-list)
           (font (completing-read "Select main font: " fonts nil t))
           (nums (list 13 14 15 16))
           (sizes (mapcar 'number-to-string nums))
           (size (completing-read "Select or insert number: " sizes nil)))
      (prot/font-set-fonts (string-to-number size) font)))

  (defun prot/font-fonts-dwim (&optional arg)
    "Set fonts interactively.
This is just a wrapper around `prot/font-set-fonts' and
`prot/font-set-font-size-family', whose sole purpose is to
economise on dedicated key bindings."
    (interactive "P")
    (if arg
        (prot/font-set-font-size-family)
      (prot/font-set-fonts)))

  (defvar prot/font-fonts-line-spacing-list
    '("Source Code Pro" "Ubuntu Mono")
    "Font families in need of extra `line-spacing'.
See `prot/font-line-spacing' for how this is used.")

  (defun prot/font-line-spacing ()
	"Determine desirable `line-spacing', based on font family.
Add this to `prot/font-switch-fonts-hook'."
	(let ((fonts prot/font-fonts-line-spacing-list))
	  (if (member (face-attribute 'default :family) fonts)
	      (setq-default line-spacing 1)
	    (setq-default line-spacing nil))))

  (defun prot/font-fonts-per-monitor ()
	"Use font settings based on screen size.
Meant to be used at some early initialisation stage, such as with
`after-init-hook'."
	(let* ((display (if (<= (display-pixel-width) 1366)
			            "laptop"
		              "desktop"))
	       (data prot/font-sizqes-families-alist)
           (size (cadr (assoc `,display data)))
	       (mono (nth 2 (assoc `,display data)))
	       (var (nth 3 (assoc `,display data))))
	  (prot/font-set-fonts size mono var)))

  :hook ((after-init-hook . prot/font-fonts-per-monitor)
	     (prot/font-switch-fonts-hook . prot/font-line-spacing))
  ;; Awkward key because I do not need it very often.  Maybe once a day.
  ;; The "C-c f" is used elsewhere.
  :bind ("C-c F" . prot/font-fonts-dwim))
#+end_src

