prelude/personal/custom/config.el

(use-package emacs
  :commands (prot/font-set-face-attribute
             prot/font-set-fonts
             prot/font-set-font-size-family
             prot/font-line-spacing
             prot/font-fonts-per-monitor)
  :config
  (setq x-underline-at-descent-line t)
  (setq underline-minimum-offset 1)

  (defconst prot/font-fontconfig-params
    "embeddedbitmap=false:autohint=false:hintstyle=hintslight"
    "Additional parameters for the given font family.
These are specific to the fontconfig backend for GNU/Linux systems.")

  (defvar prot/font-switch-fonts-hook nil
    "Hook that is called from `prot/font-set-fonts-completion'.")

  ;; The idea with this association list is to use font combinations
  ;; that are suitable to the given point size.  I find that at smaller
  ;; sizes the open and wide proportions of Hack+FiraGO work well, while
  ;; the more compact Iosevka+Source Sans Pro are better at larger point
  ;; sizes.  The "desktop" combo is ideal for use on a larger monitor at
  ;; a regular point size.
  ;;
  ;; Note that the "Hack" mentioned here is my patched version of it,
  ;; which uses some alternative glyphs, is built on top of the latest
  ;; dev branch, and is meant to improve both the Roman and Italic
  ;; variants (alt glyphs are part of the Hack project):
  ;; https://gitlab.com/protesilaos/hackfontmod
  (defconst prot/font-sizes-families-alist
    '(("laptop" . (10.5 "Hack" "FiraGO"))
	  ("desktop" . (12 "Ubuntu Mono" "FiraGO"))
	  ("presentation" . (19 "Iosevka SS08" "Source Sans Pro")))
    "Alist of desired point sizes and their typefaces.
Each association consists of a display type mapped to a point
size, followed by monospaced and proportionately-spaced font
names.

The monospaced typeface is meant to be applied to the `default'
and `fixed-pitch' faces.  The proportionately-space font is
intended for the `variable-pitch' face.")

  (defun prot/font-set-face-attribute (face family size &optional params)
    "Set FACE font to FAMILY at SIZE with optional PARAMS."
    (let ((params (if params
			          params
		            prot/font-fontconfig-params)))
	  (set-face-attribute
	   `,face nil :font
	   (format "%s-%s:%s" family (number-to-string size) params))))

  (defun prot/font-set-fonts (&optional points font-mono font-var)
    "Set default font size using presets.

POINTS is the font's point size, represented as either '10' or
'10.5'.  FONT-MONO should be a monospaced typeface, due to the
alignment requirements of the `fixed-pitch' face.  FONT-VAR could
be a proportionately-spaced typeface or even a monospaced one,
since the `variable-pitch' it applies to is not supposed to be
spacing-sensitive.  Both families must be represented as a string
holding the family's name."
    (interactive)
    (let* ((data prot/font-sizes-families-alist)
	       (displays (mapcar #'car data))
	       (choice (if points
                       points
		             (completing-read "Pick display size: " displays nil t)))
	       (size (if points
		             points
		           (nth 1 (assoc `,choice data))))
	       (mono (if font-mono
		             font-mono
		           (if (member choice displays)
                       (nth 2 (assoc `,choice data))
                     nil)))
	       (var (if font-var
		            font-var
                  (if (member choice displays)
                      (nth 3 (assoc `,choice data))
                    nil))))
	  (when window-system
        (dolist (face '(default fixed-pitch))
	      (prot/font-set-face-attribute `,face mono size))
	    ;; Increasing the size on this to account for the innate
	    ;; difference between the families I use.  Maybe there is some
	    ;; more flexible way to create visual harmony between typefaces
	    ;; with distinct inherent heights, without trying to query for
	    ;; the current family in use.
        ;;
        ;; TODO normalise font heights automatically?
	    (prot/font-set-face-attribute 'variable-pitch var (+ size 1))))
	(run-hooks 'prot/font-switch-fonts-hook))

  (defvar prot/font-monospaced-fonts-list
    '("Hack" "Iosevka SS08" "Iosevka Slab" "Source Code Pro"
      "Ubuntu Mono" "Fantasque Sans Mono" "DejaVu Sans Mono"
      "Fira Code" "Victor Mono" "Roboto Mono")
    "List of typefaces for coding.
See `prot/font-set-font-size-family' for how this is used.")

  (defun prot/font-set-font-size-family ()
    "Set point size and main typeface."
    (interactive)
    (let* ((fonts prot/font-monospaced-fonts-list)
           (font (completing-read "Select main font: " fonts nil t))
           (nums (list 13 14 15 16))
           (sizes (mapcar 'number-to-string nums))
           (size (completing-read "Select or insert number: " sizes nil)))
      (prot/font-set-fonts (string-to-number size) font)))

  (defun prot/font-fonts-dwim (&optional arg)
    "Set fonts interactively.
This is just a wrapper around `prot/font-set-fonts' and
`prot/font-set-font-size-family', whose sole purpose is to
economise on dedicated key bindings."
    (interactive "P")
    (if arg
        (prot/font-set-font-size-family)
      (prot/font-set-fonts)))

  (defvar prot/font-fonts-line-spacing-list
    '("Source Code Pro" "Ubuntu Mono")
    "Font families in need of extra `line-spacing'.
See `prot/font-line-spacing' for how this is used.")

  (defun prot/font-line-spacing ()
	"Determine desirable `line-spacing', based on font family.
Add this to `prot/font-switch-fonts-hook'."
	(let ((fonts prot/font-fonts-line-spacing-list))
	  (if (member (face-attribute 'default :family) fonts)
	      (setq-default line-spacing 1)
	    (setq-default line-spacing nil))))

  (defun prot/font-fonts-per-monitor ()
	"Use font settings based on screen size.
Meant to be used at some early initialisation stage, such as with
`after-init-hook'."
	(let* ((display (if (<= (display-pixel-width) 1366)
			            "laptop"
		              "desktop"))
	       (data prot/font-sizqes-families-alist)
           (size (cadr (assoc `,display data)))
	       (mono (nth 2 (assoc `,display data)))
	       (var (nth 3 (assoc `,display data))))
	  (prot/font-set-fonts size mono var)))

  :hook ((after-init-hook . prot/font-fonts-per-monitor)
	     (prot/font-switch-fonts-hook . prot/font-line-spacing))
  ;; Awkward key because I do not need it very often.  Maybe once a day.
  ;; The "C-c f" is used elsewhere.
  :bind ("C-c F" . prot/font-fonts-dwim))
