emacs.d/personal/custom/config.org
*** Mode for proportional fonts
    :PROPERTIES:
    :CUSTOM_ID: h:414b33cd-66f7-4daf-814f-373e08dff7f8
    :ID:       1ca5e932-338c-48c3-b33d-7b4c3a66dcd4
    :END:

When Emacs operates in a graphical terminal, it can display text using
mixed font settings: a variety of heights and families (in addition to
other typegraphic attributes).  This means that it can draw text on the
same line that has potentially profoundly different properties
character-by-character.  For example, a sans-serif typeface for prose
with a monospaced font for inline code (for the underlying faces that
may be used, see [[#h:e03b6415-a18f-4058-b9b0-5721d38c6c50][Primary and complementary font settings]]).

While we can handle things on our own by calling =set-face-attribute= for
each face we are interested in, there is a built-in mechanism to quickly
toggle the use of proportionately-spaced fonts (in contrast to the
monospaced ones which usually are the standard).  Depending on your
theme this will not yield good results in Org mode, so be warned.

For what it's worth, my Modus themes are designed to take full advantage
of this facility (see [[#h:b7444e76-75d4-4ae6-a9d6-96ff9408efe6][Modus themes and other visuals]]).  Any face that is
sensitive to spacing or that would break the layout if displayed in a
variable width is designed to explicitly inherit from the =fixed-pitch=
face (the exact font family was specified in the previous section,
though the only thing that matters is to be monospaced).

With the following package declaration my idea is to integrate
=prot/variable-pitch-mode= into some "reading mode" configurations that I
have, /mutatis mutandis/.  Likely candidates are the toggle for
=olivetti-mode= (see the section on [[#h:7591160f-052a-4d24-8a12-0f7f2e1d5ecd][“Focus mode” for writing]]) and my
simple-yet-super-effective plain text presentations with Org mode (see
[[#h:5571e3b2-1593-4c9c-82f4-ed5f50f69f11][simple presentations inside of Emacs]]).

Also check my [[#h:cf9086c1-1b33-4127-a716-de94259e14a0][Cursor appearance and tweaks]].

#+begin_src emacs-lisp
(use-package face-remap
  :diminish buffer-face-mode            ; the actual mode
  :commands prot/variable-pitch-mode
  :config
  (define-minor-mode prot/variable-pitch-mode
    "Toggle `variable-pitch-mode', except for `prog-mode'."
    :init-value nil
    :global nil
    (if prot/variable-pitch-mode
        (unless (derived-mode-p 'prog-mode)
          (variable-pitch-mode 1))
      (variable-pitch-mode -1))))
#+end_src

*** Typeface suitability test
   :PROPERTIES:
   :CUSTOM_ID: h:9035a1ed-e988-4731-89a5-0d9e302c3dea
   :ID:       a0ff1d75-89cc-4b16-92fd-d661d853765c
   :END:

Here is a simple test I have come up with to make an initial assessment
of the overall quality of the font: /can you discern the character at a
quick glance?/ If yes, your choice of typeface is good /prima facie/, else
search for something else.

Note that this test is not perfect, since many typefaces fall short in
less obvious ways, such as the space between the characters.  Also note
that the website version of this document may not accurately represent
the typeface I am using.

#+begin_example
()[]{}<>«»‹›
6bB8&0ODdo
1tiIlL|
!ij
5$Ss
7Zz
gqp
nmMN
uvvwWuuw
x×X
.,·°;:¡!¿?
:;
`'
‘’
''"
'
"
“”
—-~≈=_.…

Sample character set
Check for monospacing and Greek glyphs

ABCDEFGHIJKLMNOPQRSTUVWXYZ
abcdefghijklmnopqrstuvwxyz
1234567890#%^*
ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ
αβγδεζηθικλμνξοπρστυφχψω
#+end_example

** modus fonts
   :PROPERTIES:
   :ID:       0f657811-8f99-4878-99e8-d6e26b68f284
   :END:
#+BEGIN_SRC emacs-lisp
  (setq modus-vivendi-theme-proportional-fonts t)
  (setq modus-vivendi-theme-rainbow-headings nil)
  (setq modus-vivendi-theme-scale-headings t)
  (setq modus-vivendi-theme-bold-constructs t)
  (setq modus-vivendi-theme-visible-fringes t)
  (setq modus-vivendi-theme-intense-paren-match nil)
  (setq modus-vivendi-theme-variable-pitch-headings t)
  (set-face-attribute 'default nil :font "Ubuntu Mono-12")
  (set-face-attribute 'fixed-pitch nil :family "Ubuntu Mono" :height 1.0)
  (set-face-attribute 'variable-pitch nil :family "FiraGO" :height 1.0)

  ;; (dolist (face '(default fixed-pitch))
  ;;   (set-face-attribute `,face nil :font "Ubuntu Mono-12"))

  ;; (variable-pitch-mode)
#+END_SRC
** unicode-fonts
   :PROPERTIES:
   :ID:       ea735010-ea5f-4582-939f-122777712b9f
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package unicode-fonts
    :straight t
    :config
      (unicode-fonts-setup))
#+END_SRC
** ligature
   :PROPERTIES:
   :ID:       4d1fa287-d5cc-43df-ab24-a5390d0080a7
   :END:
BEGIN_SRC emacs-lisp
  (use-package ligature
    :straight (:host github
               :repo "mickeynp/ligature.el"
               :files ("*.el"))
    :config
      ;; Enable the "www" ligature in every possible major mode
      (ligature-set-ligatures 't '("www"))
      ;; Enable traditional ligature support in eww-mode, if the
      ;; `variable-pitch' face supports it
      (ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
      ;; Enable all Cascadia Code ligatures in programming modes
      (ligature-set-ligatures 'prog-mode '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
                                           ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
                                           "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
                                           "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
                                           "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
                                           "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
                                           "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
                                           "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
                                           ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
                                           "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
                                           "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
                                           "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
                                           "\\" "://"))
      ;; Enables ligature checks globally in all buffers. You can also do it
      ;; per mode with `ligature-mode'.
      (global-ligature-mode t))
END_SRC
* Windows handling
  :PROPERTIES:
  :ID:       20d05e9f-f9a0-44c6-9536-c5d5f4a0c9b4
  :END:
Move between windows with Shift-arrow keys
#+BEGIN_SRC emacs-lisp
(windmove-default-keybindings)
(global-set-key (kbd "<kp-4>") 'windmove-left)
(global-set-key (kbd "<kp-6>") 'windmove-right)
(global-set-key (kbd "<kp-8>") 'windmove-up)
(global-set-key (kbd "<kp-2>") 'windmove-down)
#+END_SRC
** ace-window
   :PROPERTIES:
   :ID:       045a49e9-e596-44b7-a3d2-737cec3d12b0
   :END:
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x o") 'ace-window)
#+END_SRC
** Zygospore
   :PROPERTIES:
   :ID:       af834150-bc97-4e86-a5dd-fc0d7fedf545
   :END:
zygospore lets you revert C-x 1 (delete-other-window) by pressing C-x 1 again
#+BEGIN_SRC emacs-lisp
  (use-package zygospore
    :straight t
    :bind (("C-x 1" . zygospore-toggle-delete-other-windows)))
#+END_SRC
* Smart mode line
  :PROPERTIES:
  :ID:       2c8d6057-fc15-49b3-bba7-f545c14fb182
  :END:
#+BEGIN_SRC emacs-lisp
  ;; (use-package smart-mode-line
  ;;   :ensure t
  ;;   :config
  ;;   (setq sml/theme 'dark)
  ;;   (setq sml/theme 'automatic)
  ;;   (setq sml/shorten-directory t)
  ;;   (setq sml/shorten-modes t)
  ;;   (setq sml/name-width 30)
  ;;   (setq sml/mode-width 'full)
  ;;   (setq rm-blacklist '(" all-the-icons-dired-mode" " Abbrev" " GitGutter" " EditorConfig" " Fly" " MRev" " company" " mate"
  ;;                        " h" " Helm" " ivy" " MPM" " Wrap" " Fill" " AC" " Pre"
  ;;                        " Prjl" " super-save" " Undo-Tree" " VHl" " WK" " WLR" " ws"))
  ;;   (sml/setup)
  ;;   (add-to-list 'sml/replacer-regexp-list '("^~/Dropbox/" ":DB:"))
  ;;   (add-to-list 'sml/replacer-regexp-list
  ;;                '("^~/.*/lib/ruby/gems" ":GEMS" ))
  ;; )
#+END_SRC
* ibuffer
  :PROPERTIES:
  :ID:       2c94ed41-d544-4b2b-91e2-2be028e57e19
  :END:
#+BEGIN_SRC emacs-lisp
(setq ibuffer-saved-filter-groups
      '(("home"
         ("dired" (mode . dired-mode))
         ("org" (name .  ".*org$"))
;;          ("helm" (predicate string-match "Helm" mode-name))
         ("web" (or (mode .  web-mode) (mode .  js2-mode)))
         ("shell" (or (mode . eshell-mode) (mode .  shell-mode)))
         ("programming" (or (mode . python-mode) (mode . c++-mode)))
         ("emacs" (or (name . "^\\*scratch\\*$")
                      (name . "^\\*Bookmark List\\*$")
                      (name . "^\\*Compile-Log\\*$")
                      (name . "^\\*Messages\\*$")))
         ("emacs-config" (or (filename . ".emacs.d")
                             (filename . "emacs-config")))
         ("martinowen.net" (filename . "martinowen.net"))
         ("Org" (or (mode . org-mode)
                    (filename . "OrgMode")))
         ("code" (filename . "code"))
         ("Web Dev" (or (mode . html-mode)
                        (mode . css-mode)))
         ("Subversion" (name . "\*svn"))
         ("Magit" (name . "\*magit"))
         ("ERC" (mode . erc-mode))
         ("Help" (or (name . "\*Help\*")
                     (name . "\*Apropos\*")
                     (name . "\*info\*"))))))
(add-hook 'ibuffer-mode-hook
          '(lambda ()
             (ibuffer-auto-mode 1)
             (ibuffer-switch-to-saved-filter-groups "home")))
(setq ibuffer-expert t)
(setq ibuffer-show-empty-filter-groups nil)
#+END_SRC
* Org mode settings
  :PROPERTIES:
  :ID:       d0a73dd3-6351-442f-a89a-c8a9c4aac836
  :END:
** org-journal
   :PROPERTIES:
   :ID:       e75d562c-fe05-4762-8ab3-9d755008b1dd
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package org-journal
    :bind
    ("C-c n j" . org-journal-new-entry)
    ("C-c n t" . org-journal-today)
    :config
    (setq org-journal-date-prefix "#+TITLE: "
          org-journal-file-format "private-%Y-%m-%d.org"
          org-journal-dir "~/org/roam/"
          org-journal-carryover-items nil
          org-journal-date-format "%Y-%m-%d")
    (defun org-journal-today ()
      (interactive)
      (org-journal-new-entry t)))
#+END_SRC
** Org and org-contrib  package
   :PROPERTIES:
   :ID:       0df07556-c98d-400c-a5ea-69e55854a71e
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package org
    ;;:pin org
    :straight org-plus-contrib
    ;; :ensure org-plus-contrib
    :config
    (setq org-fontify-whole-heading-line t)
    (setq org-use-speed-commands t)
    (setq org-goto-interface 'outline-path-completion)
    (setq org-outline-path-complete-in-steps nil)
  )
#+END_SRC
