prelude/personal/custom/config.el

(use-package face-remap
  :diminish buffer-face-mode            ; the actual mode
  :commands prot/variable-pitch-mode
  :config
  (define-minor-mode prot/variable-pitch-mode
    "Toggle `variable-pitch-mode', except for `prog-mode'."
    :init-value nil
    :global nil
    (if prot/variable-pitch-mode
        (unless (derived-mode-p 'prog-mode)
          (variable-pitch-mode 1))
      (variable-pitch-mode -1))))

(setq modus-vivendi-theme-proportional-fonts t)
(setq modus-vivendi-theme-rainbow-headings nil)
(setq modus-vivendi-theme-scale-headings t)
(setq modus-vivendi-theme-bold-constructs t)
(setq modus-vivendi-theme-visible-fringes t)
(setq modus-vivendi-theme-intense-paren-match nil)
(setq modus-vivendi-theme-variable-pitch-headings t)
(set-face-attribute 'default nil :font "Ubuntu Mono-12")
(set-face-attribute 'fixed-pitch nil :family "Ubuntu Mono" :height 1.0)
(set-face-attribute 'variable-pitch nil :family "FiraGO" :height 1.0)

;; (dolist (face '(default fixed-pitch))
;;   (set-face-attribute `,face nil :font "Ubuntu Mono-12"))

;; (variable-pitch-mode)

(use-package unicode-fonts
  :straight t
  :config
    (unicode-fonts-setup))

(windmove-default-keybindings)
(global-set-key (kbd "<kp-4>") 'windmove-left)
(global-set-key (kbd "<kp-6>") 'windmove-right)
(global-set-key (kbd "<kp-8>") 'windmove-up)
(global-set-key (kbd "<kp-2>") 'windmove-down)

(global-set-key (kbd "C-x o") 'ace-window)

(use-package zygospore
  :straight t
  :bind (("C-x 1" . zygospore-toggle-delete-other-windows)))

;; (use-package smart-mode-line
;;   :ensure t
;;   :config
;;   (setq sml/theme 'dark)
;;   (setq sml/theme 'automatic)
;;   (setq sml/shorten-directory t)
;;   (setq sml/shorten-modes t)
;;   (setq sml/name-width 30)
;;   (setq sml/mode-width 'full)
;;   (setq rm-blacklist '(" all-the-icons-dired-mode" " Abbrev" " GitGutter" " EditorConfig" " Fly" " MRev" " company" " mate"
;;                        " h" " Helm" " ivy" " MPM" " Wrap" " Fill" " AC" " Pre"
;;                        " Prjl" " super-save" " Undo-Tree" " VHl" " WK" " WLR" " ws"))
;;   (sml/setup)
;;   (add-to-list 'sml/replacer-regexp-list '("^~/Dropbox/" ":DB:"))
;;   (add-to-list 'sml/replacer-regexp-list
;;                '("^~/.*/lib/ruby/gems" ":GEMS" ))
;; )

(setq ibuffer-saved-filter-groups
      '(("home"
         ("dired" (mode . dired-mode))
         ("org" (name .  ".*org$"))
;;          ("helm" (predicate string-match "Helm" mode-name))
         ("web" (or (mode .  web-mode) (mode .  js2-mode)))
         ("shell" (or (mode . eshell-mode) (mode .  shell-mode)))
         ("programming" (or (mode . python-mode) (mode . c++-mode)))
         ("emacs" (or (name . "^\\*scratch\\*$")
                      (name . "^\\*Bookmark List\\*$")
                      (name . "^\\*Compile-Log\\*$")
                      (name . "^\\*Messages\\*$")))
         ("emacs-config" (or (filename . ".emacs.d")
                             (filename . "emacs-config")))
         ("martinowen.net" (filename . "martinowen.net"))
         ("Org" (or (mode . org-mode)
                    (filename . "OrgMode")))
         ("code" (filename . "code"))
         ("Web Dev" (or (mode . html-mode)
                        (mode . css-mode)))
         ("Subversion" (name . "\*svn"))
         ("Magit" (name . "\*magit"))
         ("ERC" (mode . erc-mode))
         ("Help" (or (name . "\*Help\*")
                     (name . "\*Apropos\*")
                     (name . "\*info\*"))))))
(add-hook 'ibuffer-mode-hook
          '(lambda ()
             (ibuffer-auto-mode 1)
             (ibuffer-switch-to-saved-filter-groups "home")))
(setq ibuffer-expert t)
(setq ibuffer-show-empty-filter-groups nil)

(use-package org-journal
  :bind
  ("C-c n j" . org-journal-new-entry)
  ("C-c n t" . org-journal-today)
  :config
  (setq org-journal-date-prefix "#+TITLE: "
        org-journal-file-format "private-%Y-%m-%d.org"
        org-journal-dir "~/org/roam/"
        org-journal-carryover-items nil
        org-journal-date-format "%Y-%m-%d")
  (defun org-journal-today ()
    (interactive)
    (org-journal-new-entry t)))

(use-package org
  ;;:pin org
  :straight org-plus-contrib
  ;; :ensure org-plus-contrib
  :config
  (setq org-fontify-whole-heading-line t)
  (setq org-use-speed-commands t)
  (setq org-goto-interface 'outline-path-completion)
  (setq org-outline-path-complete-in-steps nil)
)
