emacs.d/personal/custom/config.org
** Agenda
   :PROPERTIES:
   :ID:       a70fb224-c99c-4ca9-ab23-9697d09a5a61
   :END:
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-files (directory-files "~/org-files" 'absolute "[^#]*.org$" 'no-sort))
  (setq jethro/org-agenda-directory "~/org-files/")

  (use-package org-agenda
    :straight nil
    :init
    (setq org-agenda-block-separator nil
          org-agenda-start-with-log-mode t)
    (defun jethro/switch-to-agenda ()
      (interactive)
      (org-agenda nil " "))
    :bind (:map org-agenda-mode-map
                ("i" . org-agenda-clock-in)
                ("r" . jethro/org-process-inbox)
                ("R" . org-agenda-refile)
                ("c" . jethro/org-inbox-capture))
    :config
    (setq org-columns-default-format "%40ITEM(Task) %Effort(EE){:} %CLOCKSUM(Time Spent) %SCHEDULED(Scheduled) %DEADLINE(Deadline)")
    (setq org-agenda-custom-commands `((" " "Agenda"
                                        ((agenda ""
                                                 ((org-agenda-span 'week)
                                                  (org-deadline-warning-days 365)))
                                         (todo "TODO"
                                               ((org-agenda-overriding-header "To Refile")
                                                (org-agenda-files '(,(concat jethro/org-agenda-directory "inbox.org")))))
                                         (todo "TODO"
                                               ((org-agenda-overriding-header "Emails")
                                                (org-agenda-files '(,(concat jethro/org-agenda-directory "emails.org")))))
                                         (todo "NEXT"
                                               ((org-agenda-overriding-header "In Progress")
                                                (org-agenda-files '(,(concat jethro/org-agenda-directory "someday.org")
                                                                    ,(concat jethro/org-agenda-directory "projects.org")
                                                                    ,(concat jethro/org-agenda-directory "next.org")))
                                                ))
                                         (todo "TODO"
                                               ((org-agenda-overriding-header "Projects")
                                                (org-agenda-files '(,(concat jethro/org-agenda-directory "projects.org")))
                                                ))
                                         (todo "TODO"
                                               ((org-agenda-overriding-header "One-off Tasks")
                                                (org-agenda-files '(,(concat jethro/org-agenda-directory "next.org")))
                                                (org-agenda-skip-function '(org-agenda-skip-entry-if 'deadline 'scheduled)))))))))

  (defun jethro/org-archive-done-tasks ()
    "Archive all done tasks."
    (interactive)
    (org-map-entries 'org-archive-subtree "/DONE" 'file))

  (require 'org-protocol)
  (require 'org-capture)

  (setq org-capture-templates
          `(("i" "inbox" entry (file ,(concat jethro/org-agenda-directory "inbox.org"))
             "* TODO %?")
            ("e" "email" entry (file+headline ,(concat jethro/org-agenda-directory "emails.org") "Emails")
                 "* TODO [#A] Reply: %a :@home:@school:"
                 :immediate-finish t)
            ("c" "org-protocol-capture" entry (file ,(concat jethro/org-agenda-directory "inbox.org"))
                 "* TODO [[%:link][%:description]]\n\n %i"
                 :immediate-finish t)
            ("w" "Weekly Review" entry (file+olp+datetree ,(concat jethro/org-agenda-directory "reviews.org"))
             (file ,(concat jethro/org-agenda-directory "templates/weekly_review.org")))
            ("r" "Reading" todo ""
                 ((org-agenda-files '(,(concat jethro/org-agenda-directory "reading.org")))))))

  (setq org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)")
          (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)")))

  (setq org-log-done 'time
        org-log-into-drawer t
        org-log-state-notes-insert-after-drawers nil)

  (setq org-tag-alist (quote (("@errand" . ?e)
                              ("@office" . ?o)
                              ("@home" . ?h)
                              ("@school" . ?s)
                              (:newline)
                              ("WAITING" . ?w)
                              ("HOLD" . ?H)
                              ("CANCELLED" . ?c))))

  (setq org-fast-tag-selection-single-key nil)
  (setq org-refile-use-outline-path 'file
        org-outline-path-complete-in-steps nil)
  (setq org-refile-allow-creating-parent-nodes 'confirm)
  (setq org-refile-targets '(("next.org" :level . 0)
                             ("someday.org" :level . 0)
                             ("reading.org" :level . 1)
                             ("projects.org" :maxlevel . 1)))

  (defvar jethro/org-agenda-bulk-process-key ?f
    "Default key for bulk processing inbox items.")

  (defun jethro/org-process-inbox ()
    "Called in org-agenda-mode, processes all inbox items."
    (interactive)
    (org-agenda-bulk-mark-regexp "inbox:")
    (jethro/bulk-process-entries))

  (defvar jethro/org-current-effort "1:00"
    "Current effort for agenda items.")

  (defun jethro/my-org-agenda-set-effort (effort)
    "Set the EFFORT property for the current headline."
    (interactive
     (list (read-string (format "Effort [%s]: " jethro/org-current-effort) nil nil jethro/org-current-effort)))
    (setq jethro/org-current-effort effort)
    (org-agenda-check-no-diary)
    (let* ((hdmarker (or (org-get-at-bol 'org-hd-marker)
                         (org-agenda-error)))
           (buffer (marker-buffer hdmarker))
           (pos (marker-position hdmarker))
           (inhibit-read-only t)
           newhead)
      (org-with-remote-undo buffer
        (with-current-buffer buffer
          (widen)
          (goto-char pos)
          (org-show-context 'agenda)
          (funcall-interactively 'org-set-effort nil jethro/org-current-effort)
          (end-of-line 1)
          (setq newhead (org-get-heading)))
        (org-agenda-change-all-lines newhead hdmarker))))

  (defun jethro/org-agenda-process-inbox-item ()
    "Process a single item in the 'org-agenda'."
    (org-with-wide-buffer
     (org-agenda-set-tags)
     (org-agenda-priority)
     (call-interactively 'jethro/my-org-agenda-set-effort)
     (org-agenda-refile nil nil t)))

  (defun jethro/bulk-process-entries ()
    (if (not (null org-agenda-bulk-marked-entries))
        (let ((entries (reverse org-agenda-bulk-marked-entries))
              (processed 0)
              (skipped 0))
          (dolist (e entries)
            (let ((pos (text-property-any (point-min) (point-max) 'org-hd-marker e)))
              (if (not pos)
                  (progn (message "Skipping removed entry at %s" e)
                         (cl-incf skipped))
                (goto-char pos)
                (let (org-loop-over-headlines-in-active-region) (funcall 'jethro/org-agenda-process-inbox-item))
                ;; `post-command-hook' is not run yet.  We make sure any
                ;; pending log note is processed.
                (when (or (memq 'org-add-log-note (default-value 'post-command-hook))
                          (memq 'org-add-log-note post-command-hook))
                  (org-add-log-note))
                (cl-incf processed))))
          (org-agenda-redo)
          (unless org-agenda-persistent-marks (org-agenda-bulk-unmark-all))
          (message "Acted on %d entries%s%s"
                   processed
                   (if (= skipped 0)
                       ""
                     (format ", skipped %d (disappeared before their turn)"
                             skipped))
                   (if (not org-agenda-persistent-marks) "" " (kept marked)")))))

  (defun jethro/org-inbox-capture ()
    "Capture a task in agenda mode."
    (interactive)
    (org-capture nil "i"))

  (setq org-agenda-bulk-custom-functions `((,jethro/org-agenda-bulk-process-key jethro/org-agenda-process-inbox-item)))

  (defun jethro/set-todo-state-next ()
    "Visit each parent task and change NEXT states to TODO."
    (org-todo "NEXT"))

  (add-hook 'org-clock-in-hook 'jethro/set-todo-state-next 'append)

  (use-package org-clock-convenience
    :straight t
    :bind (:map org-agenda-mode-map
                ("<S-up>" . org-clock-convenience-timestamp-up)
                ("<S-down>" . org-clock-convenience-timestamp-down)
                ("o" . org-clock-convenience-fill-gap)
                ("e" . org-clock-convenience-fill-gap-both)))
#+END_SRC
