emacs.d/personal/custom/config.org
** Writeroom
   :PROPERTIES:
   :ID:       fcf4e447-1fdc-4d26-8fab-3cf7e245d071
   :END:
#+BEGIN_SRC emacs-lisp
  ;; (add-hook 'org-mode-hook #'writeroom-mode)
  ;; (add-hook 'writeroom-mode-hook #'+word-wrap-mode)
  ;; (add-hook 'writeroom-mode-hook #'+org-pretty-mode)
#+END_SRC
** Which buffer types get org mode
   :PROPERTIES:
   :ID:       40e097e3-210f-4dfe-be2a-1dfd7702434e
   :END:
#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.\\(org_archive\\|txt\\)$" . org-mode))
#+END_SRC
** Create and handle PROPERTIES
   :PROPERTIES:
   :ID:       67f30b3c-1f3e-4e48-a670-5cc0c2fb3ba2
   :END:
The purpose of this code is that it creates ID properties for every
headline (if there isn’t one already) when you save your OrgMode file.
#+BEGIN_SRC emacs-lisp
  (defun my/org-add-ids-to-headlines-in-file ()
    "Add ID properties to all headlines in the current file which
  do not already have one."
    (interactive)
    (org-map-entries 'org-id-get-create))

  (add-hook 'org-mode-hook
            (lambda ()
              (add-hook 'before-save-hook
                        'my/org-add-ids-to-headlines-in-file nil 'local)))
#+END_SRC

This function is bound to C-x l u. Whenever you press C-x l u then it
takes the ID and copies it to the killring (aka Clipboard). If the
headline has no ID property it creates one. In that way, you can
easily create links to IDs because copying the ID is just one
keystroke.
#+BEGIN_SRC emacs-lisp
(defun my/copy-id-to-clipboard() "Copy the ID property value to killring,
if no ID is there then create a new unique ID.
This function works only in org-mode buffers.

The purpose of this function is to easily construct id:-links to
org-mode items. If its assigned to a key it saves you marking the
text and copying to the killring."
  (interactive)
  (when (eq major-mode 'org-mode) ; do this only in org-mode buffers
    (setq mytmpid (funcall 'org-id-get-create))
  (kill-new mytmpid)
  (message "Copied %s to killring (clipboard)" mytmpid)
))

;; (global-set-key (kbd "<f5>") 'my/copy-id-to-clipboard)
#+END_SRC

** Handling of M-return
   :PROPERTIES:
   :ID:       f20285cb-5b49-4bb4-8f86-173e8d786212
   :END:
Do not split the line on M-return
#+BEGIN_SRC emacs-lisp
(setq org-M-RET-may-split-line '((item . nil)))
#+END_SRC
** org-pdfview
   :PROPERTIES:
   :ID:       2f9493b6-b635-418f-a91e-7878b99108ba
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package org-pdfview
    :straight t
  )
  (eval-after-load "org"
    '(progn
       ;; (delete '("\\.pdf\\'" . default) org-file-apps)
       (add-to-list 'org-file-apps '("\\.pdf\\'" . (lambda (file link) (org-pdfview-open link))))
  ))
#+END_SRC
** Babel
   :PROPERTIES:
   :ID:       ece30d8d-3bb3-4bcf-b7c1-dad26c2e0315
   :END:
#+BEGIN_SRC emacs-lisp
  (setq org-confirm-babel-evaluate nil)

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (shell . t)  ; in my case /bin/bash
     (scheme . t)
     (python . t)
     (hledger . t)
     (ledger . t)
     (sed . t)
     (awk . t)
     (clojure . t)))
#+END_SRC
** org-download
   :PROPERTIES:
   :ID:       67654099-a5ae-4631-ae43-faca488de787
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package org-download
    :straight t
    :after org
    :bind
    (:map org-mode-map
          (("s-Y" . org-download-screenshot)
           ("s-y" . org-download-yank))))

  (use-package image+)
  (eval-after-load 'image '(require 'image+))

  (eval-after-load 'image+
    `(when (require 'hydra nil t)
       (defhydra imagex-sticky-binding (global-map "C-x C-l")
         "Manipulating Image"
         ("+" imagex-sticky-zoom-in "zoom in")
         ("-" imagex-sticky-zoom-out "zoom out")
         ("M" imagex-sticky-maximize "maximize")
         ("O" imagex-sticky-restore-original "restore original")
         ("S" imagex-sticky-save-image "save file")
         ("r" imagex-sticky-rotate-right "rotate right")
         ("l" imagex-sticky-rotate-left "rotate left"))))
#+END_SRC
** ox-gfm
   :PROPERTIES:
   :ID:       18ee18ba-8174-4117-ac3a-37853767b095
   :END:
#+BEGIN_SRC emacs-lisp
(eval-after-load "org"
  '(require 'ox-gfm nil t))
#+END_SRC
** org-pandoc-import
   :PROPERTIES:
   :ID:       e7d8f98d-dbf5-445a-b9c6-d513a5bcffbc
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package org-pandoc-import
    :straight (:host github
               :repo "tecosaur/org-pandoc-import"
               :files ("*.el" "filters" "preprocessors")))
#+END_SRC
** org-make-toc
   :PROPERTIES:
   :ID:       41a25014-1aae-48fd-a7e2-820b1492289e
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package org-make-toc
    :straight t
  )
#+END_SRC
* Python
  :PROPERTIES:
  :ID:       d68a1f12-8fa3-4ce5-ac9e-27daa844f6c9
  :END:
#+BEGIN_SRC emacs-lisp
  (setq python-shell-interpreter "python3")
  (with-eval-after-load 'python
    (defun python-shell-completion-native-try ()
      "Return non-nil if can trigger native completion."
      (let ((python-shell-completion-native-enable t)
            (python-shell-completion-native-output-timeout
             python-shell-completion-native-try-output-timeout))
        (python-shell-completion-native-get-completions
         (get-buffer-process (current-buffer))
         nil "_"))))
#+END_SRC
* Smartparens
  :PROPERTIES:
  :ID:       31688683-ea67-43b5-8482-415d483242a9
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package smartparens
    :straight t
    :config
    ;; Haskell
    (sp-with-modes '(
                     haskell-mode
                     inferior-haskell-mode
                     erlang-mode
                     )
      ;; math modes, yay.  The :actions are provided automatically if
      ;; these pairs do not have global definition.
      (sp-local-pair "`" "`"))
    (add-hook 'inferior-haskell-mode-hook (lambda () (smartparens-mode 1)))
    (add-hook 'haskell-interactive-mode-hook (lambda () (smartparens-mode 1)))
    (add-hook 'erlang-mode-hook (lambda () (smartparens-mode 1)))
    (add-hook 'erlang-shell-mode-hook (lambda () (smartparens-mode 1)))
  )
#+END_SRC
* Thingatpt-plus
  :PROPERTIES:
  :ID:       20fc9f56-bfa6-4515-b2e4-0142c61ec809
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package thingatpt+
    :straight (:host github
               :repo "emacsmirror/thingatpt-plus"))
#+END_SRC
* Hide-comnt
  :PROPERTIES:
  :ID:       9b5181b0-a669-4870-bd31-072bf9356901
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package hide-comnt
    :straight (:host github
               :repo "emacsmirror/hide-comnt"))
#+END_SRC
* Thing-cmds
  :PROPERTIES:
  :ID:       e0ecc0ff-e430-42a1-8e94-291562abc8f5
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package thing-cmds
    :straight (:host github
               :repo "emacsmirror/thing-cmds"))
#+END_SRC
* Hexrgb
  :PROPERTIES:
  :ID:       1943f4bc-e349-4d1f-bd05-7ad3e0f6cf04
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package hexrgb
    :straight (:host github
               :repo "emacsmirror/hexrgb"))
#+END_SRC
* Palette
  :PROPERTIES:
  :ID:       ef30a72a-f41b-48d4-ad95-d7b49a34e885
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package palette
    :straight (:host github
               :repo "emacsmirror/palette"))
#+END_SRC
* Facemenu-plus
  :PROPERTIES:
  :ID:       dcd1720f-8c6f-40a7-8415-ce7545842f7d
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package facemenu+
    :straight (:host github
               :repo "emacsmirror/facemenu-plus"))
#+END_SRC
* Highlight
  :PROPERTIES:
  :ID:       eef37e1a-eedd-40e2-ab1c-5285217d6ff7
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package highlight
    :straight (:host github
               :repo "emacsmirror/highlight"))
#+END_SRC
* Mouse3
  :PROPERTIES:
  :ID:       c891af77-70f2-4045-af42-5ec044ff903e
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package mouse3
    :straight (:host github
               :repo "emacsmirror/mouse3"))
#+END_SRC
* Dired
  :PROPERTIES:
  :ID:       2a578a6a-5073-4c00-accb-3504c9181df6
  :END:
** Settings
   :PROPERTIES:
   :ID:       c55a54cd-a23b-4ad9-a8ff-ecfe09bdf7f2
   :END:
#+BEGIN_SRC emacs-lisp
(setq dired-listing-switches "-laGh1v --group-directories-first")
(setq dired-recursive-copies 'always)
(setq dired-recursive-deletes 'always)
(setq dired-clean-up-buffers-too nil)
(setq dired-dwim-target t)
(defconst my-dired-media-files-extensions
 '("mp3" "mp4" "MP3" "MP4" "avi" "mpg" "flv" "ogg" "wmv" "mkv" "mov" "wma")
  "Media file extensions that should launch in VLC.
Also used for highlighting.")
#+END_SRC
** all-the-icons-dired
   :PROPERTIES:
   :ID:       b91cecc6-98f7-4ee9-a381-1bc9a8f5b2ff
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package all-the-icons-dired)
#+END_SRC
** wdired workaround
   :PROPERTIES:
   :ID:       e271589d-d37c-4609-87e6-64bee7231270
   :END:
#+BEGIN_SRC emacs-lisp
(defvar-local +wdired-icons-enabled nil)
(defun +wdired-before-start-advice ()
  "Execute when switching from `dired' to `wdired'."
  (setq +wdired-icons-enabled (if (bound-and-true-p all-the-icons-dired-mode)
                                  1 0))
  (when (bound-and-true-p all-the-icons-dired-mode)
    (all-the-icons-dired-mode 0)))
(defun +wdired-after-finish-advice ()
  "Execute when switching from `wdired' to `dired'"
  (when (boundp 'all-the-icons-dired-mode)
    (all-the-icons-dired-mode +wdired-icons-enabled)))
(advice-add 'wdired-change-to-wdired-mode :before #'+wdired-before-start-advice)
(advice-add 'wdired-change-to-dired-mode :after #'+wdired-after-finish-advice)
#+END_SRC
