prelude/personal/custom/config.el

;; (add-hook 'org-mode-hook #'writeroom-mode)
;; (add-hook 'writeroom-mode-hook #'+word-wrap-mode)
;; (add-hook 'writeroom-mode-hook #'+org-pretty-mode)

(add-to-list 'auto-mode-alist '("\\.\\(org_archive\\|txt\\)$" . org-mode))

(defun my/org-add-ids-to-headlines-in-file ()
  "Add ID properties to all headlines in the current file which
do not already have one."
  (interactive)
  (org-map-entries 'org-id-get-create))

(add-hook 'org-mode-hook
          (lambda ()
            (add-hook 'before-save-hook
                      'my/org-add-ids-to-headlines-in-file nil 'local)))

(defun my/copy-id-to-clipboard() "Copy the ID property value to killring,
if no ID is there then create a new unique ID.
This function works only in org-mode buffers.

The purpose of this function is to easily construct id:-links to
org-mode items. If its assigned to a key it saves you marking the
text and copying to the killring."
  (interactive)
  (when (eq major-mode 'org-mode) ; do this only in org-mode buffers
    (setq mytmpid (funcall 'org-id-get-create))
  (kill-new mytmpid)
  (message "Copied %s to killring (clipboard)" mytmpid)
))

;; (global-set-key (kbd "<f5>") 'my/copy-id-to-clipboard)

(setq org-M-RET-may-split-line '((item . nil)))

(use-package org-pdfview
  :straight t
)
(eval-after-load "org"
  '(progn
     ;; (delete '("\\.pdf\\'" . default) org-file-apps)
     (add-to-list 'org-file-apps '("\\.pdf\\'" . (lambda (file link) (org-pdfview-open link))))
))

(setq org-confirm-babel-evaluate nil)

(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (shell . t)  ; in my case /bin/bash
   (scheme . t)
   (python . t)
   (hledger . t)
   (ledger . t)
   (sed . t)
   (awk . t)
   (clojure . t)))

(use-package org-download
  :straight t
  :after org
  :bind
  (:map org-mode-map
        (("s-Y" . org-download-screenshot)
         ("s-y" . org-download-yank))))

(use-package image+)
(eval-after-load 'image '(require 'image+))

(eval-after-load 'image+
  `(when (require 'hydra nil t)
     (defhydra imagex-sticky-binding (global-map "C-x C-l")
       "Manipulating Image"
       ("+" imagex-sticky-zoom-in "zoom in")
       ("-" imagex-sticky-zoom-out "zoom out")
       ("M" imagex-sticky-maximize "maximize")
       ("O" imagex-sticky-restore-original "restore original")
       ("S" imagex-sticky-save-image "save file")
       ("r" imagex-sticky-rotate-right "rotate right")
       ("l" imagex-sticky-rotate-left "rotate left"))))

(eval-after-load "org"
  '(require 'ox-gfm nil t))

(use-package org-pandoc-import
  :straight (:host github
             :repo "tecosaur/org-pandoc-import"
             :files ("*.el" "filters" "preprocessors")))

(use-package org-make-toc
  :straight t
)

(setq python-shell-interpreter "python3")
(with-eval-after-load 'python
  (defun python-shell-completion-native-try ()
    "Return non-nil if can trigger native completion."
    (let ((python-shell-completion-native-enable t)
          (python-shell-completion-native-output-timeout
           python-shell-completion-native-try-output-timeout))
      (python-shell-completion-native-get-completions
       (get-buffer-process (current-buffer))
       nil "_"))))

(use-package smartparens
  :straight t
  :config
  ;; Haskell
  (sp-with-modes '(
                   haskell-mode
                   inferior-haskell-mode
                   erlang-mode
                   )
    ;; math modes, yay.  The :actions are provided automatically if
    ;; these pairs do not have global definition.
    (sp-local-pair "`" "`"))
  (add-hook 'inferior-haskell-mode-hook (lambda () (smartparens-mode 1)))
  (add-hook 'haskell-interactive-mode-hook (lambda () (smartparens-mode 1)))
  (add-hook 'erlang-mode-hook (lambda () (smartparens-mode 1)))
  (add-hook 'erlang-shell-mode-hook (lambda () (smartparens-mode 1)))
)

(use-package thingatpt+
  :straight (:host github
             :repo "emacsmirror/thingatpt-plus"))

(use-package hide-comnt
  :straight (:host github
             :repo "emacsmirror/hide-comnt"))

(use-package thing-cmds
  :straight (:host github
             :repo "emacsmirror/thing-cmds"))

(use-package hexrgb
  :straight (:host github
             :repo "emacsmirror/hexrgb"))

(use-package palette
  :straight (:host github
             :repo "emacsmirror/palette"))

(use-package facemenu+
  :straight (:host github
             :repo "emacsmirror/facemenu-plus"))

(use-package highlight
  :straight (:host github
             :repo "emacsmirror/highlight"))

(use-package mouse3
  :straight (:host github
             :repo "emacsmirror/mouse3"))

(setq dired-listing-switches "-laGh1v --group-directories-first")
(setq dired-recursive-copies 'always)
(setq dired-recursive-deletes 'always)
(setq dired-clean-up-buffers-too nil)
(setq dired-dwim-target t)
(defconst my-dired-media-files-extensions
 '("mp3" "mp4" "MP3" "MP4" "avi" "mpg" "flv" "ogg" "wmv" "mkv" "mov" "wma")
  "Media file extensions that should launch in VLC.
Also used for highlighting.")

(use-package all-the-icons-dired)

(defvar-local +wdired-icons-enabled nil)
(defun +wdired-before-start-advice ()
  "Execute when switching from `dired' to `wdired'."
  (setq +wdired-icons-enabled (if (bound-and-true-p all-the-icons-dired-mode)
                                  1 0))
  (when (bound-and-true-p all-the-icons-dired-mode)
    (all-the-icons-dired-mode 0)))
(defun +wdired-after-finish-advice ()
  "Execute when switching from `wdired' to `dired'"
  (when (boundp 'all-the-icons-dired-mode)
    (all-the-icons-dired-mode +wdired-icons-enabled)))
(advice-add 'wdired-change-to-wdired-mode :before #'+wdired-before-start-advice)
(advice-add 'wdired-change-to-dired-mode :after #'+wdired-after-finish-advice)
