emacs.d/personal/custom/config.org
** dired-x
   :PROPERTIES:
   :ID:       a7160b7b-e7fc-49df-b6ac-bfbe57a9ebc3
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package dired-x
    :straight nil
    :config
    (progn
      (defun dired-virtual-revert (&optional _arg _noconfirm)
        "Enable revert for virtual direds."
        (let ((m (dired-file-name-at-point))
              (buffer-modified (buffer-modified-p)))
          (goto-char 1)
          (dired-next-subdir 1)
          (dired-do-redisplay nil t)
          (while (dired-next-subdir 1 t)
            (dired-do-redisplay nil t))
          (when m (dired-goto-file m))
          (set-buffer-modified-p buffer-modified)))

      (defun my-dired-jump ()
        (interactive)
        (if (eq major-mode 'dired-mode)
            (let ((file (dired-utils-get-filename)))
              (dired (f-parent file))
              (dired-utils-goto-line file))
          (dired-jump)))
      (bind-key "C-j" 'my-dired-jump ctl-x-map)

      (add-to-list 'dired-guess-shell-alist-user
                   (list (concat "\\."
                                 (regexp-opt my-dired-media-files-extensions)
                                 "\\'")
                         "vlc"))))
#+END_SRC
** diredfl
   :PROPERTIES:
   :ID:       e93d8f12-0c2c-4e8a-8ff4-c655f2c207ed
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package diredfl
    :straight t)
(add-hook 'dired-mode-hook 'diredfl-mode)
(define-key dired-mode-map "e"
  (lambda () (interactive)
    (eww-open-file (dired-get-file-for-visit))))
#+END_SRC
** Subtree
   :PROPERTIES:
   :ID:       f4bd039f-a0d4-42ab-8f40-9191967d55e4
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package dired-subtree
    :straight t
    :init
    (bind-keys :map dired-mode-map
               :prefix "C-,"
               :prefix-map dired-subtree-map
               :prefix-docstring "Dired subtree map."
      ("C-i" . dired-subtree-insert)
      ("C-/" . dired-subtree-apply-filter)
      ("C-k" . dired-subtree-remove)
      ("C-n" . dired-subtree-next-sibling)
      ("C-p" . dired-subtree-previous-sibling)
      ("C-u" . dired-subtree-up)
      ("C-d" . dired-subtree-down)
      ("C-a" . dired-subtree-beginning)
      ("C-e" . dired-subtree-end)
      ("C-c" . dired-subtree-cycle)
      ("m" . dired-subtree-mark-subtree)
      ("u" . dired-subtree-unmark-subtree)
      ("C-o C-f" . dired-subtree-only-this-file)
      ("C-o C-d" . dired-subtree-only-this-directory)))
#+END_SRC
** Handle compressed files
   :PROPERTIES:
   :ID:       76c20108-fa85-4350-89bf-cc8ad3dceac2
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package dired-avfs
    :straight t
  )
  ;; (eval-after-load "dired-aux"
  ;;   '(add-to-list 'dired-compress-file-suffixes
  ;;                 '("\\.zip\\'" ".zip" "unzip")))
#+END_SRC
** Filter
   :PROPERTIES:
   :ID:       dcd3f49d-d7d5-4fbd-ba45-3b6b960b686a
   :END:
#+BEGIN_SRC emacs-lisp
  (bind-keys :map dired-mode-map
             ("ö" . dired-filter-map)
             ("ä" . dired-filter-mark-map))
  (use-package dired-filter
    :straight t
    :config
    (setq dired-filter-group-saved-groups
       (make-list 1 '("default"
                      ("Epub"
                       (extension . "epub"))
                      ("PDF"
                       (extension . "pdf"))
                      ("LaTeX"
                       (extension "tex" "bib"))
                      ("Org"
                       (extension . "org"))
                      ("Archives"
                       (extension "zip" "rar" "gz" "bz2" "tar")))))
  )

  (use-package dired-launch
    :straight (:host github
               :repo "thomp/dired-launch"))
  (dired-launch-enable)
#+END_SRC
** dired-ranger
   :PROPERTIES:
   :ID:       893b721b-b1be-4ee0-8a1a-5cecf64432c2
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package dired-ranger
    :straight t
    :config
    (setq dired-ranger-bookmark-LRU ?l)
    (bind-keys :map dired-mode-map
               :prefix "c"
               :prefix-map dired-ranger-map
               :prefix-docstring "Map for ranger operations."
      ("c" . dired-ranger-copy)
      ("p" . dired-ranger-paste)
      ("m" . dired-ranger-move))
    :bind (:map dired-mode-map
                ("W" . dired-ranger-copy)
                ("X" . dired-ranger-move)
                ("Y" . dired-ranger-paste)
                ("'" . dired-ranger-bookmark)
                ("l" . dired-ranger-bookmark-visit))
  )
  (use-package ranger
    :straight t
  )
#+END_SRC
** Narrow
   :PROPERTIES:
   :ID:       f52211f3-3436-4f11-a717-b5212fe8af74
   :END:
narrow dired to match filter
#+BEGIN_SRC emacs-lisp
  (use-package dired-narrow
    :straight t
    :commands dired-narrow
    :init
    (bind-key "å" 'dired-narrow dired-mode-map))
#+END_SRC
** Preview
   :PROPERTIES:
   :ID:       62334c89-a0db-415a-860a-5b4036feb775
   :END:
preview files in dired
#+BEGIN_SRC emacs-lisp
  (use-package peep-dired
    :straight t
    :defer t ; don't access `dired-mode-map' until `peep-dired' is loaded
    :bind (:map dired-mode-map
                ("P" . peep-dired)))
#+END_SRC
** Recent dirs
   :PROPERTIES:
   :ID:       e0430226-5f5c-4283-aab1-77870c98bf3d
   :END:
#+BEGIN_SRC emacs-lisp
(defun counsel-goto-recent-directory ()
  "Open recent directory with dired"
  (interactive)
  (unless recentf-mode (recentf-mode 1))
  (let ((collection
         (delete-dups
          (append (mapcar 'file-name-directory recentf-list)
                  ;; fasd history
                  (if (executable-find "fasd")
                      (split-string (shell-command-to-string "fasd -ld") "\n" t))))))
    (ivy-read "directories:" collection :action 'dired)))
#+END_SRC
** Init
   :PROPERTIES:
   :ID:       76e9b90e-d8ea-486c-a7e1-cb03df1d1ab2
   :END:
#+BEGIN_SRC emacs-lisp
(defun my-dired-init ()
  "Bunch of stuff to run for dired, either immediately or when it's loaded."
  (bind-keys :map dired-mode-map
    ;; clean bullshit bindings so C-h e b shows us real info
    ("G") ("Z") ("#") (".")
    ("~") ("e") ("?")

    ("<insert>" . dired-mark)
    ("SPC" . dired-mark)
    ("<delete>" . dired-unmark-backward)
    ("<backspace>" . dired-up-directory))

  (dired-filter-mode t)
  (dired-filter-group-mode t)
  ;; (dired-collapse-mode 1)
  (visual-line-mode -1)
  (toggle-truncate-lines 1))
(add-hook 'dired-mode-hook 'my-dired-init)
(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
#+END_SRC
* Dired plus
  :PROPERTIES:
  :ID:       800c2fda-d51f-4b95-836c-0ef3edfc13db
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package dired+
    :straight (:host github
               :repo "emacsmirror/dired-plus")
    :config
    (setq diredp-image-preview-in-tooltip 300)
  )
#+END_SRC
* Bookmarks
  :PROPERTIES:
  :ID:       c78a6d32-0f0a-4a8c-bd9f-d7c4addc5933
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package bookmark+
    :straight (:host github
               :repo "emacsmirror/bookmark-plus"))
#+END_SRC
* Info plus
  :PROPERTIES:
  :ID:       7eee490b-21e7-4b7d-98d3-904d6542c16f
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package info+
    :straight (:host github
               :repo "emacsmirror/info-plus")
    :config
    (setq Info-breadcrumbs-in-mode-line-mode t)
  )
(eval-after-load "info" '(require 'info+))
#+END_SRC
* Man
  :PROPERTIES:
  :ID:       23a402a0-de53-4bc1-a39c-a41feddcb11a
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package man
    :straight t
    :init (setq Man-notify-method 'aggressive))
#+END_SRC
* neotree
  :PROPERTIES:
  :ID:       7a48a1db-7f10-4a96-9d37-5ba8024612c5
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package neotree
    :straight t
    :bind (("<f8>" . neotree-toggle))
  )
#+END_SRC
* sr-speedbar
  :PROPERTIES:
  :ID:       5360aa5d-3938-415d-a350-588cf61018a2
  :END:
BEGIN_SRC emacs-lisp
(use-package sr-speedbar
  :config
  (setq speedbar-directory-unshown-regexp "^\\(CVS\\|RCS\\|SCCS\\|\\.\\.*$\\)\\'")
)
END_SRC
