prelude/personal/custom/config.el

(use-package dired-x
  :straight nil
  :config
  (progn
    (defun dired-virtual-revert (&optional _arg _noconfirm)
      "Enable revert for virtual direds."
      (let ((m (dired-file-name-at-point))
            (buffer-modified (buffer-modified-p)))
        (goto-char 1)
        (dired-next-subdir 1)
        (dired-do-redisplay nil t)
        (while (dired-next-subdir 1 t)
          (dired-do-redisplay nil t))
        (when m (dired-goto-file m))
        (set-buffer-modified-p buffer-modified)))

    (defun my-dired-jump ()
      (interactive)
      (if (eq major-mode 'dired-mode)
          (let ((file (dired-utils-get-filename)))
            (dired (f-parent file))
            (dired-utils-goto-line file))
        (dired-jump)))
    (bind-key "C-j" 'my-dired-jump ctl-x-map)

    (add-to-list 'dired-guess-shell-alist-user
                 (list (concat "\\."
                               (regexp-opt my-dired-media-files-extensions)
                               "\\'")
                       "vlc"))))

(use-package diredfl
    :straight t)
(add-hook 'dired-mode-hook 'diredfl-mode)
(define-key dired-mode-map "e"
  (lambda () (interactive)
    (eww-open-file (dired-get-file-for-visit))))

(use-package dired-subtree
  :straight t
  :init
  (bind-keys :map dired-mode-map
             :prefix "C-,"
             :prefix-map dired-subtree-map
             :prefix-docstring "Dired subtree map."
    ("C-i" . dired-subtree-insert)
    ("C-/" . dired-subtree-apply-filter)
    ("C-k" . dired-subtree-remove)
    ("C-n" . dired-subtree-next-sibling)
    ("C-p" . dired-subtree-previous-sibling)
    ("C-u" . dired-subtree-up)
    ("C-d" . dired-subtree-down)
    ("C-a" . dired-subtree-beginning)
    ("C-e" . dired-subtree-end)
    ("C-c" . dired-subtree-cycle)
    ("m" . dired-subtree-mark-subtree)
    ("u" . dired-subtree-unmark-subtree)
    ("C-o C-f" . dired-subtree-only-this-file)
    ("C-o C-d" . dired-subtree-only-this-directory)))

(use-package dired-avfs
  :straight t
)
;; (eval-after-load "dired-aux"
;;   '(add-to-list 'dired-compress-file-suffixes
;;                 '("\\.zip\\'" ".zip" "unzip")))

(bind-keys :map dired-mode-map
           ("ö" . dired-filter-map)
           ("ä" . dired-filter-mark-map))
(use-package dired-filter
  :straight t
  :config
  (setq dired-filter-group-saved-groups
     (make-list 1 '("default"
                    ("Epub"
                     (extension . "epub"))
                    ("PDF"
                     (extension . "pdf"))
                    ("LaTeX"
                     (extension "tex" "bib"))
                    ("Org"
                     (extension . "org"))
                    ("Archives"
                     (extension "zip" "rar" "gz" "bz2" "tar")))))
)

(use-package dired-launch
  :straight (:host github
             :repo "thomp/dired-launch"))
(dired-launch-enable)

(use-package dired-ranger
  :straight t
  :config
  (setq dired-ranger-bookmark-LRU ?l)
  (bind-keys :map dired-mode-map
             :prefix "c"
             :prefix-map dired-ranger-map
             :prefix-docstring "Map for ranger operations."
    ("c" . dired-ranger-copy)
    ("p" . dired-ranger-paste)
    ("m" . dired-ranger-move))
  :bind (:map dired-mode-map
              ("W" . dired-ranger-copy)
              ("X" . dired-ranger-move)
              ("Y" . dired-ranger-paste)
              ("'" . dired-ranger-bookmark)
              ("l" . dired-ranger-bookmark-visit))
)
(use-package ranger
  :straight t
)

(use-package dired-narrow
  :straight t
  :commands dired-narrow
  :init
  (bind-key "å" 'dired-narrow dired-mode-map))

(use-package peep-dired
  :straight t
  :defer t ; don't access `dired-mode-map' until `peep-dired' is loaded
  :bind (:map dired-mode-map
              ("P" . peep-dired)))

(defun counsel-goto-recent-directory ()
  "Open recent directory with dired"
  (interactive)
  (unless recentf-mode (recentf-mode 1))
  (let ((collection
         (delete-dups
          (append (mapcar 'file-name-directory recentf-list)
                  ;; fasd history
                  (if (executable-find "fasd")
                      (split-string (shell-command-to-string "fasd -ld") "\n" t))))))
    (ivy-read "directories:" collection :action 'dired)))

(defun my-dired-init ()
  "Bunch of stuff to run for dired, either immediately or when it's loaded."
  (bind-keys :map dired-mode-map
    ;; clean bullshit bindings so C-h e b shows us real info
    ("G") ("Z") ("#") (".")
    ("~") ("e") ("?")

    ("<insert>" . dired-mark)
    ("SPC" . dired-mark)
    ("<delete>" . dired-unmark-backward)
    ("<backspace>" . dired-up-directory))

  (dired-filter-mode t)
  (dired-filter-group-mode t)
  ;; (dired-collapse-mode 1)
  (visual-line-mode -1)
  (toggle-truncate-lines 1))
(add-hook 'dired-mode-hook 'my-dired-init)
(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)

(use-package dired+
  :straight (:host github
             :repo "emacsmirror/dired-plus")
  :config
  (setq diredp-image-preview-in-tooltip 300)
)

(use-package bookmark+
  :straight (:host github
             :repo "emacsmirror/bookmark-plus"))

(use-package info+
    :straight (:host github
               :repo "emacsmirror/info-plus")
    :config
    (setq Info-breadcrumbs-in-mode-line-mode t)
  )
(eval-after-load "info" '(require 'info+))

(use-package man
  :straight t
  :init (setq Man-notify-method 'aggressive))

(use-package neotree
  :straight t
  :bind (("<f8>" . neotree-toggle))
)

(use-package w3m
  :straight t
  :config
