emacs.d/personal/custom/config.org
* w3m
  :PROPERTIES:
  :ID:       37eded66-edb1-4b05-952e-7c3567aee2d5
  :END:
Text based internet browser
#+BEGIN_SRC emacs-lisp
  (use-package w3m
    :straight t
    :config
    (setq w3m-key-binding 'info)
     (define-key w3m-mode-map [up] 'previous-line)
     (define-key w3m-mode-map [down] 'next-line)
     (define-key w3m-mode-map [left] 'backward-char)
     (define-key w3m-mode-map [right] 'forward-char)
    (setq w3m-default-display-inline-images t)
    (setq w3m-make-new-session t)
    (setq w3m-use-cookies t)
    (setq w3m-default-save-directory "~/Downloads/")
    (add-hook 'w3m-display-hook
            (lambda (url)
              (rename-buffer
               (format "*w3m: %s*"
                       (or w3m-current-title w3m-current-url)) t)))
    (defun wicked/w3m-open-current-page-in-chrome ()
      "Open the current URL in Google Chrome."
      (interactive)
      (browse-url-chrome w3m-current-url)) ;; (1)

    (defun wicked/w3m-open-link-or-image-in-chrome ()
      "Open the current link or image in Chrome."
      (interactive)
      (browse-url-chrome (or (w3m-anchor) ;; (2)
                             (w3m-image)))) ;; (3)
    (define-key w3m-mode-map (kbd "f") 'wicked/w3m-open-current-page-in-chrome)
    (define-key w3m-mode-map (kbd "F") 'wicked/w3m-open-link-or-image-in-chrome)
  )
#+END_SRC

w3m-search search engines
#+BEGIN_SRC emacs-lisp
(eval-after-load "w3m-search"
  '(progn
    (add-to-list 'w3m-search-engine-alist
                 '("archwiki"
                   "https://wiki.archlinux.org/index.php?search=%s"
                   nil))
    (add-to-list 'w3m-search-engine-alist
                 '("ask"
                   "https://www.ask.com/web?q=%s"
                   nil))
    (add-to-list 'w3m-search-engine-alist
                 '("bbcnews"
                   "http://search.bbc.co.uk/search?scope=all&tab=ns&q=%s"
                   nil))
    (add-to-list 'w3m-search-engine-alist
                 '("cia"
                   "https://www.cia.gov/search?q=%s&site=CIA&client=CIA&proxystylesheet=CIA&output=xml_no_dtd&myAction=%2Fsearch&submitMethod=get"
                   nil))
    (add-to-list 'w3m-search-engine-alist
                 '("cpan"
                   "https://metacpan.org/search?q=%s"
                   nil))
    (add-to-list 'w3m-search-engine-alist
                 '("debian-wiki"
                   "https://wiki.debian.org/FindPage?action=fullsearch&titlesearch=0&value=%s&submit=Search+Text"
                   nil))
    (add-to-list 'w3m-search-engine-alist
                 '("loc"
                   "http://www.loc.gov/search/?q=%s"
                   nil))
    (add-to-list 'w3m-search-engine-alist
                 '("py2doc"
                   "http://docs.python.org/2/search.html?q=%s"
                   nil))
    (add-to-list 'w3m-search-engine-alist
                 '("py3doc"
                   "http://docs.python.org/3/search.html?q=%s"
                   nil))
    (add-to-list 'w3m-search-engine-alist
                 '("reddit"
                   "http://www.reddit.com/search?q=%s"
                   nil))
   )
)
#+END_SRC

Use ace-link
#+BEGIN_SRC emacs-lisp
  (use-package ace-link
    :straight t
    :config
    (ace-link-setup-default)
  )
#+END_SRC

Follow links in w3m
#+BEGIN_SRC emacs-lisp
  ;; (setq browse-url-browser-function 'eww-browse-url
  ;;       browse-url-new-window-flag t)
  (setq browse-url-mosaic-program nil)
  (setq browse-url-browser-function 'w3m-browse-url
        browse-url-new-window-flag t)
  (autoload 'w3m-browse-url "w3m" "Ask a WWW browser to show a URL." t)
  (define-prefix-command 'web-map)
  (define-key web-map (kbd "w") 'w3m-goto-url)
  (define-key web-map (kbd "l") 'browse-url-at-point)
  (define-key web-map (kbd "g") 'w3m-search)
  (global-set-key (kbd "C-c w") 'web-map)
  ;; (global-set-key (kbd "C-c w w") 'w3m-goto-url)
  ;; (global-set-key (kbd "C-c w l") 'browse-url-at-point)
  ;; (global-set-key (kbd "C-c w g") 'w3m-search)
  (autoload 'browse-url-interactive-arg "browse-url")
#+END_SRC

Try to restore window configuration when quitting w3m
#+BEGIN_SRC emacs-lisp
  (defvar my-w3m-last-windows nil)

  (defun my-store-pre-w3m-winconfig ()
    (interactive)
    (setq my-w3m-last-windows (current-window-configuration)))

  (defun my-restore-pre-w3m-winconfig ()
    (interactive)
    (set-window-configuration my-w3m-last-windows))

  ;; (add-hook 'w3m-select-buffer-hook #'my-store-pre-w3m-winconfig)
  ;; (add-hook 'w3m-delete-buffer-hook #'my-restore-pre-w3m-winconfig)
#+END_SRC
** helm-w3m
   :PROPERTIES:
   :ID:       bd7f3c36-cb10-47fb-9eea-02fd8fd049bf
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package helm-w3m
    :straight t
  )
#+END_SRC
* keyword-search
  :PROPERTIES:
  :ID:       bb5e50e2-47be-40fe-b264-5cf7cabc753d
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package keyword-search
    :straight t
  )
#+END_SRC
* ccls
  :PROPERTIES:
  :ID:       8aa5f468-f294-40ff-879f-538d2b0f720a
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package clang-format
    :commands clang-format-region)

  (use-package ccls
    :hook ((c-mode c++-mode objc-mode) .
           (lambda () (require 'ccls) (lsp-mode)))
    :config
    (bind-keys :map c++-mode-map
               :prefix "C-ö"
               :prefix-map my-ccls-map
               :prefix-docstring "ccls map."
      ("C-h" . (lambda () (interactive) (ccls-navigate "U")))
      ("C-j" . (lambda () (interactive) (ccls-navigate "R")))
      ("C-k" . (lambda () (interactive) (ccls-navigate "L")))
      ("C-l" . (lambda () (interactive) (ccls-navigate "D")))
      ("m" . (lambda () (interactive) (ccls/references-not-call)))
      ("m" . (lambda () (interactive) (ccls/references-macro)))
      ("r" . (lambda () (interactive) (ccls/references-read)))
      ("w" . (lambda () (interactive) (ccls/references-write)))
      ("lp" . (lambda () (interactive) (ccls-preprocess-file)))
      ("lf" . (lambda () (interactive) (ccls-reload)))
      ("=" . (lambda () (interactive) (clang-format-region)))
    )
    (setq ccls-executable "ccls")
    (setq lsp-prefer-flymake nil)
    (setq-default flycheck-disabled-checkers '(c/c++-clang c/c++-cppcheck c/c++-gcc))
    (setq ccls-sem-highlight-method 'font-lock)
    (add-hook 'lsp-after-open-hook #'ccls-code-lens-mode)
    (ccls-use-default-rainbow-sem-highlight)
    (setq
     ccls-initialization-options
     `(:clang
       (:excludeArgs
        ;; Linux's gcc options. See ccls/wiki
        ["-falign-jumps=1" "-falign-loops=1" "-fconserve-stack" "-fmerge-constants" "-fno-code-hoisting" "-fno-schedule-insns" "-fno-var-tracking-assignments" "-fsched-pressure"
         "-mhard-float" "-mindirect-branch-register" "-mindirect-branch=thunk-inline" "-mpreferred-stack-boundary=2" "-mpreferred-stack-boundary=3" "-mpreferred-stack-boundary=4" "-mrecord-mcount" "-mindirect-branch=thunk-extern" "-mno-fp-ret-in-387" "-mskip-rax-setup"
         "--param=allow-store-data-races=0" "-Wa arch/x86/kernel/macros.s" "-Wa -"]
        :extraArgs ["--gcc-toolchain=/usr"]
       )
       :completion
       (:include
        (:blacklist
         ["^/usr/(local/)?include/c\\+\\+/[0-9\\.]+/(bits|tr1|tr2|profile|ext|debug)/"
          "^/usr/(local/)?include/c\\+\\+/v1/"
          ]))
       :index (:trackDependency 1)))

    (add-to-list 'projectile-globally-ignored-directories ".ccls-cache")

    (defun ccls/callee () (interactive) (lsp-ui-peek-find-custom "$ccls/call" '(:callee t)))
    (defun ccls/caller () (interactive) (lsp-ui-peek-find-custom "$ccls/call"))
    (defun ccls/vars (kind) (lsp-ui-peek-find-custom "$ccls/vars" `(:kind ,kind)))
    (defun ccls/base (levels) (lsp-ui-peek-find-custom "$ccls/inheritance" `(:levels ,levels)))
    (defun ccls/derived (levels) (lsp-ui-peek-find-custom "$ccls/inheritance" `(:levels ,levels :derived t)))
    (defun ccls/member (kind) (interactive) (lsp-ui-peek-find-custom "$ccls/member" `(:kind ,kind)))
  )
#+END_SRC
