emacs.d/personal/custom/config.org
* lsp-mode
  :PROPERTIES:
  :ID:       05a88fab-8dd1-4fea-9642-3dc0f55ee13b
  :END:
#+BEGIN_SRC emacs-lisp
  ;; (use-package lsp-mode
  ;;   :config
  ;;   (add-hook 'c++-mode-hook #'lsp)
  ;;   (add-hook 'python-mode-hook #'lsp)
  ;;   (add-hook 'rust-mode-hook #'lsp))

    ;; (use-package lsp-mode :commands lsp :ensure t)
    ;; (use-package lsp-ui :commands lsp-ui-mode :ensure t)
    ;; (use-package company-lsp
    ;;   :ensure t
    ;;   :commands company-lsp
    ;;   :config (push 'company-lsp company-backends)) ;; add company-lsp as a backend

      (use-package lsp-mode
        :straight t
        :commands lsp)

      (use-package lsp-ui
        :straight t
        :commands lsp-ui-mode
        :config
        (setq lsp-ui-sideline-enable t
              lsp-ui-sideline-show-symbol t
              lsp-ui-sideline-show-hover t
              lsp-ui-sideline-show-code-actions t
              lsp-ui-sideline-update-mode 'point
              lsp-ui-doc-enable t
              lsp-ui-peek-enable t
              lsp-ui-peek-always-show t)
        (define-key lsp-ui-mode-map [remap xref-find-definitions] #'lsp-ui-peek-find-definitions)
        (define-key lsp-ui-mode-map [remap xref-find-references] #'lsp-ui-peek-find-references)
        (define-key lsp-ui-mode-map (kbd "C-c C-m .") 'lsp-ui-peek-find-definitions)
        (define-key lsp-ui-mode-map (kbd "C-c C-m ?") 'lsp-ui-peek-find-references)
        (define-key lsp-ui-mode-map (kbd "C-c C-m r") 'lsp-rename)
        (define-key lsp-ui-mode-map (kbd "C-c C-m x") 'lsp-restart-workspace)
        (define-key lsp-ui-mode-map (kbd "C-c C-m w") 'lsp-ui-peek-find-workspace-symbol)
        (define-key lsp-ui-mode-map (kbd "C-c C-m i") 'lsp-ui-peek-find-implementation)
        (define-key lsp-ui-mode-map (kbd "C-c C-m d") 'lsp-describe-thing-at-point)
      )

      (use-package company-lsp
        :straight t
        :commands company-lsp)

      ;; (require 'lsp-mode)
      ;; (add-hook 'python-mode-hook #'lsp)
      ;; (require 'flymake-shell)
      ;; (add-hook 'sh-set-shell-hook 'flymake-shell-load)
      ;;(add-hook 'sh-mode-hook #'lsp-mode)
      ;;(add-hook 'c-mode-hook #'lsp)   ;; clangd, cquery
      ;;(add-hook 'c++-mode-hook #'lsp) ;; clangd, cquery
      ;; (use-package lsp-mode
      ;;   :ensure t
      ;;   :config

      ;;   ;; make sure we have lsp-imenu everywhere we have LSP
      ;;   ;; (require 'lsp-imenu)
      ;;   (add-hook 'lsp-after-open-hook 'lsp-enable-imenu)
      ;;   ;; get lsp-python-enable defined
      ;;   ;; NB: use either projectile-project-root or ffip-get-project-root-directory
      ;;   ;;     or any other function that can be used to find the root directory of a project
      ;;   ;; (lsp-define-stdio-client lsp-python "python"
      ;;   ;;                          #'projectile-project-root
      ;;   ;;                          '("pyls"))

      ;;   ;; make sure this is activated when python-mode is activated
      ;;   ;; lsp-python-enable is created by macro above
      ;;   (add-hook 'python-mode-hook
      ;;             (lambda ()
      ;;               (lsp)))

      ;;   ;; lsp extras
      ;;   (use-package lsp-ui
      ;;     :ensure t
      ;;     :config
      ;;     (setq lsp-ui-sideline-ignore-duplicate t)
      ;;     (add-hook 'lsp-mode-hook 'lsp-ui-mode))

      ;;   (use-package company-lsp
      ;;     :config
      ;;     (push 'company-lsp company-backends))

      ;;   ;; NB: only required if you prefer flake8 instead of the default
      ;;   ;; send pyls config via lsp-after-initialize-hook -- harmless for
      ;;   ;; other servers due to pyls key, but would prefer only sending this
      ;;   ;; when pyls gets initialised (:initialize function in
      ;;   ;; lsp-define-stdio-client is invoked too early (before server
      ;;   ;; start)) -- cpbotha
      ;;   (defun lsp-set-cfg ()
      ;;     (let ((lsp-cfg `(:pyls (:configurationSources ("flake8")))))
      ;;       ;; TODO: check lsp--cur-workspace here to decide per server / project
      ;;       (lsp--set-configuration lsp-cfg)))

      ;;   (add-hook 'lsp-after-initialize-hook 'lsp-set-cfg))
#+END_SRC
* Erlang
  :PROPERTIES:
  :ID:       e12c6fb2-8b86-4971-b323-0516b76b87a4
  :END:
#+BEGIN_SRC emacs-lisp
  ;; (use-package erlang-start
  ;;   :config
  ;;   (setq erlang-root-dir "/usr/lib64/erlang")
  ;;   (add-to-list 'exec-path "/usr/lib64/erlang/bin")
  ;;   (setq erlang-man-root-dir "/usr/lib64/erlang/man")
  ;;   )
#+END_SRC
* Haskell
  :PROPERTIES:
  :ID:       afc8d33f-3965-4922-8c6c-7c509cead802
  :END:
** Custom settings
   :PROPERTIES:
   :ID:       4727079c-4f60-4622-9cb4-c865dd2bf1b4
   :END:
#+BEGIN_SRC emacs-lisp
  ;; (custom-set-variables
  ;;  '(haskell-process-suggest-remove-import-lines t)
  ;;  '(haskell-process-auto-import-loaded-modules t)
  ;;  '(haskell-process-log t)
  ;;  '(haskell-process-type (quote cabal-repl)) ;; mui importante
  ;;  '(haskell-tags-on-save t)
  ;;  '(inferior-haskell-wait-and-jump t))
#+END_SRC
** ghc
   :PROPERTIES:
   :ID:       3cf6ae7f-a0c8-40da-b7d2-404971aaf7e5
   :END:
#+BEGIN_SRC emacs-lisp
  ;; (autoload 'ghc-init "ghc" nil t)
  ;; (autoload 'ghc-debug "ghc" nil t)
  ;; (add-hook 'haskell-mode-hook (lambda () (ghc-init)))
#+END_SRC
** indentation etc
   :PROPERTIES:
   :ID:       146b3414-553b-4cf5-a3c2-4bc735d4abac
   :END:
#+BEGIN_SRC emacs-lisp
  ;; (add-hook 'haskell-mode-hook 'turn-on-haskell-decl-scan)
  ;; ;(add-hook 'haskell-mode-hook 'haskell-indent-mode)
  ;; (add-hook 'haskell-mode-hook 'turn-on-haskell-indentation)
  ;; (add-hook 'haskell-mode-hook 'interactive-haskell-mode)
  ;; ;(add-hook 'haskell-mode-hook 'haskell-doc-mode)
#+END_SRC
** haskell-mode-map
   :PROPERTIES:
   :ID:       92813e85-a745-47b5-b689-136ce5b9d204
   :END:
#+BEGIN_SRC emacs-lisp
  ;; (eval-after-load 'haskell-mode '(progn
  ;;     (define-key haskell-mode-map (kbd "C-c C-h")
  ;;       (lambda ()
  ;;         (interactive)
  ;;         (keyword-search-at-point "hayoo")))
  ;;     (bind-keys :map haskell-mode-map
  ;;                ("C-c h" . 'haskell-hoogle)
  ;;                ("C-c C-l" . 'haskell-process-load-or-reload)
  ;;                ("C-c C-n C-t" . 'haskell-process-do-type)
  ;;                ("C-c C-n C-i" . 'haskell-process-do-info)
  ;;                ("C-c C-n C-c" . 'haskell-process-cabal-build)
  ;;                ("C-c C-n c" . 'haskell-process-cabal)
  ;;                ("C-c C-o" . 'haskell-compile)
  ;;                ("SPC" . 'haskell-mode-contextual-space))))
#+END_SRC
** haskell-cabal-mode-map
   :PROPERTIES:
   :ID:       96877a71-99ff-405b-a69a-8d10b99adefd
   :END:
#+BEGIN_SRC emacs-lisp
  ;; (eval-after-load 'haskell-cabal
  ;;   '(progn
  ;;      (bind-keys :map haskell-cabal-mode-map
  ;;                 ("C-c C-k" . 'haskell-interactive-mode-clear)
  ;;                 ("C-c C-c" . 'haskell-process-cabal-build)
  ;;                 ("C-c C-o" . 'haskell-compile)
  ;;                 ("C-c c" . 'haskell-process-cabal))))
#+END_SRC
* JSON
  :PROPERTIES:
  :ID:       1281fd42-d57d-4d7b-aad9-52474d87f439
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package json)
#+END_SRC
* julia
  :PROPERTIES:
  :ID:       59e2e31b-d572-4c44-91e1-c8d7c86c808c
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package julia-mode)
  (use-package julia-repl)
  (use-package flycheck-julia)
  (flycheck-julia-setup)
#+END_SRC
* ein
  :PROPERTIES:
  :ID:       129f2f08-e160-4602-a17f-de051b513f3d
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package ein)
#+END_SRC
* lua
  :PROPERTIES:
  :ID:       9b7eec09-929d-4a61-a4b8-22ed0da964cb
  :END:
#+BEGIN_SRC emacs-lisp
;; (setq lua-documentation-url "http://www.lua.org/manual/5.1/manual.html")
;; (setq lua-documentation-url "http://www.lua.org/manual/5.2/manual.html")
(setq lua-documentation-url "file:///usr/share/doc/lua5.2-doc/manual.html")
#+END_SRC
* raku
  :PROPERTIES:
  :ID:       f4fa522d-5c85-4545-bcbd-70b8d3c68ee5
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package raku-mode)
#+END_SRC
* rust
  :PROPERTIES:
  :ID:       858934f5-65f6-40d2-8ecb-ffbf6d2451c0
  :END:
#+BEGIN_SRC emacs-lisp
    (with-eval-after-load 'rust-mode
      (add-hook 'flycheck-mode-hook #'flycheck-rust-setup))
#+END_SRC
* eval-in-repl
  :PROPERTIES:
  :ID:       71c35654-95d2-4c42-89b8-ddd8ee18fee3
  :END:
#+BEGIN_SRC emacs-lisp
(use-package eval-in-repl)
#+END_SRC
** ielm
   :PROPERTIES:
   :ID:       22616dc8-59df-4394-8ff5-5c9dc36df29e
   :END:
ielm support (for emacs lisp)
#+BEGIN_SRC emacs-lisp
  (use-package eval-in-repl-ielm
    :straight nil
    :bind (:map emacs-lisp-mode-map
           ("<C-return>" . eir-eval-in-ielm) ;; for .el files
           :map lisp-interaction-mode-map
           ("<C-return>" . eir-eval-in-ielm) ;; for *scratch*
           :map Info-mode-map
           ("<C-return>" . eir-eval-in-ielm) ;; for M-x info
           ))
#+END_SRC
** cider
   :PROPERTIES:
   :ID:       0cd7ca16-8a80-41de-8486-e4737e65fe55
   :END:
cider support (for Clojure)
#+BEGIN_SRC emacs-lisp
  ;; (use-package eval-in-repl-cider
  ;;   :bind (:map clojure-mode-map
  ;;               ("<C-return>" . eir-eval-in-cider)
  ;;         )
  ;;   )
#+END_SRC
