prelude/personal/custom/config.el

;; (use-package lsp-mode
;;   :config
;;   (add-hook 'c++-mode-hook #'lsp)
;;   (add-hook 'python-mode-hook #'lsp)
;;   (add-hook 'rust-mode-hook #'lsp))

  ;; (use-package lsp-mode :commands lsp :ensure t)
  ;; (use-package lsp-ui :commands lsp-ui-mode :ensure t)
  ;; (use-package company-lsp
  ;;   :ensure t
  ;;   :commands company-lsp
  ;;   :config (push 'company-lsp company-backends)) ;; add company-lsp as a backend

    (use-package lsp-mode
      :straight t
      :commands lsp)

    (use-package lsp-ui
      :straight t
      :commands lsp-ui-mode
      :config
      (setq lsp-ui-sideline-enable t
            lsp-ui-sideline-show-symbol t
            lsp-ui-sideline-show-hover t
            lsp-ui-sideline-show-code-actions t
            lsp-ui-sideline-update-mode 'point
            lsp-ui-doc-enable t
            lsp-ui-peek-enable t
            lsp-ui-peek-always-show t)
      (define-key lsp-ui-mode-map [remap xref-find-definitions] #'lsp-ui-peek-find-definitions)
      (define-key lsp-ui-mode-map [remap xref-find-references] #'lsp-ui-peek-find-references)
      (define-key lsp-ui-mode-map (kbd "C-c C-m .") 'lsp-ui-peek-find-definitions)
      (define-key lsp-ui-mode-map (kbd "C-c C-m ?") 'lsp-ui-peek-find-references)
      (define-key lsp-ui-mode-map (kbd "C-c C-m r") 'lsp-rename)
      (define-key lsp-ui-mode-map (kbd "C-c C-m x") 'lsp-restart-workspace)
      (define-key lsp-ui-mode-map (kbd "C-c C-m w") 'lsp-ui-peek-find-workspace-symbol)
      (define-key lsp-ui-mode-map (kbd "C-c C-m i") 'lsp-ui-peek-find-implementation)
      (define-key lsp-ui-mode-map (kbd "C-c C-m d") 'lsp-describe-thing-at-point)
    )

    (use-package company-lsp
      :straight t
      :commands company-lsp)

    ;; (require 'lsp-mode)
    ;; (add-hook 'python-mode-hook #'lsp)
    ;; (require 'flymake-shell)
    ;; (add-hook 'sh-set-shell-hook 'flymake-shell-load)
    ;;(add-hook 'sh-mode-hook #'lsp-mode)
    ;;(add-hook 'c-mode-hook #'lsp)   ;; clangd, cquery
    ;;(add-hook 'c++-mode-hook #'lsp) ;; clangd, cquery
    ;; (use-package lsp-mode
    ;;   :ensure t
    ;;   :config

    ;;   ;; make sure we have lsp-imenu everywhere we have LSP
    ;;   ;; (require 'lsp-imenu)
    ;;   (add-hook 'lsp-after-open-hook 'lsp-enable-imenu)
    ;;   ;; get lsp-python-enable defined
    ;;   ;; NB: use either projectile-project-root or ffip-get-project-root-directory
    ;;   ;;     or any other function that can be used to find the root directory of a project
    ;;   ;; (lsp-define-stdio-client lsp-python "python"
    ;;   ;;                          #'projectile-project-root
    ;;   ;;                          '("pyls"))

    ;;   ;; make sure this is activated when python-mode is activated
    ;;   ;; lsp-python-enable is created by macro above
    ;;   (add-hook 'python-mode-hook
    ;;             (lambda ()
    ;;               (lsp)))

    ;;   ;; lsp extras
    ;;   (use-package lsp-ui
    ;;     :ensure t
    ;;     :config
    ;;     (setq lsp-ui-sideline-ignore-duplicate t)
    ;;     (add-hook 'lsp-mode-hook 'lsp-ui-mode))

    ;;   (use-package company-lsp
    ;;     :config
    ;;     (push 'company-lsp company-backends))

    ;;   ;; NB: only required if you prefer flake8 instead of the default
    ;;   ;; send pyls config via lsp-after-initialize-hook -- harmless for
    ;;   ;; other servers due to pyls key, but would prefer only sending this
    ;;   ;; when pyls gets initialised (:initialize function in
    ;;   ;; lsp-define-stdio-client is invoked too early (before server
    ;;   ;; start)) -- cpbotha
    ;;   (defun lsp-set-cfg ()
    ;;     (let ((lsp-cfg `(:pyls (:configurationSources ("flake8")))))
    ;;       ;; TODO: check lsp--cur-workspace here to decide per server / project
    ;;       (lsp--set-configuration lsp-cfg)))

    ;;   (add-hook 'lsp-after-initialize-hook 'lsp-set-cfg))

;; (use-package erlang-start
;;   :config
;;   (setq erlang-root-dir "/usr/lib64/erlang")
;;   (add-to-list 'exec-path "/usr/lib64/erlang/bin")
;;   (setq erlang-man-root-dir "/usr/lib64/erlang/man")
;;   )

;; (custom-set-variables
;;  '(haskell-process-suggest-remove-import-lines t)
;;  '(haskell-process-auto-import-loaded-modules t)
;;  '(haskell-process-log t)
;;  '(haskell-process-type (quote cabal-repl)) ;; mui importante
;;  '(haskell-tags-on-save t)
;;  '(inferior-haskell-wait-and-jump t))

;; (autoload 'ghc-init "ghc" nil t)
;; (autoload 'ghc-debug "ghc" nil t)
;; (add-hook 'haskell-mode-hook (lambda () (ghc-init)))

;; (add-hook 'haskell-mode-hook 'turn-on-haskell-decl-scan)
;; ;(add-hook 'haskell-mode-hook 'haskell-indent-mode)
;; (add-hook 'haskell-mode-hook 'turn-on-haskell-indentation)
;; (add-hook 'haskell-mode-hook 'interactive-haskell-mode)
;; ;(add-hook 'haskell-mode-hook 'haskell-doc-mode)

;; (eval-after-load 'haskell-mode '(progn
;;     (define-key haskell-mode-map (kbd "C-c C-h")
;;       (lambda ()
;;         (interactive)
;;         (keyword-search-at-point "hayoo")))
;;     (bind-keys :map haskell-mode-map
;;                ("C-c h" . 'haskell-hoogle)
;;                ("C-c C-l" . 'haskell-process-load-or-reload)
;;                ("C-c C-n C-t" . 'haskell-process-do-type)
;;                ("C-c C-n C-i" . 'haskell-process-do-info)
;;                ("C-c C-n C-c" . 'haskell-process-cabal-build)
;;                ("C-c C-n c" . 'haskell-process-cabal)
;;                ("C-c C-o" . 'haskell-compile)
;;                ("SPC" . 'haskell-mode-contextual-space))))

;; (eval-after-load 'haskell-cabal
;;   '(progn
;;      (bind-keys :map haskell-cabal-mode-map
;;                 ("C-c C-k" . 'haskell-interactive-mode-clear)
;;                 ("C-c C-c" . 'haskell-process-cabal-build)
;;                 ("C-c C-o" . 'haskell-compile)
;;                 ("C-c c" . 'haskell-process-cabal))))

(use-package json)

(use-package julia-mode)
(use-package julia-repl)
(use-package flycheck-julia)
(flycheck-julia-setup)

(use-package ein)

;; (setq lua-documentation-url "http://www.lua.org/manual/5.1/manual.html")
;; (setq lua-documentation-url "http://www.lua.org/manual/5.2/manual.html")
(setq lua-documentation-url "file:///usr/share/doc/lua5.2-doc/manual.html")

(use-package raku-mode)

(with-eval-after-load 'rust-mode
  (add-hook 'flycheck-mode-hook #'flycheck-rust-setup))

(use-package eval-in-repl)

(use-package eval-in-repl-ielm
  :straight nil
  :bind (:map emacs-lisp-mode-map
         ("<C-return>" . eir-eval-in-ielm) ;; for .el files
         :map lisp-interaction-mode-map
         ("<C-return>" . eir-eval-in-ielm) ;; for *scratch*
         :map Info-mode-map
         ("<C-return>" . eir-eval-in-ielm) ;; for M-x info
         ))

;; (use-package eval-in-repl-cider
;;   :bind (:map clojure-mode-map
;;               ("<C-return>" . eir-eval-in-cider)
;;         )
;;   )
