emacs.d/personal/custom/config.org
** shell
   :PROPERTIES:
   :ID:       46876707-0c7b-462c-a326-1ebb07d6e4bb
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package eval-in-repl-shell
    :straight nil
    :config
    (add-hook 'sh-mode-hook
              '(lambda()
                 (local-set-key (kbd "C-<return>") 'eir-eval-in-shell))))
#+END_SRC
* Minor conveniences
  :PROPERTIES:
  :ID:       7798cfb4-fd42-4a5d-8d9e-212a84db3423
  :END:
Emacs is at it's best when it just does things for you, shows you the way, guides you so to speak.
This can be best achieved using a number of small extensions. While on their own they might not be particularly
impressive. Together they create a nice environment for you to work in.

** Visiting the configuration
   :PROPERTIES:
   :ID:       593b0353-da79-4d7d-b991-d617ecac4288
   :END:
Quickly edit =~/.emacs.d/personal/custom/config.org=
#+BEGIN_SRC emacs-lisp
  (defun config-visit ()
    (interactive)
    (find-file "~/.emacs.d/personal/custom/config.org"))
  ;; (global-set-key (kbd "C-c e") 'config-visit)
#+END_SRC

** Reloading the configuration
   :PROPERTIES:
   :ID:       0aa11d08-63c1-4320-b379-027e498fd7a8
   :END:
Simply pressing =Control-x l r= will reload this file, very handy.
You can also manually invoke =config-reload=.
#+BEGIN_SRC emacs-lisp
  (defun config-reload ()
    "Reloads ~/.emacs.d/personal/custom/config.org at runtime"
    (interactive)
    (org-babel-load-file (expand-file-name "~/.emacs.d/personal/custom/config.org")))
#+END_SRC
* launcher-map
  :PROPERTIES:
  :ID:       dc801fdf-436d-40bd-a95b-541d944101d8
  :END:
#+BEGIN_SRC emacs-lisp
(define-prefix-command 'launcher-map)
;; The manual recommends C-c for user keys, but C-x l is
;; always free and is natural to remember.
(define-key ctl-x-map "l" 'launcher-map)
;;(global-set-key (kbd "s-l") 'launcher-map)
(global-set-key (kbd "H-l") 'launcher-map)
;; Note: keys o and c are defined in link-hint
(define-key launcher-map "C" #'org-capture)
(define-key launcher-map "d" #'ediff-buffers)
(define-key launcher-map "e" #'er/expand-region)
(define-key launcher-map "E" #'er/contract-region)
(define-key launcher-map "f" #'find-dired)
(define-key launcher-map "g" #'lgrep)
(define-key launcher-map "G" #'rgrep)
(define-key launcher-map "h" #'man) ; Help
(define-key launcher-map "i" #'package-install-from-buffer)
(define-key launcher-map "j" #'org-journal-new-entry)
(define-key launcher-map "p" #'paradox-list-packages)
(define-key launcher-map "r" #'config-reload)
(define-key launcher-map "R" #'counsel-recentf)
(define-key launcher-map "s" #'sunrise)
(define-key launcher-map "S" #'sunrise-cd)
(define-key launcher-map "t" #'proced) ; top
(define-key launcher-map "u" #'my/copy-id-to-clipboard)
(define-key launcher-map "v" #'config-visit)
(define-key launcher-map "y" #'counsel-yank-pop)
#+END_SRC
* link-hint
  :PROPERTIES:
  :ID:       74ff254a-0a99-46c7-9eb9-6face46f0556
  :END:
link-hint.el is inspired by the link hinting functionality in vim-like browsers and browser plugins such as pentadactyl.
It provides commands for using avy to open, copy, or take a user-defined action on “links.”
#+BEGIN_SRC emacs-lisp
 (use-package link-hint
   :ensure t
   :config
   (define-key launcher-map "o" #'link-hint-open-link)
   (define-key launcher-map "c" #'link-hint-copy-link))
#+END_SRC
* split buffer
  :PROPERTIES:
  :ID:       4086b4b2-6e4d-4efa-8908-f3a9dae7ea41
  :END:
#+BEGIN_SRC emacs-lisp
(defun sacha/vsplit-last-buffer (prefix)
  "Split the window vertically and display the previous buffer."
  (interactive "p")
  (split-window-vertically)
  (other-window 1 nil)
  (unless prefix
    (switch-to-next-buffer)))

(defun sacha/hsplit-last-buffer (prefix)
  "Split the window horizontally and display the previous buffer."
  (interactive "p")
  (split-window-horizontally)
  (other-window 1 nil)
  (unless prefix
    (switch-to-next-buffer)))

(global-set-key "\M-0" 'delete-window)
(global-set-key "\M-1" 'delete-other-windows)
(global-set-key "\M-2" 'sacha/vsplit-last-buffer)
(global-set-key "\M-3" 'sacha/hsplit-last-buffer)
(global-set-key (kbd "M-4") #'er/expand-region)
#+END_SRC
* Hydra
  :PROPERTIES:
  :ID:       31baaa6b-1305-4dde-8311-6b914db3f451
  :END:
** Setup
   :PROPERTIES:
   :ID:       629d6631-c28e-452f-9e01-0acb54b2de7d
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package hydra)
  (use-package hydra-examples
   :straight nil)
#+END_SRC
** hydra-error
   :PROPERTIES:
   :ID:       db6e5d19-53b1-4de6-a78b-42759ab6d30e
   :END:
#+BEGIN_SRC emacs-lisp
(defhydra hydra-error ()
   "goto-error"
   ("h" first-error "first")
   ("j" next-error "next")
   ("k" previous-error "prev")
   ("v" recenter-top-bottom "recenter")
   ("q" nil "quit"))
#+END_SRC
** hydra-splitter
   :PROPERTIES:
   :ID:       5c4ebf59-7d32-4bf0-adea-a390b6ee064f
   :END:
#+BEGIN_SRC emacs-lisp
(defhydra hydra-splitter ()
   "splitter"
   ("h" hydra-move-splitter-left)
   ("j" hydra-move-splitter-down)
   ("k" hydra-move-splitter-up)
   ("l" hydra-move-splitter-right))
#+END_SRC
** hydra-toggle
   :PROPERTIES:
   :ID:       2d35b42a-6102-47a6-88f5-34b61b210ad8
   :END:
#+BEGIN_SRC emacs-lisp
(defhydra hydra-toggle (:color pink)
  "
            _a_ abbrev-mode:       %`abbrev-mode
            _d_ debug-on-error:    %`debug-on-error
            _f_ auto-fill-mode:    %`auto-fill-function
            _g_ golden-ratio-mode: %`golden-ratio-mode
            _t_ truncate-lines:    %`truncate-lines
            _w_ whitespace-mode:   %`whitespace-mode
            "
  ("a" abbrev-mode nil)
  ("d" toggle-debug-on-error nil)
  ("f" auto-fill-mode nil)
  ("g" golden-ratio-mode nil)
  ("t" toggle-truncate-lines nil)
  ("w" whitespace-mode nil)
  ("q" nil "cancel"))
#+END_SRC
** hydra-window
   :PROPERTIES:
   :ID:       b97d9d52-47f6-49ec-b216-a30ea0dc4b50
   :END:
#+BEGIN_SRC emacs-lisp
(defhydra hydra-window (:color red
                        :hint nil)
  "
 Split: _v_ert _x_:horz
Delete: _o_nly  _da_ce  _dw_indow  _db_uffer  _df_rame
  Move: _s_wap
Frames: _f_rame new  _df_ delete
  Misc: _m_ark _a_ce  _u_ndo  _r_edo"
  ("h" windmove-left)
  ("j" windmove-down)
  ("k" windmove-up)
  ("l" windmove-right)
  ("H" hydra-move-splitter-left)
  ("J" hydra-move-splitter-down)
  ("K" hydra-move-splitter-up)
  ("L" hydra-move-splitter-right)
  ("|" (lambda ()
         (interactive)
         (split-window-right)
         (windmove-right)))
  ("_" (lambda ()
         (interactive)
         (split-window-below)
         (windmove-down)))
  ("v" split-window-right)
  ("x" split-window-below)
  ;("t" transpose-frame "'")
  ("u" winner-undo)
  ("r" winner-redo) ;;Fixme, not working?
  ("o" delete-other-windows :exit t)
  ("a" ace-window :exit t)
  ("f" make-frame :exit t)
  ("s" ace-swap-window)
  ("da" ace-delete-window)
  ("dw" delete-window)
  ("db" kill-this-buffer)
  ("df" delete-frame :exit t)
  ("q" nil)
  ;("i" ace-maximize-window "ace-one" :color blue)
  ;("b" ido-switch-buffer "buf")
  ("m" headlong-bookmark-jump))
(global-set-key (kbd "C-M-o") 'hydra-window/body)
#+END_SRC
** hydra-rectangle
   :PROPERTIES:
   :ID:       a1c9a1f7-befd-4e3a-81f5-9867a2c0621e
   :END:
#+BEGIN_SRC emacs-lisp

(defhydra hydra-rectangle (:body-pre (rectangle-mark-mode 1)
                                     :color pink
                                     :post (deactivate-mark))
  "
  ^_k_^     _d_elete    _s_tring
_h_   _l_   _o_k        _y_ank
  ^_j_^     _n_ew-copy  _r_eset
^^^^        _e_xchange  _u_ndo
^^^^        ^ ^         _p_aste
"
  ("h" backward-char nil)
  ("l" forward-char nil)
  ("k" previous-line nil)
  ("j" next-line nil)
  ("e" exchange-point-and-mark nil)
  ("n" copy-rectangle-as-kill nil)
  ("d" delete-rectangle nil)
  ("r" (if (region-active-p)
           (deactivate-mark)
         (rectangle-mark-mode 1)) nil)
  ("y" yank-rectangle nil)
  ("u" undo nil)
  ("s" string-rectangle nil)
  ("p" kill-rectangle nil)
  ("o" nil nil))
(global-set-key (kbd "C-x SPC") 'hydra-rectangle/body)
#+END_SRC

