prelude/personal/custom/config.el

(use-package eval-in-repl-shell
  :straight nil
  :config
  (add-hook 'sh-mode-hook
            '(lambda()
               (local-set-key (kbd "C-<return>") 'eir-eval-in-shell))))

(defun config-visit ()
  (interactive)
  (find-file "~/.emacs.d/personal/custom/config.org"))
;; (global-set-key (kbd "C-c e") 'config-visit)

(defun config-reload ()
  "Reloads ~/.emacs.d/personal/custom/config.org at runtime"
  (interactive)
  (org-babel-load-file (expand-file-name "~/.emacs.d/personal/custom/config.org")))

(define-prefix-command 'launcher-map)
;; The manual recommends C-c for user keys, but C-x l is
;; always free and is natural to remember.
(define-key ctl-x-map "l" 'launcher-map)
;;(global-set-key (kbd "s-l") 'launcher-map)
(global-set-key (kbd "H-l") 'launcher-map)
;; Note: keys o and c are defined in link-hint
(define-key launcher-map "C" #'org-capture)
(define-key launcher-map "d" #'ediff-buffers)
(define-key launcher-map "e" #'er/expand-region)
(define-key launcher-map "E" #'er/contract-region)
(define-key launcher-map "f" #'find-dired)
(define-key launcher-map "g" #'lgrep)
(define-key launcher-map "G" #'rgrep)
(define-key launcher-map "h" #'man) ; Help
(define-key launcher-map "i" #'package-install-from-buffer)
(define-key launcher-map "j" #'org-journal-new-entry)
(define-key launcher-map "p" #'paradox-list-packages)
(define-key launcher-map "r" #'config-reload)
(define-key launcher-map "R" #'counsel-recentf)
(define-key launcher-map "s" #'sunrise)
(define-key launcher-map "S" #'sunrise-cd)
(define-key launcher-map "t" #'proced) ; top
(define-key launcher-map "u" #'my/copy-id-to-clipboard)
(define-key launcher-map "v" #'config-visit)
(define-key launcher-map "y" #'counsel-yank-pop)

(use-package link-hint
  :ensure t
  :config
  (define-key launcher-map "o" #'link-hint-open-link)
  (define-key launcher-map "c" #'link-hint-copy-link))

(defun sacha/vsplit-last-buffer (prefix)
  "Split the window vertically and display the previous buffer."
  (interactive "p")
  (split-window-vertically)
  (other-window 1 nil)
  (unless prefix
    (switch-to-next-buffer)))

(defun sacha/hsplit-last-buffer (prefix)
  "Split the window horizontally and display the previous buffer."
  (interactive "p")
  (split-window-horizontally)
  (other-window 1 nil)
  (unless prefix
    (switch-to-next-buffer)))

(global-set-key "\M-0" 'delete-window)
(global-set-key "\M-1" 'delete-other-windows)
(global-set-key "\M-2" 'sacha/vsplit-last-buffer)
(global-set-key "\M-3" 'sacha/hsplit-last-buffer)
(global-set-key (kbd "M-4") #'er/expand-region)

(use-package hydra)
(use-package hydra-examples
 :straight nil)

(defhydra hydra-error ()
   "goto-error"
   ("h" first-error "first")
   ("j" next-error "next")
   ("k" previous-error "prev")
   ("v" recenter-top-bottom "recenter")
   ("q" nil "quit"))

(defhydra hydra-splitter ()
   "splitter"
   ("h" hydra-move-splitter-left)
   ("j" hydra-move-splitter-down)
   ("k" hydra-move-splitter-up)
   ("l" hydra-move-splitter-right))

(defhydra hydra-toggle (:color pink)
  "
            _a_ abbrev-mode:       %`abbrev-mode
            _d_ debug-on-error:    %`debug-on-error
            _f_ auto-fill-mode:    %`auto-fill-function
            _g_ golden-ratio-mode: %`golden-ratio-mode
            _t_ truncate-lines:    %`truncate-lines
            _w_ whitespace-mode:   %`whitespace-mode
            "
  ("a" abbrev-mode nil)
  ("d" toggle-debug-on-error nil)
  ("f" auto-fill-mode nil)
  ("g" golden-ratio-mode nil)
  ("t" toggle-truncate-lines nil)
  ("w" whitespace-mode nil)
  ("q" nil "cancel"))

(defhydra hydra-window (:color red
                        :hint nil)
  "
 Split: _v_ert _x_:horz
Delete: _o_nly  _da_ce  _dw_indow  _db_uffer  _df_rame
  Move: _s_wap
Frames: _f_rame new  _df_ delete
  Misc: _m_ark _a_ce  _u_ndo  _r_edo"
  ("h" windmove-left)
  ("j" windmove-down)
  ("k" windmove-up)
  ("l" windmove-right)
  ("H" hydra-move-splitter-left)
  ("J" hydra-move-splitter-down)
  ("K" hydra-move-splitter-up)
  ("L" hydra-move-splitter-right)
  ("|" (lambda ()
         (interactive)
         (split-window-right)
         (windmove-right)))
  ("_" (lambda ()
         (interactive)
         (split-window-below)
         (windmove-down)))
  ("v" split-window-right)
  ("x" split-window-below)
  ;("t" transpose-frame "'")
  ("u" winner-undo)
  ("r" winner-redo) ;;Fixme, not working?
  ("o" delete-other-windows :exit t)
  ("a" ace-window :exit t)
  ("f" make-frame :exit t)
  ("s" ace-swap-window)
  ("da" ace-delete-window)
  ("dw" delete-window)
  ("db" kill-this-buffer)
  ("df" delete-frame :exit t)
  ("q" nil)
  ;("i" ace-maximize-window "ace-one" :color blue)
  ;("b" ido-switch-buffer "buf")
  ("m" headlong-bookmark-jump))
(global-set-key (kbd "C-M-o") 'hydra-window/body)

(defhydra hydra-rectangle (:body-pre (rectangle-mark-mode 1)
                                     :color pink
                                     :post (deactivate-mark))
  "
  ^_k_^     _d_elete    _s_tring
_h_   _l_   _o_k        _y_ank
  ^_j_^     _n_ew-copy  _r_eset
^^^^        _e_xchange  _u_ndo
^^^^        ^ ^         _p_aste
"
  ("h" backward-char nil)
  ("l" forward-char nil)
  ("k" previous-line nil)
  ("j" next-line nil)
  ("e" exchange-point-and-mark nil)
  ("n" copy-rectangle-as-kill nil)
  ("d" delete-rectangle nil)
  ("r" (if (region-active-p)
           (deactivate-mark)
         (rectangle-mark-mode 1)) nil)
  ("y" yank-rectangle nil)
  ("u" undo nil)
  ("s" string-rectangle nil)
  ("p" kill-rectangle nil)
  ("o" nil nil))
(global-set-key (kbd "C-x SPC") 'hydra-rectangle/body)
