prelude/personal/custom/config.el

(use-package langtool
  :init
  (setq langtool-language-tool-jar
        "/home/jw/LanguageTool-3.0/languagetool-commandline.jar")
  :bind (("\C-x4w" . langtool-check)
         ("\C-x4W" . langtool-check-done)
         ("\C-x4l" . langtool-switch-default-language)
         ("\C-x44" . langtool-show-message-at-point)
         ("\C-x4c" . langtool-correct-buffer))
  :config
  ;; (setq langtool-default-language "en-US")
  (setq langtool-mother-tongue "en")
  )

(use-package ediff
  :config
  (defmacro csetq (variable value)
    `(funcall (or (get ',variable 'custom-set)
                  'set-default)
              ',variable ,value))
  (csetq ediff-window-setup-function 'ediff-setup-windows-plain)
  (csetq ediff-split-window-function 'split-window-horizontally)
  (csetq ediff-diff-options "-w")
  )

(defun bms/pdf-no-filter ()
 "View pdf without colour filter."
 (interactive)
 (pdf-view-midnight-minor-mode -1)
 )

;; change midnite mode colours functions
(defun bms/pdf-midnite-original ()
 "Set pdf-view-midnight-colors to original colours."
 (interactive)
 (setq pdf-view-midnight-colors '("#839496" . "#002b36" )) ; original values
 (pdf-view-midnight-minor-mode)
 )

(defun bms/pdf-midnite-amber ()
 "Set pdf-view-midnight-colors to amber on dark slate blue."
 (interactive)
 (setq pdf-view-midnight-colors '("#ff9900" . "#0a0a12" )) ; amber
 (pdf-view-midnight-minor-mode)
 )

(defun bms/pdf-midnite-green ()
 "Set pdf-view-midnight-colors to green on black."
 (interactive)
 (setq pdf-view-midnight-colors '("#00B800" . "#000000" )) ; green
 (pdf-view-midnight-minor-mode)
 )

(defun bms/pdf-midnite-zenburn ()
  "Set pdf-view-midnight-colors to zenburn."
  (interactive)
  (setq pdf-view-midnight-colors '("#DCDCCC" . "#383838" ))
  (pdf-view-midnight-minor-mode)
  )

(defun bms/pdf-midnite-colour-schemes ()
 "Midnight mode colour schemes bound to keys"
 (local-set-key (kbd "!") (quote bms/pdf-no-filter))
 (local-set-key (kbd "@") (quote bms/pdf-midnite-amber))
 (local-set-key (kbd "#") (quote bms/pdf-midnite-zenburn))
 (local-set-key (kbd "$") (quote bms/pdf-midnite-original))
 )

(use-package pdf-tools
  :straight t
  :config
  (pdf-tools-install)
  ;; open pdfs scaled to fit page
  (setq-default pdf-view-display-size 'fit-page)
  ;; automatically annotate highlights
  (setq pdf-annot-activate-created-annotations t)
  ;; use normal isearch
  (define-key pdf-view-mode-map (kbd "C-s") 'isearch-forward)
  ;; turn off cua so copy works
  (add-hook 'pdf-view-mode-hook (lambda () (cua-mode 0)))
  ;; The following sets up a variety of colour-filter modes (good for
  ;; night-time viewing, or anytime really that you don't want your
  ;; eyeballs blasted with blazing white light):
  ;; (setq pdf-view-midnight-colors '("#ff9900" . "#0a0a12" )) ; set the amber profile as default (see below)
  ;; (setq pdf-view-midnight-colors '("#DCDCCC" . "#383838" )) ; set the zenburn profile as default (see below)
  ;; (add-hook 'pdf-view-mode-hook (lambda ()
  ;;                                 ;; (add-to-list 'pdf-annot-default-markup-annotation-properties '(color . "#ff0000"))
  ;;                                 (pdf-view-midnight-minor-mode))) ; automatically turns on midnight-mode for pdfs
  ;; (add-hook 'pdf-annot-minor-mode-hook
  ;;           (lambda ()
  ;;             (add-to-list 'pdf-annot-default-markup-annotation-properties
  ;;                         '(color . "#ff0000")))) ; automatically turns on midnight-mode for pdfs
  ;; This automatically sets pdf-tools to display using the midnight mode amber filter.
  ;; You can return to the original/no-filter with "!" (i.e. S-1); set
  ;; amber filter with "@" (i.e. S-2); set green filter with "#"
  ;; (i.e. S-3); set the bluish original midnight mode colours with "$"
  ;; (i.e. S-4).
  ;; (add-hook 'pdf-view-mode-hook 'bms/pdf-midnite-colour-schemes)
  ;; more fine-grained zooming
  (setq pdf-view-resize-factor 1.1)
  ;; For scanned pdfs, 'pdf-view-auto-slice-minor-mode can be useful
  ;; to turn on. You might bind it to something like s a. It auto
  ;; trims the borders for each page of the pdf as it encounters them.
  ;; keyboard shortcuts
  (define-key pdf-view-mode-map (kbd "h") 'pdf-annot-add-highlight-markup-annotation)
  (define-key pdf-view-mode-map (kbd "t") 'pdf-annot-add-text-annotation)
  (define-key pdf-view-mode-map (kbd "D") 'pdf-annot-delete)
  )

(defhydra hydra-pdftools (:color blue :hint nil)
        "
                                                                      ╭───────────┐
