prelude/personal/custom/config.el
       Move  History   Scale/Fit     Annotations  Search/Link    Do   │ PDF Tools │
   ╭──────────────────────────────────────────────────────────────────┴───────────╯
         ^^_g_^^      _B_    ^↧^    _+_    ^ ^     [_al_] list    [_s_] search    [_u_] revert buffer
         ^^^↑^^^      ^↑^    _H_    ^↑^  ↦ _W_ ↤   [_am_] markup  [_o_] outline   [_i_] info
         ^^_p_^^      ^ ^    ^↥^    _0_    ^ ^     [_at_] text    [_F_] link      [_d_] dark mode
         ^^^↑^^^      ^↓^  ╭─^─^─┐  ^↓^  ╭─^ ^─┐   [_ad_] delete  [_f_] search link
    _h_ ←pag_e_→ _l_  _N_  │ _P_ │  _-_    _b_     [_aa_] dired
         ^^^↓^^^      ^ ^  ╰─^─^─╯  ^ ^  ╰─^ ^─╯   [_y_]  yank
         ^^_n_^^      ^ ^  _r_eset slice box
         ^^^↓^^^
         ^^_G_^^
   --------------------------------------------------------------------------------
        "
        ("\\" hydra-master/body "back")
        ("<ESC>" nil "quit")
        ("al" pdf-annot-list-annotations)
        ("ad" pdf-annot-delete)
        ("aa" pdf-annot-attachment-dired)
        ("am" pdf-annot-add-markup-annotation)
        ("at" pdf-annot-add-text-annotation)
        ("y"  pdf-view-kill-ring-save)
        ("+" pdf-view-enlarge :color red)
        ("-" pdf-view-shrink :color red)
        ("0" pdf-view-scale-reset)
        ("H" pdf-view-fit-height-to-window)
        ("W" pdf-view-fit-width-to-window)
        ("P" pdf-view-fit-page-to-window)
        ("n" pdf-view-next-page-command :color red)
        ("p" pdf-view-previous-page-command :color red)
        ("d" pdf-view-dark-minor-mode)
        ("b" pdf-view-set-slice-from-bounding-box)
        ("r" pdf-view-reset-slice)
        ("g" pdf-view-first-page)
        ("G" pdf-view-last-page)
        ("e" pdf-view-goto-page)
        ("o" pdf-outline)
        ("s" pdf-occur)
        ("i" pdf-misc-display-metadata)
        ("u" pdf-view-revert-buffer)
        ("F" pdf-links-action-perfom)
        ("f" pdf-links-isearch-link)
        ("B" pdf-history-backward :color red)
        ("N" pdf-history-forward :color red)
        ("l" image-forward-hscroll :color red)
        ("h" image-backward-hscroll :color red))

(setq-default pdf-view-display-size 'fit-page)
(define-key pdf-view-mode-map "\\" 'hydra-pdftools/body)
(define-key pdf-view-mode-map "<s-spc>" 'pdf-view-scroll-down-or-next-page)
(define-key pdf-view-mode-map "g"  'pdf-view-first-page)
(define-key pdf-view-mode-map "G"  'pdf-view-last-page)
(define-key pdf-view-mode-map "l"  'image-forward-hscroll)
(define-key pdf-view-mode-map "h"  'image-backward-hscroll)
(define-key pdf-view-mode-map "j"  'pdf-view-next-page)
(define-key pdf-view-mode-map "k"  'pdf-view-previous-page)
(define-key pdf-view-mode-map "e"  'pdf-view-goto-page)
(define-key pdf-view-mode-map "u"  'pdf-view-revert-buffer)
(define-key pdf-view-mode-map "al" 'pdf-annot-list-annotations)
(define-key pdf-view-mode-map "ad" 'pdf-annot-delete)
(define-key pdf-view-mode-map "aa" 'pdf-annot-attachment-dired)
(define-key pdf-view-mode-map "am" 'pdf-annot-add-markup-annotation)
(define-key pdf-view-mode-map "at" 'pdf-annot-add-text-annotation)
(define-key pdf-view-mode-map "y"  'pdf-view-kill-ring-save)
(define-key pdf-view-mode-map "i"  'pdf-misc-display-metadata)
(define-key pdf-view-mode-map "s"  'pdf-occur)
(define-key pdf-view-mode-map "b"  'pdf-view-set-slice-from-bounding-box)
(define-key pdf-view-mode-map "r"  'pdf-view-reset-slice)

(use-package pdf-view-restore
  :straight t
  :after pdf-tools
  :config
  (setq pdf-view-restore-filename "~/.emacs.d/.pdf-view-restore")
  (add-hook 'pdf-view-mode-hook 'pdf-view-restore-mode)
)

(use-package pdfgrep
  :straight t
)

(use-package bang
  :straight t
  :bind ("M-!" . bang))

(use-package epg
  :straight t
  :config
  (defun epg--list-keys-1 (context name mode)
    (let ((args (append (if (epg-context-home-directory context)
                            (list "--homedir"
                                  (epg-context-home-directory context)))
                        '("--with-colons" "--no-greeting" "--batch"
                          "--with-fingerprint" "--with-fingerprint")
                        (unless (eq (epg-context-protocol context) 'CMS)
                          '("--fixed-list-mode"))))
          (list-keys-option (if (memq mode '(t secret))
                                "--list-secret-keys"
                              (if (memq mode '(nil public))
                                  "--list-keys"
                                "--list-sigs")))
          (coding-system-for-read 'binary)
          keys string field index)
      (if name
          (progn
            (unless (listp name)
              (setq name (list name)))
            (while name
              (setq args (append args (list list-keys-option (car name)))
                    name (cdr name))))
        (setq args (append args (list list-keys-option))))
      (with-temp-buffer
        (apply #'call-process
               (epg-context-program context)
               nil (list t nil) nil args)
        (goto-char (point-min))
        (while (re-search-forward "^[a-z][a-z][a-z]:.*" nil t)
          (setq keys (cons (make-vector 15 nil) keys)
                string (match-string 0)
                index 0
                field 0)
          (while (and (< field (length (car keys)))
                      (eq index
                          (string-match "\\([^:]+\\)?:" string index)))
            (setq index (match-end 0))
            (aset (car keys) field (match-string 1 string))
            (setq field (1+ field))))
        (nreverse keys))))
)

(use-package helm
  :straight t
  :init
  (progn
