emacs.d/personal/custom/config.org
** helm-swoop
   :PROPERTIES:
   :ID:       24ff8502-66ff-4f0a-938f-d03fbc9acc22
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package helm-swoop
    :straight t
    :bind (("M-i" . helm-swoop)
           ("M-I" . helm-swoop-back-to-last-point)
           ("C-c M-i" . helm-multi-swoop)
           ("C-x M-i" . helm-multi-swoop-all)
           :map isearch-mode-map
           ("M-i" . helm-swoop-from-isearch)
           :map helm-swoop-map
           ("M-i" . helm-multi-swoop-all-from-helm-swoop)
           )
    :config
        ;; Save buffer when helm-multi-swoop-edit complete
        (setq helm-multi-swoop-edit-save t)

        ;; If this value is t, split window inside the current window
        (setq helm-swoop-split-with-multiple-windows nil)

        ;; Split direcion. 'split-window-vertically or 'split-window-horizontally
        (setq helm-swoop-split-direction 'split-window-vertically)

        ;; If nil, you can slightly boost invoke speed in exchange for text color
        (setq helm-swoop-speed-or-color t)

        ;; Go to the opposite side of line from the end or beginning of line
        (setq helm-swoop-move-to-line-cycle t)

        ;; Optional face for line numbers
        ;; Face name is `helm-swoop-line-number-face`
        (setq helm-swoop-use-line-number-face t)
  )
#+END_SRC
** helm-themes
   :PROPERTIES:
   :ID:       694e075b-53b3-4f98-9762-29d2aa503869
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package helm-themes
    :straight t
  )
#+END_SRC
** helm-describe-modes
   :PROPERTIES:
   :ID:       dda1e65b-d0f4-4576-82cd-10215de77e22
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package helm-describe-modes
    :straight t
    :config
    (global-set-key [remap describe-mode] #'helm-describe-modes)
  )
#+END_SRC
** helm-proc
   :PROPERTIES:
   :ID:       061ee0f8-b3aa-4217-8a4a-d6eab3ebc259
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package helm-proc
    :straight t
  )
#+END_SRC
** helm-tramp
   :PROPERTIES:
   :ID:       8bc871f7-60f0-4919-96fb-da30ea8f1e24
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package helm-tramp
    :straight t
  )
#+END_SRC
** helm-pydoc
   :PROPERTIES:
   :ID:       68e1aeea-b221-445c-a98f-332fecebc6c8
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package helm-pydoc
    :straight t
  )
#+END_SRC
** mu-helm-rg
   :PROPERTIES:
   :ID:       90c6076f-332d-4d78-9509-45c624e81a9d
   :END:
https://www.manueluberti.eu/emacs/2020/02/22/ripgrepping-with-helm/
One can also use helm-do-grep-ag
#+BEGIN_SRC emacs-lisp
  (setq helm-grep-ag-command (concat "rg"
                                     " --color=never"
                                     " --smart-case"
                                     " --no-heading"
                                     " --line-number %s %s %s")
        helm-grep-file-path-style 'relative)
  (defun mu-helm-rg (directory &optional with-types)
    "Search in DIRECTORY with RG.
  With WITH-TYPES, ask for file types to search in."
    (interactive "P")
    (require 'helm-adaptive)
    (helm-grep-ag-1 (expand-file-name directory)
                    (helm-aif (and with-types
                                   (helm-grep-ag-get-types))
                        (helm-comp-read
                         "RG type: " it
                         :must-match t
                         :marked-candidates t
                         :fc-transformer 'helm-adaptive-sort
                         :buffer "*helm rg types*"))))
  (defun mu--project-root ()
    "Return the project root directory or `helm-current-directory'."
    (require 'helm-ls-git)
    (if-let (dir (helm-ls-git-root-dir))
        dir
      (helm-current-directory)))
  (defun mu-helm-project-search (&optional with-types)
    "Search in current project with RG.
  With WITH-TYPES, ask for file types to search in."
    (interactive "P")
    (mu-helm-rg (mu--project-root) with-types))

  (defun mu-helm-file-search (&optional with-types)
    "Search in `default-directory' with RG.
  With WITH-TYPES, ask for file types to search in."
    (interactive "P")
    (mu-helm-rg default-directory with-types))
#+END_SRC
** helm-recoll
   :PROPERTIES:
   :ID:       c4f48e17-64a9-4a2c-9d45-d9a673597cc2
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package helm-recoll)
#+END_SRC
* epg Let emacs query for gpg passwords
  :PROPERTIES:
  :ID:       6e1c784d-012c-4c85-a6c3-efcf4f96ffdb
  :END:
#+BEGIN_SRC emacs-lisp
  (setf epg-pinentry-mode 'loopback)
  (defun pinentry-emacs (desc prompt ok error)
    (let ((str (read-passwd
                (concat (replace-regexp-in-string "%22" "\""
                                                  (replace-regexp-in-string "%0A" "\n" desc)) prompt ": "))))
      str))
#+END_SRC
