emacs.d/personal/custom/config.org
* telephone-line
  :PROPERTIES:
  :ID:       1fd4aca5-d623-49d5-9be4-54c0e96e5daf
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package telephone-line)
  (defun ambrevar/bottom-right-window-p ()
    "Determines whether the last (i.e. bottom-right) window of the
    active frame is showing the buffer in which this function is
    executed."
    (let* ((frame (selected-frame))
           (right-windows (window-at-side-list frame 'right))
           (bottom-windows (window-at-side-list frame 'bottom))
           (last-window (car (seq-intersection right-windows bottom-windows))))
      (eq (current-buffer) (window-buffer last-window))))

  (defun jw/telephone-misc-if-exwm-or-last-window ()
    "Renders the mode-line-misc-info string for display in the
    mode-line if the currently active window is the last one in the
    frame, or an exwm window.

    The idea is to not display information like the current time,
    load, battery levels on all buffers.
    And to display input mode only in exwm windows."

    (when (or (ambrevar/bottom-right-window-p)
              exwm-window-type)
      (telephone-line-raw mode-line-misc-info t)))

  (defun jw/input-mode-str ()
    "Return string representing input mode, if window is of type EXWM"
    (if exwm-window-type
        (if (eq exwm--input-mode 'line-mode)
          (format "l")
          (format "c"))
      (format "")))

  (defun jw/workspace-index ()
    "Return string representing current EXWM workspace index"
    (if (ambrevar/bottom-right-window-p)
      (format "[%s]" (exwm-workspace--position (selected-frame)))
      (format "")))

  (defun jw/format-workspace-index-and-input-mode ()
    "Return string [workspace_index]input-mode depending on exwm-window or bottom-right window"
    (format "%s%s" (jw/workspace-index) (jw/input-mode-str)))

  (defun ambrevar/telephone-line-setup ()
    (telephone-line-defsegment telephone-line-last-window-segment ()
      (jw/telephone-misc-if-exwm-or-last-window))

    ;; Display the current EXWM workspace index in the mode-line
    (telephone-line-defsegment telephone-line-exwm-workspace-index ()
      (jw/format-workspace-index-and-input-mode))

    ;; Define a highlight font for ~ important ~ information in the last
    ;; window.
    (defface special-highlight '((t (:foreground "white" :background "#5f627f"))) "")
    (add-to-list 'telephone-line-faces
                 '(highlight . (special-highlight . special-highlight)))

    (setq telephone-line-lhs
          '((nil . (telephone-line-position-segment))
            (accent . (telephone-line-buffer-segment))))

    (setq telephone-line-rhs
          '((accent . (telephone-line-major-mode-segment))
            (nil . (telephone-line-last-window-segment
                    telephone-line-exwm-workspace-index))))

    (setq telephone-line-primary-left-separator 'telephone-line-tan-left
          telephone-line-primary-right-separator 'telephone-line-tan-right
          telephone-line-secondary-left-separator 'telephone-line-tan-hollow-left
          telephone-line-secondary-right-separator 'telephone-line-tan-hollow-right)

    (telephone-line-mode 1))

  (ambrevar/telephone-line-setup)
#+END_SRC
* helm-exwm
  :PROPERTIES:
  :ID:       941ba943-b27f-47dd-b0fd-1fa655b3928a
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package helm-exwm
    :straight t
    :config
    (setq helm-exwm-emacs-buffers-source (helm-exwm-build-emacs-buffers-source))
    (setq helm-exwm-source (helm-exwm-build-source))
    (setq helm-mini-default-sources `(helm-exwm-emacs-buffers-source
                                      helm-exwm-source
                                      helm-source-recentf)))
#+END_SRC
* helpful
  :PROPERTIES:
  :ID:       721bd336-078f-4914-b46f-c3f718542df5
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package helpful
    :straight t
    :config
    ;; Note that the built-in `describe-function' includes both functions
    ;; and macros. `helpful-function' is functions only, so we provide
    ;; `helpful-callable' as a drop-in replacement.
    (global-set-key (kbd "C-h f") #'helpful-callable)

    (global-set-key (kbd "C-h v") #'helpful-variable)
    (global-set-key (kbd "C-h k") #'helpful-key)

    ;; Lookup the current symbol at point. C-c C-d is a common keybinding
    ;; for this in lisp modes.
    (global-set-key (kbd "C-c C-d") #'helpful-at-point)

    ;; Look up *F*unctions (excludes macros).
    ;;
    ;; By default, C-h F is bound to `Info-goto-emacs-command-node'. Helpful
    ;; already links to the manual, if a function is referenced there.
    (global-set-key (kbd "C-h F") #'helpful-function)

    ;; Look up *C*ommands.
    ;;
    ;; By default, C-h C is bound to describe `describe-coding-system'. I
    ;; don't find this very useful, but it's frequently useful to only
    ;; look at interactive functions.
    (global-set-key (kbd "C-h C") #'helpful-command)
  )
#+END_SRC
* cmake
  :PROPERTIES:
  :ID:       14e9e239-d4d5-439e-b89e-4e68c2ca1567
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package cmake-mode)
  ;; Add cmake listfile names to the mode list.
  (setq auto-mode-alist
      (append
       '(("CMakeLists\\.txt\\'" . cmake-mode))
       '(("\\.cmake\\'" . cmake-mode))
       auto-mode-alist))
(autoload 'cmake-font-lock-activate "cmake-font-lock" nil t)
(add-hook 'cmake-mode-hook 'cmake-font-lock-activate)
#+END_SRC
* helm-perldoc
  :PROPERTIES:
  :ID:       ac9fa457-587a-477c-8588-4d9737d21957
  :END:
#+BEGIN_SRC emacs-lisp
;; helm-perldoc:setup takes long time on low power platform
(eval-after-load "cperl-mode"
  '(progn
    (helm-perldoc:setup)))

;; auto carton setup
;; (add-hook 'cperl-mode-hook 'helm-perldoc:carton-setup)
#+END_SRC
* colorize-compilation
  :PROPERTIES:
  :ID:       32bfef90-d999-408a-a612-584999720b6f
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package ansi-color
   :straight nil)
  (defun endless/colorize-compilation ()
    "Colorize from `compilation-filter-start' to `point'."
    (let ((inhibit-read-only t))
      (ansi-color-apply-on-region
       compilation-filter-start (point))))

  (add-hook 'compilation-filter-hook
            #'endless/colorize-compilation)
#+END_SRC
* gdb
  :PROPERTIES:
  :ID:       a33e3419-3e7c-4538-80e8-623999f5edfd
  :END:
#+BEGIN_SRC emacs-lisp
(setq
 ;; use gdb-many-windows by default
 gdb-many-windows t

 ;; Non-nil means display source file containing the main routine at startup
 gdb-show-main t
 )
#+END_SRC
* imenu
  :PROPERTIES:
  :ID:       69fa554d-9679-4744-83e3-42da1da5ed66
  :END:
#+BEGIN_SRC emacs-lisp
(use-package imenu
  :bind (("C-§" . helm-imenu)
         ("M-§" . helm-imenu)
         )
  )
#+END_SRC
* guide-key
  :PROPERTIES:
  :ID:       774bb40f-5a4f-4575-8961-db09fbca7c8c
  :END:
#+BEGIN_SRC emacs-lisp
  ;; (use-package guide-key
  ;;   :config
  ;;   (setq guide-key/guide-key-sequence '("C-x r" "C-x 4" "C-c"))
  ;;   (setq guide-key/recursive-key-sequence-flag t)
  ;;   (setq guide-key/idle-delay 0.7)
  ;;   (guide-key-mode 1)  ; Enable guide-key-mode
  ;;   )
#+END_SRC
* pop-to-mark
  :PROPERTIES:
  :ID:       fd9a4449-43b4-4a93-807b-1400398d97d0
  :END:
When popping the mark, continue popping until the cursor actually moves
#+BEGIN_SRC emacs-lisp
(defadvice pop-to-mark-command (around ensure-new-position activate)
  (let ((p (point)))
    (dotimes (i 10)
      (when (= p (point)) ad-do-it))))

(setq set-mark-command-repeat-pop t)
#+END_SRC
* paperless
  :PROPERTIES:
  :ID:       ab38c97a-6dd1-4353-ba88-317dabd3bc03
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package paperless
    :straight t
    :config
    (custom-set-variables
     '(paperless-capture-directory "/home/jw/Dokument/Scan")
     '(paperless-root-directory "/home/jw/Dokument"))
  )
#+END_SRC
* eterm-256color
  :PROPERTIES:
  :ID:       3451d597-3789-40b0-a3e7-370a953d1627
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package eterm-256color
    :straight t
    :config
    (add-hook 'term-mode-hook #'eterm-256color-mode)
  )
#+END_SRC
