prelude/personal/custom/config.el

(use-package telephone-line)
(defun ambrevar/bottom-right-window-p ()
  "Determines whether the last (i.e. bottom-right) window of the
  active frame is showing the buffer in which this function is
  executed."
  (let* ((frame (selected-frame))
         (right-windows (window-at-side-list frame 'right))
         (bottom-windows (window-at-side-list frame 'bottom))
         (last-window (car (seq-intersection right-windows bottom-windows))))
    (eq (current-buffer) (window-buffer last-window))))

(defun jw/telephone-misc-if-exwm-or-last-window ()
  "Renders the mode-line-misc-info string for display in the
  mode-line if the currently active window is the last one in the
  frame, or an exwm window.

  The idea is to not display information like the current time,
  load, battery levels on all buffers.
  And to display input mode only in exwm windows."

  (when (or (ambrevar/bottom-right-window-p)
            exwm-window-type)
    (telephone-line-raw mode-line-misc-info t)))

(defun jw/input-mode-str ()
  "Return string representing input mode, if window is of type EXWM"
  (if exwm-window-type
      (if (eq exwm--input-mode 'line-mode)
        (format "l")
        (format "c"))
    (format "")))

(defun jw/workspace-index ()
  "Return string representing current EXWM workspace index"
  (if (ambrevar/bottom-right-window-p)
    (format "[%s]" (exwm-workspace--position (selected-frame)))
    (format "")))

(defun jw/format-workspace-index-and-input-mode ()
  "Return string [workspace_index]input-mode depending on exwm-window or bottom-right window"
  (format "%s%s" (jw/workspace-index) (jw/input-mode-str)))

(defun ambrevar/telephone-line-setup ()
  (telephone-line-defsegment telephone-line-last-window-segment ()
    (jw/telephone-misc-if-exwm-or-last-window))

  ;; Display the current EXWM workspace index in the mode-line
  (telephone-line-defsegment telephone-line-exwm-workspace-index ()
    (jw/format-workspace-index-and-input-mode))

  ;; Define a highlight font for ~ important ~ information in the last
  ;; window.
  (defface special-highlight '((t (:foreground "white" :background "#5f627f"))) "")
  (add-to-list 'telephone-line-faces
               '(highlight . (special-highlight . special-highlight)))

  (setq telephone-line-lhs
        '((nil . (telephone-line-position-segment))
          (accent . (telephone-line-buffer-segment))))

  (setq telephone-line-rhs
        '((accent . (telephone-line-major-mode-segment))
          (nil . (telephone-line-last-window-segment
                  telephone-line-exwm-workspace-index))))

  (setq telephone-line-primary-left-separator 'telephone-line-tan-left
        telephone-line-primary-right-separator 'telephone-line-tan-right
        telephone-line-secondary-left-separator 'telephone-line-tan-hollow-left
        telephone-line-secondary-right-separator 'telephone-line-tan-hollow-right)

  (telephone-line-mode 1))

(ambrevar/telephone-line-setup)

(use-package helm-exwm
  :straight t
  :config
  (setq helm-exwm-emacs-buffers-source (helm-exwm-build-emacs-buffers-source))
  (setq helm-exwm-source (helm-exwm-build-source))
  (setq helm-mini-default-sources `(helm-exwm-emacs-buffers-source
                                    helm-exwm-source
                                    helm-source-recentf)))

(use-package helpful
  :straight t
  :config
  ;; Note that the built-in `describe-function' includes both functions
  ;; and macros. `helpful-function' is functions only, so we provide
  ;; `helpful-callable' as a drop-in replacement.
  (global-set-key (kbd "C-h f") #'helpful-callable)

  (global-set-key (kbd "C-h v") #'helpful-variable)
  (global-set-key (kbd "C-h k") #'helpful-key)

  ;; Lookup the current symbol at point. C-c C-d is a common keybinding
  ;; for this in lisp modes.
  (global-set-key (kbd "C-c C-d") #'helpful-at-point)

  ;; Look up *F*unctions (excludes macros).
  ;;
  ;; By default, C-h F is bound to `Info-goto-emacs-command-node'. Helpful
  ;; already links to the manual, if a function is referenced there.
  (global-set-key (kbd "C-h F") #'helpful-function)

  ;; Look up *C*ommands.
  ;;
  ;; By default, C-h C is bound to describe `describe-coding-system'. I
  ;; don't find this very useful, but it's frequently useful to only
  ;; look at interactive functions.
  (global-set-key (kbd "C-h C") #'helpful-command)
)

(use-package cmake-mode)
  ;; Add cmake listfile names to the mode list.
  (setq auto-mode-alist
      (append
       '(("CMakeLists\\.txt\\'" . cmake-mode))
       '(("\\.cmake\\'" . cmake-mode))
       auto-mode-alist))
(autoload 'cmake-font-lock-activate "cmake-font-lock" nil t)
(add-hook 'cmake-mode-hook 'cmake-font-lock-activate)

;; helm-perldoc:setup takes long time on low power platform
(eval-after-load "cperl-mode"
  '(progn
    (helm-perldoc:setup)))

;; auto carton setup
;; (add-hook 'cperl-mode-hook 'helm-perldoc:carton-setup)

(use-package ansi-color
 :straight nil)
(defun endless/colorize-compilation ()
  "Colorize from `compilation-filter-start' to `point'."
  (let ((inhibit-read-only t))
    (ansi-color-apply-on-region
     compilation-filter-start (point))))

(add-hook 'compilation-filter-hook
          #'endless/colorize-compilation)

(setq
 ;; use gdb-many-windows by default
 gdb-many-windows t

 ;; Non-nil means display source file containing the main routine at startup
 gdb-show-main t
 )

(use-package imenu
  :bind (("C-§" . helm-imenu)
         ("M-§" . helm-imenu)
         )
  )

;; (use-package guide-key
;;   :config
;;   (setq guide-key/guide-key-sequence '("C-x r" "C-x 4" "C-c"))
;;   (setq guide-key/recursive-key-sequence-flag t)
;;   (setq guide-key/idle-delay 0.7)
;;   (guide-key-mode 1)  ; Enable guide-key-mode
;;   )

(defadvice pop-to-mark-command (around ensure-new-position activate)
  (let ((p (point)))
    (dotimes (i 10)
      (when (= p (point)) ad-do-it))))

(setq set-mark-command-repeat-pop t)

(use-package paperless
  :straight t
  :config
  (custom-set-variables
   '(paperless-capture-directory "/home/jw/Dokument/Scan")
   '(paperless-root-directory "/home/jw/Dokument"))
)

(use-package eterm-256color
  :straight t
  :config
  (add-hook 'term-mode-hook #'eterm-256color-mode)
)
