emacs.d/personal/custom/config.org
* org-ref-ox-hugo
  :PROPERTIES:
  :ID:       f19c0f2e-36db-4c17-b707-000da6002565
  :END:
#+BEGIN_SRC emacs-lisp
  (setq bibtex-completion-bibliography "~/org/roam/biblio/references.bib"
        bibtex-completion-library-path "~/org/roam/pdfs"
        bibtex-completion-notes-path "~/org/roam/biblio/helm-bibtex-notes")
  (setq bibtex-completion-pdf-open-function 'org-open-file)

  (setq reftex-default-bibliography '("~/org/roam/biblio/references.bib"))

  ;; see org-ref for use of these variables
  (setq org-ref-bibliography-notes "~/org/roam/bibli/notes.org"
        org-ref-default-bibliography '("~/org/roam/biblio/references.bib")
        org-ref-pdf-directory "~/org/roam/pdfs/")

  (use-package ox
   :straight nil)

  (use-package ox-hugo
    :straight t
    :after ox)

  (use-package org-ref)

  (use-package org-ref-ox-hugo
    :after (org org-ref ox-hugo)
    :straight (:host github
               :repo "jethrokuan/org-ref-ox-hugo"
               :files ("*.el"))
    :config
    (add-to-list 'org-ref-formatted-citation-formats
                 '("md"
                   ("article" . "${author}, *${title}*, ${journal}, *${volume}(${number})*, ${pages} (${year}). ${doi}")
                   ("inproceedings" . "${author}, *${title}*, In ${editor}, ${booktitle} (pp. ${pages}) (${year}). ${address}: ${publisher}.")
                   ("book" . "${author}, *${title}* (${year}), ${address}: ${publisher}.")
                   ("phdthesis" . "${author}, *${title}* (Doctoral dissertation) (${year}). ${school}, ${address}.")
                   ("inbook" . "${author}, *${title}*, In ${editor} (Eds.), ${booktitle} (pp. ${pages}) (${year}). ${address}: ${publisher}.")
                   ("incollection" . "${author}, *${title}*, In ${editor} (Eds.), ${booktitle} (pp. ${pages}) (${year}). ${address}: ${publisher}.")
                   ("proceedings" . "${editor} (Eds.), _${booktitle}_ (${year}). ${address}: ${publisher}.")
                   ("unpublished" . "${author}, *${title}* (${year}). Unpublished manuscript.")
                   ("misc" . "${author} (${year}). *${title}*. Retrieved from [${howpublished}](${howpublished}). ${note}.")
                   (nil . "${author}, *${title}* (${year})."))))
#+END_SRC
* org-roam
  :PROPERTIES:
  :ID:       405ea462-0f71-4c14-a1af-3d7b84361421
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package org-noter
    :straight t
    :config
    (setq org-noter-always-create-frame nil
          org-noter-notes-search-path '("~/org/roam/org-noter")))
  (use-package org-roam-bibtex
    :straight t
    :hook (org-roam-mode . org-roam-bibtex-mode))
  (use-package org-roam
    :straight t
    :after (org ox-hugo)
    :commands (org-roam-insert org-roam-find-file org-roam-switch-to-buffer org-roam)
    :hook
    (after-init . org-roam-mode)
    :custom-face
    (org-roam-link ((t (:inherit org-link :foreground "#A08000"))))
    :init
    (setq org-roam-directory "~/org/roam/"
          org-roam-db-location "~/org/roam/org-roam.db"
          org-roam-graph-exclude-matcher "private")
    (setq org-roam-directory "~/org/roam/")
    :bind (:map org-roam-mode-map
                (("C-c n l" . org-roam)
                 ("C-c n f" . org-roam-find-file)
                 ("C-c n b" . org-roam-switch-to-buffer)
                 ("C-c n c" . org-roam-capture)
                 ("C-c n g" . org-roam-show-graph))
           :map org-mode-map
           (("C-c n i" . org-roam-insert)))
    :config
    (require 'org-roam-protocol)
    (setq org-roam-capture-templates
          '(("d" "default" plain (function org-roam--capture-get-point)
             "%?"
             :file-name "${slug}"
             :head "#+SETUPFILE:~/org/roam/hugo_setup.org
  ,#+HUGO_SECTION: zettels
  ,#+HUGO_SLUG: ${slug}
  ,#+TITLE: ${title}\n"
             :unnarrowed t)
            ("p" "private" plain (function org-roam-capture--get-point)
             "%?"
             :file-name "private-${slug}"
             :head "#+TITLE: ${title}\n"
             :unnarrowed t)))
    (setq org-roam-ref-capture-templates
          '(("r" "ref" plain (function org-roam-capture--get-point)
             "%?"
             :file-name "websites/${slug}"
             :head "#+SETUPFILE:~/org/roam/hugo_setup.org
  ,#+ROAM_KEY: ${ref}
  ,#+HUGO_SLUG: ${slug}
  ,#+TITLE: ${title}

  - source :: ${ref}"
             :unnarrowed t)))
    (defun my/org-roam--backlinks-list (file)
      (if (org-roam--org-roam-file-p file)
          (--reduce-from
           (concat acc (format "- [[file:%s][%s]]\n"
                               (file-relative-name (car it) org-roam-directory)
                               (org-roam--get-title-or-slug (car it))))
           "" (org-roam-db-query [:select [from]
                                     :from links
                                     :where (= to $s1)
                                     :and from :not :like $s2] file "%private%"))
        ""))
    (defun my/org-export-preprocessor (_backend)
      (let ((links (my/org-roam--backlinks-list (buffer-file-name))))
        (unless (string= links "")
          (save-excursion
            (goto-char (point-max))
            (insert (concat "\n* Backlinks\n" links))))))
    (add-hook 'org-export-before-processing-hook 'my/org-export-preprocessor)
    (defun jethro/conditional-hugo-enable ()
      (save-excursion
        (if (cdr (assoc "SETUPFILE" (org-roam--extract-global-props '("SETUPFILE"))))
            (org-hugo-auto-export-mode +1)
          (org-hugo-auto-export-mode -1))))
    (add-hook 'org-mode-hook #'jethro/conditional-hugo-enable)
    (setq org-roam-completion-system 'helm))
#+END_SRC
* org-roam-server
  :PROPERTIES:
  :ID:       fef9e28c-3eb9-4d28-b1a3-9d8ed6253db1
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package org-roam-server
    :straight t
  )
#+END_SRC
* deft
  :PROPERTIES:
  :ID:       5103596e-ea7f-46a5-8a92-a77000755126
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package el-patch
    :straight t
  )
  (eval-when-compile
    (require 'el-patch))
  (use-package deft
    :after org
    :straight t
    :bind
    ("C-c n d" . deft)
    :custom
    (deft-recursive t)
    (deft-use-filter-string-for-filename t)
    (deft-default-extension "org")
    (deft-directory "~/org/roam/")
    :config/el-patch
    (defun deft-parse-title (file contents)
      "Parse the given FILE and CONTENTS and determine the title.
  If `deft-use-filename-as-title' is nil, the title is taken to
  be the first non-empty line of the FILE.  Else the base name of the FILE is
  used as title."
      (el-patch-swap (if deft-use-filename-as-title
                         (deft-base-filename file)
                       (let ((begin (string-match "^.+$" contents)))
                         (if begin
                             (funcall deft-parse-title-function
                                      (substring contents begin (match-end 0))))))
                     (org-roam--get-title-or-slug file))))
#+END_SRC
* eyebrowse
  :PROPERTIES:
  :ID:       d2ac4370-b8ef-4b23-a884-5d34cbe5a2a1
  :END:
Non persistent workspaces creation and switching
#+BEGIN_SRC emacs-lisp
  (use-package eyebrowse
    :straight t
    :config
    (setq eyebrowse-mode-line-separator " "
          eyebrowse-new-workspace t)
    (eyebrowse-mode t))
#+END_SRC
* perspective
  :PROPERTIES:
  :ID:       0423c465-c66e-4e76-b3f1-4228fb76375b
  :END:
Persistent workspaces creation and switching
#+BEGIN_SRC emacs-lisp
  (use-package perspective
    :straight t
    :config
    (persp-mode))
#+END_SRC
* emms
  :PROPERTIES:
  :ID:       05cbe54a-8624-47cf-a92d-0fb248fca5ff
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package emms)
  ;; (use-package emms-setup
  ;;  :straight nil
  ;;  :config
  ;;  (emms-standard)
  ;;  (emms-default-players)
  ;;  (setq emms-source-file-default-directory "/home/jw/realpolish/100-DPS--61-70/mp3/")
  ;; )

  (require 'emms-setup)
  (emms-standard)
  (emms-default-players)
  (setq emms-source-file-default-directory "/home/jw/realpolish/100-DPS--61-70/mp3/")
#+END_SRC
