emacs.d/personal/custom/config.org
* workgroups2
  :PROPERTIES:
  :ID:       12fdffe7-ca7a-4c84-95bd-8ac6da5ae989
  :END:
#+BEGIN_SRC emacs-lisp
  ;; (use-package workgroups2
  ;;   :ensure t
  ;;   :config
  ;;   (setq wg-prefix-key (kbd "C-c C-w"))
  ;;   (setq wg-session-file "~/.emacs.d/.emacs_workgroups")
  ;;   (workgroups-mode 1)
  ;;   )
#+END_SRC
* novel
  :PROPERTIES:
  :ID:       2626ba9e-bf6a-4a69-bc5c-c6427b7ac2ba
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package nov
    :straight t
    :bind
    (:map nov-mode-map
          ("<home>" . move-beginning-of-line)
          ("<end>" . move-end-of-line)
          ))
  (push '("\\.epub\\'" . nov-mode) auto-mode-alist)
#+END_SRC
* url
  :PROPERTIES:
  :ID:       3a4121bc-c8fa-48ec-9ab1-c9e7d39e8977
  :END:
#+BEGIN_SRC emacs-lisp
(require 'url)
#+END_SRC
** goto-addr
   :PROPERTIES:
   :ID:       a3bc7de3-5060-4dc1-b35c-711e6dc9b9cf
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package goto-addr
    :straight t
    :hook ((compilation-mode . goto-address-mode)
           (prog-mode . goto-address-prog-mode)
           (eshell-mode . goto-address-mode)
           (shell-mode . goto-address-mode))
    :bind (:map goto-address-highlight-keymap
                ("<RET>" . goto-address-at-point)
                ("M-<RET>" . newline))
    :commands (goto-address-prog-mode
               goto-address-mode))
#+END_SRC
* vterm
  :PROPERTIES:
  :ID:       a312adda-f8df-4690-8b40-622ec2ece4c2
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package vterm
    :straight t
  )
#+END_SRC
* calibredb
  :PROPERTIES:
  :ID:       634b1d0d-c108-4fd5-ac67-dd4837d17c91
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package calibredb
    :straight t
    :config
    (setq sql-sqlite-program "/usr/bin/sqlite3")
    (setq calibredb-root-dir (expand-file-name "~/calibre_library"))
    (setq calibredb-db-dir (concat calibredb-root-dir "/metadata.db"))
    (setq calibredb-program "/usr/bin/calibredb")
    (setq calibredb-library-alist '(("~/calibre_library")))
  )
#+END_SRC
* fish-completion
  :PROPERTIES:
  :ID:       eb00dfc5-0aeb-449c-afba-aa24e944da8e
  :END:
#+BEGIN_SRC emacs-lisp
(when (and (executable-find "fish")
           (require 'fish-completion nil t))
  (global-fish-completion-mode))
#+END_SRC
* conda
  :PROPERTIES:
  :ID:       19199730-b6ff-459d-ae56-4a38478440d6
  :END:
#+BEGIN_SRC emacs-lisp
  (custom-set-variables
   '(conda-anaconda-home "/home/jw/miniconda3/"))
  (use-package conda)

  (require 'conda)
  ;; if you want interactive shell support, include:
  (conda-env-initialize-interactive-shells)
  ;; if you want eshell support, include:
  (conda-env-initialize-eshell)
  ;; if you want auto-activation (see below for details), include:
  ;; (conda-env-autoactivate-mode t)
  (setq global-mode-string (append global-mode-string '(:exec conda-env-current-name)))
#+END_SRC
* Pyenv mode
  :PROPERTIES:
  :ID:       ba9fd1b6-f40f-47c1-b810-b45c81ac2297
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package pyenv-mode)
  (pyenv-mode)
#+END_SRC
* Anaconda mode
  :PROPERTIES:
  :ID:       8dab426d-722a-4d56-93af-77cd4ed0ce66
  :END:
#+BEGIN_SRC emacs-lisp
  (add-hook 'python-mode-hook 'anaconda-mode)
  (add-hook 'python-mode-hook 'anaconda-eldoc-mode)
#+END_SRC
* esh
  :PROPERTIES:
  :ID:       03641665-1dde-4122-9ae5-f6d9bd310b1f
  :END:
