prelude/personal/custom/config.el

;; (use-package workgroups2
;;   :ensure t
;;   :config
;;   (setq wg-prefix-key (kbd "C-c C-w"))
;;   (setq wg-session-file "~/.emacs.d/.emacs_workgroups")
;;   (workgroups-mode 1)
;;   )

(use-package nov
  :straight t
  :bind
  (:map nov-mode-map
        ("<home>" . move-beginning-of-line)
        ("<end>" . move-end-of-line)
        ))
(push '("\\.epub\\'" . nov-mode) auto-mode-alist)

(require 'url)

(use-package goto-addr
  :straight t
  :hook ((compilation-mode . goto-address-mode)
         (prog-mode . goto-address-prog-mode)
         (eshell-mode . goto-address-mode)
         (shell-mode . goto-address-mode))
  :bind (:map goto-address-highlight-keymap
              ("<RET>" . goto-address-at-point)
              ("M-<RET>" . newline))
  :commands (goto-address-prog-mode
             goto-address-mode))

(use-package vterm
  :straight t
)

(use-package calibredb
  :straight t
  :config
  (setq sql-sqlite-program "/usr/bin/sqlite3")
  (setq calibredb-root-dir (expand-file-name "~/calibre_library"))
  (setq calibredb-db-dir (concat calibredb-root-dir "/metadata.db"))
  (setq calibredb-program "/usr/bin/calibredb")
  (setq calibredb-library-alist '(("~/calibre_library")))
)

(when (and (executable-find "fish")
           (require 'fish-completion nil t))
  (global-fish-completion-mode))

(custom-set-variables
 '(conda-anaconda-home "/home/jw/miniconda3/"))
(use-package conda)

(require 'conda)
;; if you want interactive shell support, include:
(conda-env-initialize-interactive-shells)
;; if you want eshell support, include:
(conda-env-initialize-eshell)
;; if you want auto-activation (see below for details), include:
;; (conda-env-autoactivate-mode t)
(setq global-mode-string (append global-mode-string '(:exec conda-env-current-name)))

(use-package pyenv-mode)
(pyenv-mode)

(add-hook 'python-mode-hook 'anaconda-mode)
(add-hook 'python-mode-hook 'anaconda-eldoc-mode)
