emacs.d/personal/custom/config.org
** esh proper
   :PROPERTIES:
   :ID:       25ee6eba-65e1-415a-bc76-5ec949c31994
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package esh-mode
    :straight nil
    :init
    (setq eshell-scroll-to-bottom-on-input 'all
          eshell-error-if-no-glob t
          eshell-hist-ignoredups t
          eshell-save-history-on-exit t
          eshell-prefer-lisp-functions nil
          eshell-destroy-buffer-when-process-dies t)
    (add-hook 'eshell-mode-hook
              (lambda ()
                (add-to-list 'eshell-visual-commands "ssh")
                (add-to-list 'eshell-visual-commands "tail")))
    (add-hook 'eshell-mode-hook (lambda ()
      ;; The 'ls' executable requires the Gnu version on the Mac
      (let ((ls (if (file-exists-p "/usr/local/bin/gls")
                    "/usr/local/bin/gls"
                  "/bin/ls")))
        (eshell/alias "ll" (concat ls " -AlohG --color=always")))))
    :config
    ;; used by other functions below
    (declare-function ffap-file-at-point "ffap.el")

    (defun prot/eshell-insert-file-at-point ()
      "Insert (cat) contents of file at point."
      (interactive)
      (let ((file (ffap-file-at-point)))
        (if file
            (progn
              (end-of-buffer)
              (insert (concat "cat " file))
              (eshell-send-input))
          (user-error "No file at point"))))

    (defun prot/eshell-kill-save-file-at-point ()
      "Add to kill-ring the absolute path of file at point."
      (interactive)
      (let ((file (ffap-file-at-point)))
        (if file
            (kill-new (concat (eshell/pwd) "/" file))
          (user-error "No file at point"))))

    (defun prot/eshell-find-file-at-point ()
      "Run `find-file' for file at point (ordinary file or dir).
  Recall that this will produce a `dired' buffer if the file is a
  directory."
      (interactive)
      (let ((file (ffap-file-at-point)))
        (if file
            (find-file file)
          (user-error "No file at point"))))

    (defun prot/eshell-file-parent-dir ()
      "Open `dired' with the parent directory of file at point."
      (interactive)
      (let ((file (ffap-file-at-point)))
        (if file
            (dired (file-name-directory file))
          (user-error "No parent dir for file to jump to"))))

    (defun prot/eshell-mkcd (dir)         ; TODO define alias
      "Make a directory, or path, and switch to it."
      (interactive)
      (eshell/mkdir "-p" dir)
      (eshell/cd dir))

    (defun prot/eshell-put-last-output-to-buffer ()
      "Produce a buffer with output of last `eshell' command."
      (interactive)
      (let ((eshell-output (kill-region (eshell-beginning-of-output)
                                        (eshell-end-of-output))))
        (with-current-buffer (get-buffer-create  "*last-eshell-output*")
          (erase-buffer)
          (yank)           ; TODO do it with `insert' and `delete-region'?
          (switch-to-buffer-other-window (current-buffer)))))

    (defun prot/eshell-complete-redirect-to-buffer ()
      "Complete the syntax for appending to a buffer via `eshell'."
      (interactive)
      (insert
       (concat " >>> #<"
               (format "%s"
                       (read-buffer-to-switch "Switch to buffer: "))
               ">")))

    (defun prot/eshell-narrow-output-highlight-regexp ()
      (interactive)
      (let ((regexp (read-regexp "Regexp to highlight")))
        (narrow-to-region (eshell-beginning-of-output)
                          (eshell-end-of-output))
        (goto-char (point-min))
        (highlight-regexp regexp 'hi-yellow)))

    (defun pcomplete/eshell-mode/bmk ()
      "Completion for `bmk'"
      (pcomplete-here (bookmark-all-names)))

    (defun eshell/bmk (&rest args)
      "Integration between EShell and bookmarks.
  For usage, execute without arguments."
      (setq args (eshell-flatten-list args))
      (let ((bookmark (car args))
            filename name)
        (cond
         ((eq nil args)
          (format "Usage:
  - bmk BOOKMARK to
  -- either change directory pointed to by BOOKMARK
  -- or bookmark-jump to the BOOKMARK if it is not a directory.
  - bmk . BOOKMARK to bookmark current directory in BOOKMARK.
  Completion is available."))
         ((string= "." bookmark)
          ;; Store current path in EShell as a bookmark
          (if (setq name (car (cdr args)))
              (progn
                (bookmark-set name)
                (bookmark-set-filename name (eshell/pwd))
                (format "Saved current directory in bookmark %s" name))
            (error "You must enter a bookmark name")))
         (t
          ;; Check whether an existing bookmark has been specified
          (if (setq filename (bookmark-get-filename bookmark))
              ;; If it points to a directory, change to it.
              (if (file-directory-p filename)
                  (eshell/cd filename)
                ;; otherwise, just jump to the bookmark
                (bookmark-jump bookmark))
            (error "%s is not a bookmark" bookmark))))))

  (defun my-delete-window-on-eshell-exit ()
    (when (not (one-window-p))
      (delete-window)))

  (advice-add 'eshell-life-is-too-much :after 'my-delete-window-on-eshell-exit)

  :bind
    (:map eshell-mode-map
                ("M-k" . eshell-kill-input)
                ("C-c M-w" . prot/eshell-kill-save-file-at-point)
                ("C-c ä" . prot/eshell-insert-file-at-point)
                ("C-c f" . prot/eshell-find-file-at-point)
                ("C-c C-f" . prot/eshell-find-file-at-point)
                ("C-c ö" . prot/eshell-put-last-output-to-buffer)
                ("C-c C->" . prot/eshell-complete-redirect-to-buffer)
                ("C-c C-j" . prot/eshell-file-parent-dir)
                ("C-c h" . prot/eshell-narrow-output-highlight-regexp))
  )

  (use-package esh-module
    :straight nil
    :config
    (setq eshell-modules-list             ; Needs review
          '(eshell-alias
            eshell-basic
            eshell-cmpl
            eshell-dirs
            eshell-glob
            eshell-hist
            eshell-ls
            eshell-pred
            eshell-prompt
            eshell-script
            eshell-term
            eshell-tramp
            eshell-unix)))

  (use-package em-dirs
    :straight nil
    :after esh-mode
    :config
    (setq eshell-cd-on-directory t))

  (use-package em-tramp
    :straight nil
    :after esh-mode
    :config
    (setq password-cache t)
    (setq password-cache-expiry 600))

  (use-package em-hist
    :straight nil
    :after esh-mode
    :config
    (setq eshell-hist-ignoredups t)
    (setq eshell-save-history-on-exit t)

    (defun prot/eshell-complete-history ()
      "Insert element from `eshell' history using completion."
      (interactive)
      (let ((hist (ring-elements eshell-history-ring)))
        (insert
         (completing-read "Input history: " hist nil t))))

    (defun prot/eshell-complete-recent-dir (&optional arg)
      "Switch to a recent `eshell' directory using completion.
  With \\[universal-argument] also open the directory in a `dired'
  buffer."
      (interactive "P")
      (let* ((dirs (ring-elements eshell-last-dir-ring))
             (dir (completing-read "Switch to recent dir: " dirs nil t)))
        (insert dir)                      ; Not good enough
        (eshell-send-input)               ; Should cd directly…
        (when arg
          (dired dir))))

    ;; `cl-remove-if' is used right below
    (declare-function cl-remove-if "cl-seq")

    (defun prot/eshell-find-subdirectory-recursive ()
      "Recursive `eshell/cd' to subdirectory.
  This command has the potential for infinite recursion: use it
  wisely or prepare to use `eshell-interrupt-process'."
      (interactive)
      (let* ((dir (eshell/pwd))
             (contents (directory-files-recursively dir ".*" t nil nil))
             ;; (contents (directory-files dir t))
             (find-directories (mapcar (lambda (x)
                                         (when (file-directory-p x)
                                           (abbreviate-file-name x)))
                                       contents))
             (subdirs (delete nil find-directories))
             (cands (cl-remove-if (lambda (x) (string-match-p "\\.git" x)) subdirs))
             (selection (completing-read "Find sub-directory: " cands nil t)))
        (insert selection)
        (eshell-send-input)))

    :bind (:map eshell-mode-map ;;  eshell-hist-mode-map
                ("M-s" . nil) ; I use this for lots of more useful commands
                ("M-r" . prot/eshell-complete-history) ; use this to find input history
                ("C-c d" . prot/eshell-find-subdirectory-recursive)
                ("C-c =" . prot/eshell-complete-recent-dir)))
#+END_SRC
