emacs.d/personal/custom/config.org
** pop to eshell
   :PROPERTIES:
   :ID:       f864d8ca-fd43-4b70-81e8-0478783c34dd
   :END:
#+BEGIN_SRC emacs-lisp
  (defun eshell-here ()
    "Opens up a new shell in the directory associated with the
  current buffer's file. The eshell is renamed to match that
  directory to make multiple eshell windows easier."
    (interactive)
    (let* ((parent (if (buffer-file-name)
                       (file-name-directory (buffer-file-name))
                     default-directory))
           (height (/ (window-total-height) 3))
           (name   (car (last (split-string parent "/" t)))))
      (split-window-vertically (- height))
      (other-window 1)
      (eshell "new")
      (rename-buffer (concat "*eshell: " name "*"))

      (insert (concat "ls"))
      (eshell-send-input)))

  (global-set-key (kbd "C-!") 'eshell-here)
#+END_SRC
* desktop
  :PROPERTIES:
  :ID:       b72ada4e-7b5f-4c63-b04e-3a2feec8222c
  :END:
When saving emacs desktop, also save Helm find-file-history.
That way we also save dired paths.
#+BEGIN_SRC emacs-lisp
  (add-to-list 'desktop-globals-to-save 'helm-ff-history)
#+END_SRC
* google translate
  :PROPERTIES:
  :ID:       b01fb2f4-d133-4659-a4b2-c787dc8444bc
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package google-translate
    :straight t
    :config
    (setq google-translate-default-source-language "pl")
    (setq google-translate-default-target-language "en")
  )
#+END_SRC
* latex
  :PROPERTIES:
  :ID:       f712019a-91a4-4e43-b3a4-396f8fdc458f
  :END:
#+BEGIN_SRC emacs-lisp
  (setq org-format-latex-options (plist-put org-format-latex-options :scale 3.0))
  (setq org-format-latex-options (plist-put org-format-latex-options :foreground 'default))
  (setq org-format-latex-options (plist-put org-format-latex-options :background 'default))
#+END_SRC
* tramp
  :PROPERTIES:
  :ID:       0840c09c-ee49-46d7-942b-38ff98f9281d
  :END:
#+BEGIN_SRC emacs-lisp
  (setq tramp-terminal-type "tramp")
#+END_SRC
* rg
  :PROPERTIES:
  :ID:       e357e8bf-20cc-418c-981d-feee6b4432a7
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package rg
    :straight t
  )
#+END_SRC
* eaf
  :PROPERTIES:
  :ID:       7548c850-1c9e-4320-bc64-32a9002974d7
  :END:
BEGIN_SRC emacs-lisp
  ;; (use-package eaf
  ;;   :load-path "~/projects/emacs/emacs-application-framework" ; Set to "/usr/share/emacs/site-lisp/eaf" if installed from AUR
  ;;   :custom
  ;;   (eaf-find-alternate-file-in-dired t)
  ;;   :config
  ;;   (eaf-bind-key scroll_up "C-n" eaf-pdf-viewer-keybinding)
  ;;   (eaf-bind-key scroll_down "C-p" eaf-pdf-viewer-keybinding))

  ;; (defvar helm-bookmark-preds+
  ;;   '(helm-bookmark-org-file-p
  ;;     helm-bookmark-addressbook-p
  ;;     helm-bookmark-gnus-bookmark-p
  ;;     helm-bookmark-w3m-bookmark-p
  ;;     helm-bookmark-woman-man-bookmark-p
  ;;     helm-bookmark-info-bookmark-p
  ;;     helm-bookmark-image-bookmark-p
  ;;     helm-bookmark-file-p
  ;;     helm-bookmark-helm-find-files-p
  ;;     helm-bookmark-addressbook-p))

  ;; (define-advice helm-bookmark-uncategorized-bookmark-p (:override (bookmark) customize)
  ;;   "Return non--nil if BOOKMARK match no known category.

  ;; This uses `helm-bookmark-preds+' to make it easier to add categories."
  ;;   (cl-loop for pred in helm-bookmark-preds+
  ;;            never (funcall pred bookmark)))


  ;; (with-eval-after-load 'helm-bookmark
  ;;   (push 'helm-bookmark-eaf-p+ helm-bookmark-preds+)

  ;;   (defun helm-bookmark-eaf-p+ (bookmark)
  ;;     "Check if bookmark is an eaf bookmark."
  ;;     (eq (bookmark-get-handler bookmark)
  ;;         'eaf--bookmark-restore))


  ;;     (dolist (app '("browser" "pdf-viewer"))
  ;;       (push
  ;;        (helm-make-source (format "Bookmark %s" app) 'helm-source-filtered-bookmarks
  ;;          :init (lambda ()
  ;;                  (bookmark-maybe-load-default-file)
  ;;                  (helm-init-candidates-in-buffer
  ;;                      'global
  ;;                    (helm-bookmark-filter-setup-alist
  ;;                     (lambda (bookmark)
  ;;                       (equal (bookmark-prop-get bookmark 'eaf-app)
  ;;                              app))))))
  ;;        helm-bookmark-default-filtered-sources)))
END_SRC
* org-recoll
  :PROPERTIES:
  :ID:       55680a55-69a6-43ef-9ba8-992c4eb6b61b
  :END:
#+BEGIN_SRC emacs-lisp
  (use-package org-recoll
    :straight (:host github
               :repo "alraban/org-recoll")
  )
#+END_SRC
