prelude/personal/custom/config.el

(defun eshell-here ()
  "Opens up a new shell in the directory associated with the
current buffer's file. The eshell is renamed to match that
directory to make multiple eshell windows easier."
  (interactive)
  (let* ((parent (if (buffer-file-name)
                     (file-name-directory (buffer-file-name))
                   default-directory))
         (height (/ (window-total-height) 3))
         (name   (car (last (split-string parent "/" t)))))
    (split-window-vertically (- height))
    (other-window 1)
    (eshell "new")
    (rename-buffer (concat "*eshell: " name "*"))

    (insert (concat "ls"))
    (eshell-send-input)))

(global-set-key (kbd "C-!") 'eshell-here)

(use-package google-translate
  :straight t
  :config
  (setq google-translate-default-source-language "pl")
  (setq google-translate-default-target-language "en")
)

(setq org-format-latex-options (plist-put org-format-latex-options :scale 3.0))
(setq org-format-latex-options (plist-put org-format-latex-options :foreground 'default))
(setq org-format-latex-options (plist-put org-format-latex-options :background 'default))

(setq tramp-terminal-type "tramp")

(use-package rg
  :straight t
)

(use-package org-recoll
  :straight (:host github
             :repo "alraban/org-recoll")
)
